
label scene_six:
    scene кімната116_флешбек with dissolve
    play music "audio/Сцена 6/ФлешбекРобі.mp3"

    show павкадім сумна at left2 with dissolve
    show робі задоволений at right2 with dissolve
    робі "Що сьогодні не так? Щось сталося?"

    павка "Та наче нічого. Просто замислилась."

    "{i}Насправді мені просто було сумно."

    "{i}Я хотіла поділитися з Робі чимось особистим. Але відчувала, що воно йому геть не треба."

    show робі роздратований at right2 with dissolve
    робі "Так. Я тебе не розумію. І це не правильно. А знаєш, що правильно?"

    show павкадім задумлива at left2 with dissolve
    "{i}І справді, що?"

    show робі задоволений at right2 with dissolve
    робі "Так. Ти пам'ятаєш наше життєве кредо?"

    "{i}Взагалі, чи є щось правильне в світі, де ти відчуваєш самотність навіть наодинці з коханою людиною?"

    show павкадім розгублена at left2 with dissolve
    павка "Любов і задоволення?"

    робі "Любов і задоволення. Дай-но тебе поцілую."

    play sound "audio/Сцена 6/Поцілунок.mp3"
    show павкадім усміхнена at left2 with dissolve
    робі "Ось тобі доза годіуму і давай-но я краще розповім, яку програму для нас я підготував на сьогодні."

    робі "Спочатку ми закинемося годіумом-37 — і відчуємо солодку втому і підемо до твого ліжка."

    робі "Після прийому ти першу хвилину дуже хочеш спати, завмираєш, закриваєшся в собі, бачиш під повіками різнокольорові спалахи і зірочки, а потім поступово оживаєш."

    робі "Але рухи твої уповільнюються, а перспектива викривлюється так, що всі приміщення, в яких ти знаходишся, здаються тобі нереально величезними…"

    робі "Ти чуєш навколишніх людей ніби дуже здалеку і завжди дуже хочеш їм розказати щось захопливе, але не можеш дібрати не тільки слів, а й букв до тих слів."

    робі "У ліжку ми пробудемо десь до півночі, а враховуючи, що завтра і в тебе, і в мене вихідний, я прихопив запасні пляшки."

    робі "А як набридне — відкриємо ось ці три годіум-4596."

    show павкадім здивована at left2 with dissolve
    павка "Не чула про такий."

    show павкадім усміхнена at left2 with dissolve
    робі "Уяви собі найбурхливішу піжамну вечірку з бійкою подушками. Або якесь драйвове спортивне змагання."

    робі "Тільки від цього не буде ані крепатури, ані синців. Наші тіла ніжитимуться у кімнаті, в той час як наші запалені адреналіном (і усякими іншими гормонами) свідомості кайфуватимуть від драйву."

    show павкадім замріяна at left2 with dissolve
    павка "О-о-о…"

    робі "Ми будемо літати як автомобілі під куполом."

    робі "І наостанок я прихопив для нас дещо особливе."

    show павкадім здивована at left2 with dissolve
    павка "І що це?"

    робі "Це — найперший випуск годіуму."

    show павкадім нейтральна at left2 with dissolve
    робі "Після тієї серії, від якої люди покривалися волоссям та вмирали, звісно."

    робі "Це — годіум-2.0. Одна з останніх пляшок в Оазі. Коштує він дорого, і через це його й зняли з виробництва. Але!"

    show павкадім усміхнена at left2 with dissolve
    робі "Люба моя, цієї ночі ти дізнаєшся, як воно — бути на сьомому небі від щастя."

    "{i}Тоді я вирішила — геть сумні думки. Адже в нас є годіум."

    "{i}Як би там не було, ніч обіцяла бути яскравою."

    "{i}І я подумала. Може ну їх, мої жалюгідні спроби розважитися?"

    stop sound fadeout 4
    hide кімната116
    scene фон
    "..."

    "{i}Пройшло 7 годин"

    "..."

    павка "Ось воно яке — щастя."

    scene кімната116_флешбек_тріп with dissolve

    show павка кайф at left2 with dissolve
    show робі кайф at right2 with dissolve
    робі "А я казав, я тобі казав!"

    робі "Слава засновникам Купола."

    павка "Слава! І слава тим, хто вигадав годіум."

    робі "Я бачу блаженне сяйво, я усюди і ніде. Я — бог."

    павка "Слава тобі, боже."

    робі "Слава мені."

    #hide кімната116_флешбек_тріп
    scene фон with dissolve
    "..."

    "{i}Минув тиждень"

    "..."

    scene кімната116_флешбек
    show павка усміхнена at left2 with dissolve
    show робі нейтральний at right2 with dissolve
    "{i}Через кілька днів після тієї зустрічі дещо в моєму житті змінилося."

    "{i}І я вирішила поділитися цим з людиною, яку вважала найближчою."

    "{i}Те, що я придумала для нас із Робі, було моєю найгеніальнішою ідеєю."

    "{i}Серце аж підскакувало від нетерпіння."

    павка "Ти готовий?"

    show робі задоволений at right2 with dissolve
    робі "До сюрпризу? Так."

    show павка рішуча at left2 with dissolve
    павка "Як я і сказала, в нас сьогодні буде особливий вечір."

    робі "Ну що там, що ти для мене приготувала?"

    павка "Не лізь поперед батька в пекло!"

    павка "Особливий вечір полягатиме в тому…"

    павка "Що ми проведемо його БЕЗ ГОДІУМУ!"

    show робі наляканий at right2 with dissolve
    робі "Що-о-о-о-о?"

    show павка усміхнена at left2 with dissolve
    павка "Саме так!"

    павка "Я пропоную провести цей вечір без годіуму."

    show робі задоволений at right2 with dissolve
    робі "Ти пропонуєш обійтися найлегшим годіумом-94?"

    show павка рішуча at left2 with dissolve
    павка "Ні! Я пропоную взагалі нічого не вживати цього вечора"

    show робі роздратований at right2 with dissolve
    робі "Але ти сказала, що цей вечір буде щасливим! Як же він буде щасливим без годіуму?"

    робі "Ми ж будемо тут валятися просто як овочі!"

    робі "Ти хоч раз бачила щасливий овоч?"

    show павка роздратована at left2 with dissolve
    павка "А ти хоч раз бачив овоч?! Що взагалі таке — овочі? Ти знаєш? Я — ні"

    робі "Ну добре. Як тюбикі із синтетичним гідро-смаколиком. Так краще?"

    павка "Так. Але я все одно хочу, щоб ми весь цей вечір не вживали годіум."

    show робі сумний at right2 with dissolve
    робі "Слухай, може не треба? Це ж так дивно… Ну…"

    павка "Я пропоную тобі дещо натомість."

    робі "Що?"

    павка "Музику."

    робі "…"

    павка "Я заспіваю тобі одну пісню."

    робі "Валяй."

    stop music fadeout 3
    павка "..."

    play sound "audio/Пісні Павка/ПісняО2.mp3" fadeout 4
    робі "…"

    stop sound fadeout 5
    павка "Ну як?"

    play music "audio/Сцена 6/ФлешбекРобі.mp3"
    show робі роздратований at right2 with dissolve
    робі "Е-е-е…"

    робі "І що це було?"

    show павка сумна at left2 with dissolve
    павка "…"

    робі "Фігня якась. Слухай, ну годі вже — давай забудемо це фрікувате непорозуміння та й все."

    show робі задоволений at right2 with dissolve
    робі "Давай розливай, що там в тебе в запасі!"

    show павка рішуча at left2 with dissolve
    павка "…"

    show павка розгублена at left2 with dissolve
    павка "Але це й був мій сюрприз!"

    show робі злий at right2 with dissolve
    робі "Та що ти несеш, де мій годіум?!"

    show павка рішуча at left2 with dissolve
    павка "Ніде. Годіуму більше не буде. Я його більше не вживаю."

    show робі роздратований at right2 with dissolve
    робі "То ти…"

    робі "Ти стала невживанкою?"

    павка "Я не вживаю годіум увесь останній тиждень."

    робі "Ти? Без годіуму? Та ти ж помішана на ньому!"

    павка "Я знайшла спосіб від нього відмовитися. І я допоможу тобі."

    show робі сумний at right2 with dissolve
    робі "Годі, будь ласка. Тільки не починай завивати знов…"

    show павка сумна at left2 with dissolve
    павка "Але, Робі!"

    show робі злий at right2 with dissolve
    робі "Ні. З мене годі. Хочеш стати одним із тих фріків, що хизуються, мовляв, не вживають годіум, а потім раптово ріжуть собі вени у власній ванні — на здоров'я."

    робі "Але мене ти в це не втягнеш, зрозуміло?"

    робі "І коли ти накладеш на себе руки — тут, в Оазі, годіуму завалися — я буду довго з тебе реготати!"

    робі "Ти хочеш сама себе позбавити щастя повноцінного життя!"

    show павка рішуча at left2 with dissolve
    павка "Робі. Я більше не прийматиму годіум."

    show робі сумний at right2 with dissolve
    робі "Тоді хоча б дай мені свою другу робочу картку!"

    show павка здивована at left2 with dissolve
    павка "Що??! Охуїв!"

    show робі злий at right2 with dissolve
    робі "Дай мені картку. Я простий працівник з периферії міста! Я заслуговую на краще життя!"

    робі "Тобі-то що, ти нею не користуєшся! Скажеш, що загубила. Тим паче, що ти більше не плануєш приймати — віддай мені чортову картку!"

    "{i}У той момент я зрозуміла, що в нас нема зв'язку."

    show павка роздратована at left2 with dissolve
    павка "Ти мене не чуєш, єдине, що нас поєднувало — запобіжник встановленню зв'язку."

    павка "Як же довго я тікала від цієї думки!"

    show робі сумний at right2 with dissolve
    робі "Але ж ми тут заради цього! Любов і задоволення, пам'ятаєш?"

    робі "Адже життя складне, і люди на периферії міста живуть скрутно. Ми протистоїмо цьому, наш кайф — це наш бунт проти скрути."

    павка "Якщо я потрібна була тобі лише заради доступу до годіуму — то нам і справді говорити більше нема про що."

    show робі злий at right2 with dissolve
    робі "Невже ти не розумієш, що то важливо для мене?!"

    show павка зла at left2 with dissolve
    павка "А про мої почуття ти подумав?"

    робі "Суко, я тобі сказав — дай мені картку!"

    menu:
        "Заліпити Робі ляпаса":
            play sound "audio/Сцена 6/Ляпас.mp3"

    show робі наляканий at right2 with dissolve
    робі "Ах ти ж курво!"

    show робі роздратований at right2 with dissolve
    робі "Все зрозуміло — чхати ти хотіла на мене. Прощавай, Павко."

    menu:
        "От і добре":
            show павка роздратована at left2 with dissolve
            павка "Тому що саме цього я бажаю більше за все!"

        "О ні, тільки не це":
            show павка налякана at left2 with dissolve
            павка "О ні, тільки не це! Я помру без тебе, Робі"

            show павка зла at left2 with dissolve
            павка "Ти це хочеш почути? Не дочекаєшся"

    show павка зла at left2 with dissolve
    кімната "Пане, будь ласка, вийдіть із будинку. Бо інакше я негайно викличу Перевіряючих."

    робі "Та йду я, йду! З чого ви взагалі взяли, що мені тут подобається?"

    hide робі роздратований with dissolve
    павка "Котися під три чорти."

    hide павка зла with dissolve
    scene фон
    "..."

    scene автомат_годіум with dissolve
    play music "audio/Сцена 5/КопіяТемаМіста.mp3" fadeout 1

    show інкі скептична at right2 with dissolve
    show павка сумна at left2 with dissolve
    інкі "Павко! Ти що там, заснула? Ти спиш з відкритими очима?"

    show павка здивована at left2 with dissolve
    павка "А? Ні, просто поринула у спогади."

    інкі "Ну що, я свою частину зробила — тепер твоя черга."

    show павка усміхнена at left2 with dissolve
    павка "Ага, добре."

    scene фон with dissolve
    "{i}Минуло півгодини"

    scene автомат_годіум
    show інкі нейтральна at right2 with dissolve
    show павка весела at left2 with dissolve
    павка "Ну от і все!"

    "{i}Це було простіше, ніж я думала. П’ять хвилин - і все. Лайя не збрехав, це справді просто. Даремно я хвилювалась!"

    show інкі рішуча at right2 with dissolve
    інкі "Так, Павко, нам пора їхати далі. Вперед!"

    #hide інкі рішуча at right2 with dissolve
    #hide павка весел at left2 with dissolve
    scene фон with dissolve

    "{i}Весь день ми літаємо з одного сектору Купола в інший."

    "{i}Я використовую прилад, який дав мені Лайя, а сама внутрішньо тремчу від однієї думки про свою Втечу сьогодні ввечорі."

    "{i}Наближається вечір, і ми підїжджаємо до останнього на сьогдоні трансконектору."

    jump scene_seven
