
label scene_six:
    scene кімната116_флешбек with dissolve
    play music "audio/Сцена 6/ФлешбекРобі.mp3"

    show павкадім сумна at left2 with dissolve
    show робі задоволений at right2 with dissolve

    робі "Що сьогодні не так? Щось сталося?"

    павка "Та наче нічого. Просто задумалась"

    "{i}Насправді мені просто було сумно"

    "{i}Я хотіла поділитися з Робі чимось особистим. Але відчувала, що воно йому геть не треба"
    show павкадім нейтральна at left2
    show робі роздратований at right2
    робі "Так. Я тебе не розумію. І це не правильно. А знаєш, що правильно?"

    show павкадім задумлива at left2
    "{i}І справді, що?"

    show робі задоволений at right2
    робі "Так. Ти пам'ятаєш наше життєве кредо?"

    "{i}Взагалі, чи є щось правильне в світі, де ти відчуваєш самотність навіть наодинці з коханою людиною?"

    show павкадім розгублена at left2
    павка "Любов і задоволення?"

    робі "Любов і задоволення. Дай-но тебе поцілую"

    play sound "audio/Сцена 6/Поцілунок.mp3"
    show павкадім усміхнена at left2
    робі "Ось тобі доза годіуму і давай-но я краще розповім, яку програму для нас я підготував на сьогодні."

    робі "Спочатку ми закинемося годіумом-37 — і відчуємо солодку втому і підемо до твого ліжка"

    робі "Після прийому ти першу хвилину дуже хочеш спати, завмираєш, закриваєшся в собі, бачиш під повіками різнокольорові спалахи і зірочки, а потім поступово оживаєш"

    робі "Але рухи твої уповільнюються, а перспектива викривлюється так, що всі приміщення, в яких ти знаходишся, здаються тобі нереально величезними…"

    робі "Ти чуєш навколишніх людей ніби дуже здалеку і завжди дуже хочеш їм розказати щось захопливе, але не можеш дібрати не тільки слів, а й букв до тих слів"

    робі "У ліжку ми пробудемо десь до півночі, а враховуючи, що завтра і в тебе, і в мене вихідний, я прихопив запасні пляшки"

    робі "А як набридне — відкриємо ось ці три годіум-4596"
    show робі задоволений at right2
    show павкадім здивована at left2
    павка "Не чула про такий"

    show павкадім усміхнена at left2
    робі "Уяви собі найбурхливішу піжамну вечірку з бійкою подушками. Або якесь драйвове спортивне змагання"

    робі "Тільки від цього не буде ані крепатури, ані синців. Наші тіла ніжитимуться у кімнаті, в той час як наші запалені адреналіном (і усякими іншими гормонами) свідомості кайфуватимуть від драйву"

    show павкадім замріяна at left2
    павка "О-о-о…"

    робі "Ми будемо літати як автомобілі під куполом"

    робі "І наостанок я прихопив для нас дещо особливе"

    show павкадім здивована at left2
    павка "І що це?"

    робі "Це — найперший випуск годіуму"

    show павкадім нейтральна at left2
    робі "Після тієї серії, від якої люди покривалися волоссям та вмирали, звісно"

    робі "Це — годіум-2.0. Одна з останніх пляшок в Оазі. Коштує він дорого, і через це його й зняли з виробництва. Але!"

    show павкадім усміхнена at left2
    робі "Люба моя, цієї ночі ти дізнаєшся, як воно — бути на сьомому небі від щастя"

    "{i}Тоді я вирішила — геть сумні думки. Адже в нас є годіум"

    "{i}Як би там не було, ніч обіцяла бути яскравою"

    "{i}І я подумала. Може ну їх, мої жалюгідні спроби розважитися?"

    stop sound fadeout 4
    hide кімната116
    scene фон
    "..."
    "{i}Пройшло 7 годин"
    "..."

    павка "Ось воно яке — щастя"

    scene кімната116_флешбек_тріп with dissolve

    show павка під кайфом at left2
    show робі під кафом at right2
    робі "А я казав, я тобі казав!"

    робі "Слава засновникам Купола"

    павка "Слава! І слава тим, хто вигадав годіум"

    робі "Я бачу блаженне сяйво, я усюди і ніде. Я — бог"

    павка "Слава тобі, боже"

    робі "Слава мені"

    hide кімната116_флешбек_тріп
    scene фон

    "..."
    "{i}Минув тиждень"
    "..."

    scene кімната116_флешбек with dissolve
    show павка усміхнена at left2
    show робі нейтральний at right2
    "{i}Через кілька днів після тієї зустрічі дещо в моєму житті змінилося"

    "{i}І я вирішила поділитися цим з людиною, яку вважала найближчою"

    "{i}Те, що я придумала для нас із Робі, було моєю найгеніальнішою ідеєю"

    "{i}Серце аж підскакувало від нетерпіння"


    павка "Ти готовий?"

    show робі задоволений at right2
    робі "До сюрпризу? Так"

    show павка рішуча at left2
    павка "Як я і сказала, в нас сьогодні буде особливий вечір"

    робі "Ну що там, що ти для мене приготувала?"


    павка "Не лізь поперед батька в пекло!"

    павка "Особливий вечір полягатиме в тому…"

    павка "Що ми проведемо його БЕЗ ГОДІУМУ!"

    show робі наляканий at right2
    робі "Що-о-о-о-о?"

    show павка усміхнена at left2
    павка "Саме так!"

    павка "Я пропоную провести цей вечір без годіуму"

    show робі задоволений at right2
    робі "Ти пропонуєш обійтися найлегшим годіумом-94?"

    show павка рішуча at left2
    show робі роздратований at right2
    павка "Ні! Я пропоную взагалі нічого не вживати цього вечора"

    робі "Але ти сказала, що цей вечір буде щасливим! Як же він буде щасливим без годіуму?"

    робі "Ми ж будемо тут валятися просто як овочі!"

    робі "Ти хоч раз бачила щасливий овоч?"

    павка "А ти хоч раз бачив овоч?! Що взагалі таке — овочі? Ти знаєш? Я — ні"

    робі "Ну добре. Як тюбикі із синтетичним гідро-смаколиком. Так краще?"

    павка "Так. Але я все одно хочу, щоб ми весь цей вечір не вживали годіум"

    show робі сумний at right2
    робі "Слухай, може не треба? Це ж так дивно… Ну…"

    павка "Я пропоную тобі дещо натомість"

    робі "Що?"

    павка "Музику"

    робі "…"

    павка "Я заспіваю тобі одну пісню"

    робі "Валяй"

    павка "..."

    play sound "audio/Пісні Павка/ПісняО2.mp3" fadeout 4

    робі "…"

    stop sound fadeout 5
    павка "Ну як?"

    show робі роздратований at right2
    show павка розгублена at left2
    робі "Е-е-е…"


    show павка сумна at left2
    робі "І що це було?"

    show павка сумна at left2
    павка "…"

    робі "Фігня якась. Слухай, ну годі вже — давай забудемо це фрікувате непорозуміння та й все"

    show робі задоволений at right2
    робі "Давай розливай, що там в тебе в запасі!"

    павка "…"

    show павка розгублена at left2
    павка "Але це й був мій сюрприз!"

    show робі злий at right2
    робі "Та що ти несеш, де мій годіум?!"

    show павка рішуча at left2
    павка "Ніде. Годіуму більше не буде. Я його більше не вживаю"

    show робі роздратований at right2
    робі "То ти…"

    робі "Ти стала невживанкою?"

    павка "Я не вживаю годіум увесь останній тиждень"

    робі "Ти? Без годіуму? Та ти ж помішана на ньому!"

    павка "Я знайшла спосіб від нього відмовитися. І я допоможу тобі"

    show робі сумний at right2
    робі "Годі, будь ласка. Тільки не починай завивати знов…"

    show павка сумна at left2
    павка "Але, Робі!"

    show робі злий at right2
    робі "Ні. З мене годі. Хочеш стати одним із тих фріків, що хизуються, мовляв, не вживають годіум, а потім раптово ріжуть собі вени у власній ванні — на здоров'я"

    робі "Але мене ти в це не втягнеш, зрозуміло?"

    робі "І коли ти накладеш на себе руки — тут, в Оазі, годіуму завалися — я буду довго з тебе реготати!"

    робі "Ти хочеш сама себе позбавити щастя повноцінного життя!"

    show павка рішуча at left2
    павка "Робі. Я більше не прийматиму годіум"

    show робі сумний at right2
    робі "Тоді хоча б дай мені свою другу робочу картку!"

    show павка здивована at left2
    павка "Що??! Охуїв!"

    show робі злий at right2
    робі "Дай мені картку. Я простий працівник з периферії міста! Я заслуговую на краще життя!"

    робі "Тобі-то що, ти нею не користуєшся! Скажеш, що загубила. Тим паче, що ти більше не плануєш приймати — віддай мені чортову картку!"

    "{i}У той момент я зрозуміла, що наші стосунки втратили сенс"

    "{i}Власне, втратили вони його вже давно. Але я довго тікала від цієї думки"

    "{i}Від розуміння, що всі зв'язки між нами були лише ілюзією"

    menu:
        "В нас був лише годіум":
            show павка сумна at left2
            show робі роздратований at right2

    робі "Але ж ми тут заради цього! Любов і задоволення, пам'ятаєш?"

    робі "Адже життя складне, і люди на периферії міста живуть скрутно. Ми протистоїмо цьому, наш кайф — це наш бунт проти скрути"

    menu:
        "Ти більше не користуватимешся мною":
            show павка роздратована at left2

    павка "Якщо я потрібна була тобі лише заради доступу до годіуму — то нам і справді говорити більше нема про що"

    show робі злий at right2
    робі "Невже ти не розумієш, що то важливо для мене?!"
    show павка зла at left2
    павка "А про мої почуття ти подумав?"

    робі "Суко, я тобі сказав — дай мені картку!"

    menu:
        "Заліпити Робі ляпаса":
            play sound "audio/Сцена 6/Ляпас.mp3"

    show робі наляканий at right2
    робі "Ах ти ж курво!"

    show робі роздратований at right2
    робі "Все зрозуміло — чхати ти хотіла на мене. Прощавай, Павко"

    menu:
        "От і добре":
            павка "От і добре. Тому що саме цього я бажаю більше за все!"

        "О ні, тільки не це":
            show павка налякана at left2
            павка "О ні, тільки не це! Я помру без тебе, Робі"
            show павка зла at left2

    павка "Ти це хочеш почути? Не дочекаєшся"
    show павка зла at left2
    кімната "Пане, будь ласка, вийдіть із будинку. Бо інакше я негайно викличу поліцію"

    робі "Та йду я, йду! З чого ви взагалі взяли, що мені тут подобається?"
    hide робі роздратований with dissolve
    павка "Котися під три чорти"
    hide павка зла with dissolve
    scene фон
    "..."
    jump scene_seven
