
label scene_six:
    scene кімната116_флешбек with dissolve
    play music "audio/Сцена 6/ФлешбекРобі.mp3"

    show павкадім сумна at left2 with dissolve
    show робі задоволений at right2 with dissolve
    робі "Що сьогодні не так? Щось сталося?"

    show павкадім нейтральна at left2 with dissolve
    павка "Та наче нічого. Просто замислилась."

    "{i}Насправді мені було сумно."

    "{i}Мені вже деякий час чогось бракувало в наших відносинах. Але Робі, схоже, цим не переймався."

    show робі роздратований at right2 with dissolve
    робі "Так. Я тебе не розумію. Так не має бути. А знаєш, як має бути?"

    show павкадім задумлива at left2 with dissolve
    "{i}І справді, як?"

    "{i}Як має бути, якщо відчуваєш самотність навіть наодинці з коханою людиною?"

    show робі нейтральний at right2 with dissolve
    робі "Ти пам'ятаєш наше життєве кредо?"

    show павкадім розгублена at left2 with dissolve
    павка "Любов і задоволення?"

    show робі задоволений at right2 with dissolve
    робі "Любов і задоволення. Дай-но тебе поцілую."

    play sound "audio/Сцена 6/Поцілунок.mp3"
    show павкадім усміхнена at left2 with dissolve
    show робі нейтральний at right2 with dissolve
    робі "Отак краще! Тепер слухай, яку програму я підготував для нас на цей вечір."

    show робі задоволений at right2 with dissolve
    робі "Спочатку ми закинемося годіумом-37 — відчуємо солодку втому і підемо до твого ліжка."

    робі "Після прийому ти першу хвилину дуже хочеш спати, завмираєш, закриваєшся в собі, бачиш під повіками різнокольорові спалахи і зірочки, а потім поступово оживаєш."

    робі "Але рухи твої уповільнюються, а перспектива викривлюється так, що всі приміщення, в яких ти знаходишся, здаються тобі нереально величезними…"

    робі "Ти чуєш навколишніх людей ніби дуже здалеку і завжди дуже хочеш їм розказати щось захопливе, але не можеш дібрати не тільки слів, а й букв до тих слів."

    show робі нейтральний at right2 with dissolve
    робі "У ліжку ми пробудемо десь до півночі, а враховуючи, що завтра в тебе вихідний, я прихопив запасні пляшки."

    робі "А як набридне — відкриємо ось ці три годіум-4596."

    show павкадім здивована at left2 with dissolve
    павка "Не чула про такий."

    show робі задоволений at right2 with dissolve
    робі "Уяви собі найбурхливішу піжамну вечірку з бійкою подушками. Або якесь драйвове спортивне змагання."

    робі "Тільки від цього не буде ані болю в м'язах, ані синців."

    робі "Наші тіла ніжитимуться у кімнаті, в той час як наші запалені адреналіном свідомості кайфуватимуть від драйву."

    show павкадім замріяна at left2 with dissolve
    павка "О-о-о…"

    show робі кайф at right2 with dissolve
    робі "Ми будемо літати як автомобілі під куполом."

    show робі нейтральний at right2 with dissolve
    робі "І наостанок я прихопив для нас дещо особливе."

    show павкадім здивована at left2 with dissolve
    павка "І що це?"

    show робі кайф at right2 with dissolve
    робі "Це — найперший випуск годіуму."

    show робі нейтральний at right2 with dissolve
    робі "Перший безпечний, звісно, після тієї партії, від якої люди вкривались волоссям і помирали."

    робі "Це — годіум-2.0. Одна з останніх пляшок в Оазі. Коштує він дорого, і через це його зняли з виробництва."

    show павкадім задумлива at left2 with dissolve
    павка "Де ти взяв на все це кредити? Ти ж не працюєш останні півроку."

    show робі злий at right2 with dissolve
    робі "Ну от чого ти завжди намагаєшся все зіпсувати своїми запитаннями?"

    show робі нейтральний at right2 with dissolve
    робі "Ну подумаєш, взяв невеличкий кредит на твоє ім'я... Нічого особливого, ти ж працюєш, виплатимо згодом."

    show павкадім сумна at left2 with dissolve
    павка "Робі, не варто було цього робити. Міг хоча б зі мною порадитись."

    show робі нейтральний at right2 with dissolve
    робі "Люба моя, цієї ночі ти дізнаєшся, як воно — бути на сьомому небі від щастя. Повір мені, воно буде того варте!"

    show павкадім весела at left2 with dissolve
    "{i}Тоді я вирішила — геть сумні думки. Адже в нас був годіум, і ніч обіцяла бути яскравою."

    "{i}Може поговоримо про наші відносини якось іншим разом..."

    stop sound fadeout 4
    hide кімната116
    scene фон
    "..."

    "{i}Пройшло 7 годин"

    "..."

    павка "Ось воно яке — щастя."

    scene кімната116_флешбек_тріп with dissolve

    show павкадім кайф at left2 with dissolve
    show робі кайф at right2 with dissolve
    робі "А я казав, я тобі казав!"

    робі "Слава засновникам Купола."

    show павкадім весела at left2 with dissolve
    павка "Слава! І слава тим, хто вигадав годіум."

    show робі задоволений at right2 with dissolve
    робі "Я бачу блаженне сяйво, я усюди і ніде. Я — бог."

    show павкадім кайф at left2 with dissolve
    павка "Слава тобі, боже."

    show робі кайф at right2 with dissolve
    робі "Слава мені."

    scene фон with dissolve
    "..."

    "{i}Минув тиждень"

    "..."

    scene кімната116_флешбек
    "{i}Через кілька днів після тієї ночі сталось дещо важливе, і моє життя змінилось назавжди."

    "{i}Я вирішила поділитися цим з людиною, яку вважала найближчою."

    "{i}Серце аж підскакувало від нетерпіння."

    show павка усміхнена at left2 with dissolve
    show робі нейтральний at right2 with dissolve
    павка "Ти готовий?"

    show робі задоволений at right2 with dissolve
    робі "До сюрпризу? Так."

    show павка весела at left2 with dissolve
    павка "Як я і сказала, в нас сьогодні буде особливий вечір."

    павка "Особливий вечір полягає в тому…"

    павка "Що ми проведемо його БЕЗ ГОДІУМУ!"

    show робі нейтральний at right2 with dissolve
    робі "..."

    робі "Не прикольний жарт."

    show павка усміхнена at left2 with dissolve
    павка "Але це не жарт!"

    павка "Я пропоную провести цей вечір без годіуму."

    show робі задоволений at right2 with dissolve
    робі "Ти пропонуєш обійтися найлегшим годіумом-94?"

    show павка рішуча at left2 with dissolve
    павка "Ні! Я пропоную взагалі нічого не вживати цього вечора."

    show робі роздратований at right2 with dissolve
    робі "Але ти казала, що цей вечір буде щасливим! Яке щастя без дози?"

    робі "Ми будемо лежати як овочі і дивитися в стелю!"

    show павка нейтральна at left2 with dissolve
    павка "Ну чого одразу як овочі. Що взагалі таке овочі? Ти знаєш? Я - ні."

    павка "Я пропоную тобі дещо натомість."

    show робі нейтральний at right2 with dissolve
    робі "Що?"

    show павка замріяна at left2 with dissolve
    павка "Музику."

    show робі нейтральний at right2 with dissolve
    робі "…"

    show павка усміхнена at left2 with dissolve
    павка "Я заспіваю тобі одну пісню."

    show робі роздратований at right2 with dissolve
    робі "Валяй."

    stop music fadeout 3
    show павка співає at left2 with dissolve
    play sound "audio/Пісні Павка/ПісняО2.mp3" fadeout 4
    павка "..."

    робі "…"

    stop sound fadeout 5
    play music "audio/Сцена 2/КвартираПавки.mp3"
    show павка нейтральна at left2 with dissolve
    павка "Ну як?"

    show робі нейтральний at right2 with dissolve
    робі "Е-е-е…"

    show робі роздратований at right2 with dissolve
    робі "І що це було?"

    show павка сумна at left2 with dissolve
    павка "…"

    show робі нейтральний at right2 with dissolve
    робі "Фігня якась. Слухай, ну годі вже — давай забудемо це фрікувате непорозуміння та й все."

    show робі задоволений at right2 with dissolve
    робі "Давай розливай, що там в тебе в запасі!"

    show павка розгублена at left2 with dissolve
    павка "Але це і був мій сюрприз!"

    show робі злий at right2 with dissolve
    робі "Та що ти несеш, де мій годіум?!"

    show павка рішуча at left2 with dissolve
    павка "Ніде. Годіуму більше не буде. Я його більше не вживаю."

    show робі роздратований at right2 with dissolve
    робі "То ти…"

    show робі наляканий at right2 with dissolve
    робі "Ти стала невживанкою? Коли це сталося?"

    show павка нейтральна at left2 with dissolve
    павка "Я не вживаю годіум увесь останній тиждень."

    show робі наляканий at right2 with dissolve
    робі "Ти? Без годіуму? Та ти ж помішана на ньому!"

    show павка усміхнена at left2 with dissolve
    павка "Музика допомагає мені впоратися з ломкою. Вона допоможе і тобі!"

    show робі сумний at right2 with dissolve
    робі "Годі, будь ласка. Тільки не починай завивати знов…"

    show павка сумна at left2 with dissolve
    павка "Але, Робі!"

    show робі злий at right2 with dissolve
    робі "Ні. З мене годі. Хочеш стати одним із тих фріків, що хизуються, мовляв, не вживають годіум, а потім раптово ріжуть собі вени у власній ванні — на здоров'я."

    робі "Але мене ти в це не втягнеш, зрозуміло?"

    робі "І коли ти накладеш на себе руки — тут, в Оазі, де годіуму завалися — я буду довго з тебе реготати!"

    робі "Ти сама себе лишаєш щастя повноцінного життя!"

    show павка рішуча at left2 with dissolve
    павка "Робі. Я більше не прийматиму годіум."

    show робі сумний at right2 with dissolve
    робі "Тоді хоча б дай мені свою другу робочу картку!"

    show павка здивована at left2 with dissolve
    павка "Що??! Не забагато захотів?"

    show робі злий at right2 with dissolve
    робі "Дай мені картку. Я простий працівник з периферії! Я заслуговую на краще життя!"

    робі "Тобі що, ти нею не користуєшся! Скажеш, що загубила. Тим паче, що ти більше не плануєш приймати — віддай мені бісову картку!"

    "{i}У той момент я зрозуміла, що ми вже давно втратили зв'язок."

    show павка роздратована at left2 with dissolve
    павка "Ти мене не чуєш! Єдине, що нас поєднувало — залежність від цього клятого зілля."

    павка "Як же довго я тікала від цієї думки!"

    show робі сумний at right2 with dissolve
    робі "Але ж ми тут заради цього! Любов і задоволення, пам'ятаєш?"

    робі "Адже життя під куполом важке і скрутне. Ми протистоїмо цьому, наш кайф — це наш бунт проти скрути!"

    show павка зла at left2 with dissolve
    павка "Якщо тобі від мене потрібен був тільки годіум — то нам і справді говорити більше нема про що."

    show робі наляканий at right2 with dissolve
    робі "Невже ти не розумієш, що то важливо для мене?!"

    show павка сумна at left2 with dissolve
    павка "А про мої почуття ти подумав?"

    show робі злий at right2 with dissolve
    робі "Суко, я тобі сказав — дай мені картку!"

    menu:
        "Заліпити Робі ляпаса":
            play sound "audio/Сцена 6/Ляпас.mp3"

    show робі наляканий at right2 with dissolve
    робі "Ах ти ж курво!"

    show робі роздратований at right2 with dissolve
    робі "Все зрозуміло — чхати ти хотіла на мене. Прощавай, Павко."

    menu:
        "От і добре":
            show павка роздратована at left2 with dissolve
            павка "Саме цього я бажаю більше за все!"

        "О ні, тільки не це":
            show павка налякана at left2 with dissolve
            павка "О ні, тільки не це! Я помру без тебе, Робі."

            show павка роздратована at left2 with dissolve
            павка "Ти це хочеш почути? Не дочекаєшся."

    кімната "Пане, будь ласка, вийдіть із приміщення. Інакше я негайно викличу перевіряючих."

    show робі злий at right2 with dissolve
    робі "Та йду я, йду! З чого ви взагалі взяли, що мені тут подобається?"

    hide робі роздратований with dissolve
    show павка рішуча at left2 with dissolve
    павка "Котися під три чорти."

    hide павка рішуча with dissolve
    scene фон
    "..."

    scene автомат_годіум with dissolve
    play music "audio/Сцена 5/КопіяТемаМіста.mp3" fadeout 1

    show інкі скептична at right2 with dissolve
    show павка сумна at left2 with dissolve
    інкі "Павко! Ти що там, заснула?"

    show павка здивована at left2 with dissolve
    павка "А? Ні, просто поринула у спогади."

    show інкі нейтральна at right2 with dissolve
    інкі "Ну що, я свою частину зробила — тепер твоя черга."

    show павка усміхнена at left2 with dissolve
    павка "Ага, добре."

    scene фон with dissolve
    "{i}Минуло півгодини."

    scene автомат_годіум
    show інкі нейтральна at right2 with dissolve
    show павка весела at left2 with dissolve
    павка "Ну от і все!"

    "{i}Це було простіше, ніж я думала. Інкі навіть нічого не запідозрила. Лайя не збрехав, даремно я хвилювалась!"

    show інкі рішуча at right2 with dissolve
    інкі "Так, Павко, нам пора їхати далі. Вперед!"

    #hide інкі рішуча at right2 with dissolve
    #hide павка весел at left2 with dissolve
    scene фон with dissolve

    stop music fadeout 1
    "{i}Весь день ми літаємо з одного сектору Купола в інший."

    "{i}Я використовую прилад, який дав мені Лайя, а сама внутрішньо тремчу від однієї думки про свою Втечу сьогодні ввечорі."

    "{i}Наближається кінець нашої зміни. А ось і останній на сьогодні трансконектор."

    jump scene_seven
