label scene_ten:

    image машина_анімована_втеча = Movie(size=(2030, 1080), play="images/Scene 10/втеча_сміттевоз_анімація.ogv")
    "..."
    play music "audio/Сцена 10/Копія Тема Втечі.mp3"

    scene втеча_без_машини

    "{i}Я чекаю на водія там, де мені сказав бути Лайя"

    "{i}Пусті вулиці просякнуті тривогою"

    "{i}Ніхто не їде"
    play sound "audio/Сцена 10/Звук автомобіля.mp3"
    scene втеча_сміттевоз with dissolve
    "{i}Сміттєвозка?!"

    "{i}Кремезна машина виринає з-за рогу і приземлюється поруч зі мною. Це точно по мене"

    play sound "audio/Сцена 10/Звук Відкриття Дверей.mp3" fadeout 1

    невідомий "Доброго ранку, неофіте. Сьогодні ти заступила у свою перш зміну. Прошу тебе піднятися на борт"

    павка "Неофіте?"

    невідомий "Питання зараз недоречні. Піднімайся хутчіш, в нас сьогодні велика експортація відходів виробництва та споживання"

    "{i}У просторій кабіні сидить лисий чоловік. З голови у нього стирчить щось типу дред чи косичок. Виглядає дуже дивно"

    павка "Експортація відходів? Це ти про мене?"

    невідомий "Ну звісно! Ви, невживанці — відходи виробництва. Це, звісно, метафора. Мене Йербі кличуть. Повне ім'я Йербіонім Амікаріус, але друзі кличуть мене Йербі"

    menu:
        "Ти кого відходами назвав!":
            павка "Ти взагалі сміттєвозку водиш!"

            йербі "Не сміттєвозку, а сміттєвоз! А ти хоч би ім'я своє назвала"

            павка '"Павка"'

            йербі "Ось. Чесно кажучи, Павко…"

            йербі "Хоча для мене велика честь допомогати таким сміливим людям, як ти, але ти образила мою тачилу"

            йербі "А так робити не слід. У кожної машини є душа. І машину треба поважати"

        "Щось у цьому є, пане Йербі":
            павка "Ми всі продукт, але дехто не вписується в систему"

            йербі "Мені подобається твоє мислення"

            павка "А що це за нова мода така? Я про твою зачіску"

            йербі "Ой ні, про це ми точно говорити не будемо"

            йербі "Як-то кажуть, менше знаєш — краще спиш"

            йербі "Ну що, злітаймо!"

    play sound "audio/Сцена 10/Звук автомобіля.mp3"

    "{i}Він смикає перемикач, і ми злітаємо"

    scene машина_анімована_втеча

    "{i}Ми летимо низько над містом, як літають усі вантажівки"

    stop sound fadeout 3

    "{i}Пролітаємо над трансконекторами великими і маленькими. На кожному екрані сяє логотип Антаресу"

    "{i}На площі в центрі Оази зібралися люди з розмальованими обличчями. Дивно, але всі вони гарно вдягнені"

    "{i}Невже все настільки прогнило, що навіть мешканці Оази наважилися на бунт?"

    "{i}Чи справді то були мешканці Оази?"

    "{i}На моїх очах двоє Спостерігачів хапають маленьку жінку, ламають їй руки, а потім кудись ведуть"

    "{i}Ми наближаємося до височенної білої стіни"

    "{i}Це була непідступна межа для всіх периферійців і для більшості жителів Оази, але не для мене"

    "{i}Як держслужбовець, я перетинала її на робочому авто ледь не кожного дня"

    "{i}На таких, як ми з Інкі, трималося все тут. І ось — все змінилося"

    "{i}І тією людиною, що все це зламала, була я. Я і ще хтось з Годіум-Люксу"

    "{i}А може, нас було декілька?"

    "{i}Сміттєвоз стоїть у пробці хвилин з двадцять — перевіряють документи в усіх водіїв"

    "{i}По мірі того, як біла брама насувається на нас, нависає над нами, я все більше й більше напружуюсь"

    йербі "Що, лячно тобі?"

    "{i}Він питає це, як тільки ми пролетіли під білою брамою. І сміється"

    йербі "Не тільки авто Годіум-Люксу можуть пролітати крізь браму без перевірок. Сміттєвози вільно циркулюють по Куполу і навіть трохи за його межами"

    "{i}Раптом я бачу в дзеркало заднього виду перевіряючого"

    "{i}Йербі теж його помічає, це видно по його напруженому обличчю. Але поки перевіряючий не ввімкнув гучномовець, в нас ще є трохи надії"

    "{i}Ми пролітаємо над смердючими трубами заводів, де люди працюють пліч о пліч із роботами. Може, не так все й погано, і перевіряючий мене просто відпустить?"

    "{i}Аж раптом у дзеркалі заднього виду з’являється круглий металевий шар розміром трохи більше голови людини. Він складає свої щупи та повільно наздоганяє сміттєвоз"

    play sound "audio/Сцена 8/Звук робота.mp3"

    перевіряючий "УВАГА, УВАГА. ПЕРЕВІРКА АЕРОТРАНСПОРТУ. ПРОСИМО ЗУПИНИТИСЯ. ПОВТОРЮЮ: УВАГА, УВАГА…"

    йербі "Слухай сюди, Павко. Я мав провезти тебе до самого виходу з Куполу, але все пішло не за планом"

    йербі "В мене пустий кузов і я не на робочій зміні. Щось мені підказує, що я не пройду цю перевірку"

    йербі "Тож це твій єдиний шанс на порятунок, тож слухай і запам'ятовуй"

    йербі "Спочатку перевіряючий підлетить до моїх дверцят і перевірить мої документи, потім полетить до кузову перевіряти його металошукачем, і вже після цього перевірятиме другого водія"

    йербі "Коли робот буде точно позаду кузова, ти маєш бігти в провулок. Он бачиш? Там в кінці тупік, але ще й каналізаційний люк. І якщо тобі пощастить, і люк буде відкритий, то ти врятована"

    йербі "Спустишся в люк і пройдеш по тунелю. Тебе знайде наша людина і відведе, куди треба. Я вже надіслав йому сигнал SOS"

    павка "Як він мене знайде?"

    йербі "Там живуть люди, які виконують найбруднішу роботу в цьому місті. Ти відрізятимешся"

    play sound "audio/Сцена 10/Звук Натискання Кнопки.mp3"

    "{i}Йербі натискає на кнопку на панелі управління"

    йербі "Увага, перевіряючий. Говорить водій сміттєвоза. Приземлення через три, дві…"

    "{i}Все відбувається дуже швидко. Йербі показує роботу документи, робот перевіряє їх і летить обстежувати кузов"

    "{i}Йербі підморгує мені, вистрибує з кабіни і йде за Перевіряючим"

    "{i}Я нахиляюсь до дзеркала заднього виду з боку водія. Перевіряючий зникає за кутом кузова"


    menu:
        "Відчинити дверцята":
            hide screen countdown
            play sound "audio/Сцена 10/Звук Відкриття Дверей.mp3"

            "{i}В мене обмаль часу. Що робити далі?"

            play sound "audio/Сцена 8/Звук Таймера.mp3"
            $ time = 5
            $ timer_range = 5
            $ timer_jump = 'proval_10'

            show screen countdown

            menu:
                "Тихо злізти на землю. Повзти по-пластунськи":
                    jump proval_10

                "Зістрибнути з кабіни. Бігти":
                    hide screen countdown
                    stop sound
                    "{i}Коли я бігла вздовж довгого коридору з будинків, у мене в голові була одна думка"

                    "{i}Що я відчую, коли перевіряючий мене схопить?"

                    "{i}Дивно, але мене ніхто не переслідував"

                    "{i}Я зупинилася. І почула звуки боротьби"


                    йербі "БІЖИ Я ЙОГО ТРИМАЮ!! СВОБОДУ ВІД КУПОЛУ!"

                    play sound "audio/Сцена 10/Звук Рикошету.mp3" fadeout 1
                    "{i}Я добігаю до каналізаційного люку і чую постріл і стогін. Йербі…"

                    "{i}На щастя, люк відчинений. Я спускаюсь вниз іржавими сходинками і закриваю за собою люк…"

                    "{i}...щоб в останній момент побачити Перевіряючого, що летів на мене на повній швидкості"

                    play sound "audio/Сцена 10/Звук Рикошету.mp3" fadeout 1
                    "..."

                    stop music fadeout 3
                    stop sound

                    scene фон with dissolve
                    "{i}Встигла!"

                    "..."
                    play sound "audio/Сцена 10/Нога Ступає В Калюжу.mp3" fadeout 1
                    "{i}Коли нога стає на підлогу, лунає плескіт води"

                    "{i}Моїм міжмир'ям була непроглядна темрява. І тиша"

                    павка "І куди тепер іти? Вправо? Чи вліво?"

                    "{i}Нікуди, дитинко. Ти вже прийшла. Це твій кінець. Ти загубишся у підземному лабіринті, серед слизької плісняви та бетону"

                    "{i}Марно навіть намагатися. Ти все одно загубишся. Ти вже загубилася"

                    "{i}Але може, воно й накраще? Он людина загинула через тебе. Він був хорошою людиною, Йербі. Ти ж бачила по його очах"

                    павка "Так, але…"

                    павка "Ні. Це не найкраще"

                    павка "Я тут тому, що йду до музики. Я не зупинюся ні за що. Музика зцілює рани, заплетає розірване полотно життя"

                    павка "А ти усього лише примара, і я тебе більше не хочу бачити"

                    "{i}Ну і йди за своєю музикою. Скучна ти дівка, Павко. Ну тебе до біса"

                    "{i}І він зникає"

                    play sound "audio/Сцена 10/Приглушені Голоси.mp3" fadeout 1

                    павка "Це що, люди??"

                    menu:
                        "Йти на звук":
                            павка "Хай буде що буде"

                    "..."
                    scene фон
                    jump scene_eleven

label proval_10:
    перевіряючий "Підзорювану діслоковано. Починаю операцію перехоплення"
    scene фон
    "..."
    jump scene_ten
