label scene_three:

    scene трансконектор

    show павка нейтральна at left2 with dissolve

    play music "audio/Сцена 3/МістоАмбієнт.mp3"

    "{i}Старий добрий трансконектор. Елітна приблуда, яку я, можливо, бачу в останній раз"
    '{i}Ті самі обшарпані стіни, ті самі багаті втичери. Закинулися зранку годіумом і втичуть у Лампи Радості. Або може, краще назвати їх "Лампивтичерами"? Сумна картина...'

    show павка рішуча at left2
    "{i}Он та сама лавочка. Мені туди"

    show павка налякана at left2
    "{i}Трохи лячно"

    show павка рішуча at left2
    "{i}Але спочатку треба взяти в автоматі пляшку годіуму"

    menu:
        "Взяти годіум":
            play sound "audio/Сцена 2/КришкаCмітника2.mp3"

    "..."
    menu:
        "Сісти":
            play sound "audio/Сцена 3/Шурхіт.mp3"


    show лайя затемнений at right2 with dissolve

    лайя "Залізяці корозія"

    show павка замріяна at left2
    "{i}Це той самий приємний голос"

    show павка нейтральна at left2
    павка "Людям — кайф"

    show павка задумлива at left2
    "{i}Як же все це дивно. А раптом за нами слідкують? Звідки мені знати, що он той хлопець — не перевдягнений КОП? Або он ті дві дівчини?"
    лайя "Не повертайся до мене. Роби вигляд, що приймаєш годіум"

    show павка здивована at left2
    "{i}Блін. Легше сказати ніж зробити"
    лайя "Непомітно вилий зміст флакону на підлогу. Зроби вигляд, наче годіум почав діяти"

    menu:
        "Зробити відсторонений вигляд":
            павка "..."
    show павка задумлива at left2

    "{i}Мабуть, краще просто робити, що він каже. Він знає всі ці системи краще за мене"

    show павка рішуча at left2
    "{i}Нікому не вір, довіряй лише собі. Ти пам'ятаєш, як в останній раз довірилася людині?"
    "{i}Довірилася Робі. І чим все закінчилося?"

    show павка задумлива at left2

    "{i}Я маю контролювати ситуацію — я, а не якийсь там куратор"

    show павка рішуча at left2
    "{i}Хоча! Мабуть, краще просто робити, що каже куратор. Він знає всі ці державні системи слідкування краще за мене"

    show павка здивована at left2
    лайя "Зроби вигляд, наче годіум почав діяти"
    лайя "Наче розмовляєш сама з собою під дією препарату"

    menu:
        "Просто зробити, що він каже":
            $покора_лайі=покора_лайі+1
            "{i}..."
        "А що як помітять?!":
            павка "А що як помітять, що я зробила це навмисне?"
            лайя "Довірся мені"

    show павка нейтральна at left2
    "{i}Вже й не пам'ятаю, як змінюється свідомість під годіумом"

    show павка здивована at left2
    "{i}Ніколи в житті не удавала з себе когось іншого!"

    show павка розгублена at left2
    "{i}Щоки горять, а долоні спітніли"
    "{i}Я перейшла межу закону, говорю з підпільником!"
    "{i}Тепер все що завгодно може статися"

    show павка рішуча at left2
    play music "audio/Пісні Павка/ПісняА2.mp3" fadeout 3

    "{i}..."

    show павка весела at left2
    "{i}Фух, відпустило. Це завжди мене заспокоює"
    stop music fadeout 2
    play music "audio/Сцена 3/МістоАмбієнт.mp3" fadeout 2

    show павка нейтральна at left2
    "{i}Мабуть, він це почув..."

    show павка весела at left2
    павка "Ото дива! Все таке красиве, всі такі гарні! Он там красуня йде… Так, красуня. Може підійти познайомитися, га?"

    лайя "Мені доповідали, що ти особлива. Тепер я чую це на власні вуха"
    show павка рішуча at left2
    павка "Музика — то мій власний спосіб вижити в цьому світі"

    лайя "Твоє бажання звільнитися з під тиранії Куполу — природне."
    лайя "Але шлях до свободи не буде легким. Нам потрібна допомога людини з твоїми навичками"

    show павка задумлива at left2
    "{i}А в голограмі казав, що ваше завдання легке…"
    "{i}Я можу про це сказати. А можу не казати, раптом це його образить?"

    menu:
        "{i}Звернути увагу на розбіжність у його словах":
            $відносини_лайя += 1

            show павка рішуча at left2
            павка "Так, я хочу втекти звідси. Але в голограмі ти казав, що складно мені не буде"

            show павка розгублена at left2
            павка "Я трохи хвилююся, як бачиш!"

            лайя "Ти прямолінійна. Мені це подобається"

            show павка весела at left2
            "{i}Так, я така!"

        "{i}Посваритися на Лайю":
            show павка роздратована at left2
            павка "За кого ти мене приймаєш? В голограмі казав, що буде легко, тільки, щоб заманити мене сюди, так? Бо тепер ти змінив свої показання!"

            show павка розгублена at left2
            павка "Я бляха-муха збентежена і розгублена!"

            лайя "Ти прямолінійна. Мені це подобається"
            show павка роздратована at left2
            "{i}Ага, так я і повірила! Нема впевненості в його голосі. Не подобаюсь я йому!"

        "{i}Просто зробити, як він каже":
            $покора_лайі=покора_лайі+1
            show павка розгублена at left2
            "{i}Пальці холонуть, серце б'ється швидше. Це все відбувається ніби не зі мною"
            "{i}Це тривога, найдавніший людський інстинкт"

            павка "Так, але... Я трохи хвилююся"

    show павка нейтральна at left2
    павка "Нічого особистого, просто, розумієш…"
    show павка розгублена at left2
    павка "Для тебе це частина роботи. Сьогодні — мій доленосний день"
    show павка сумна at left2
    павка "І мій останній в зрозумілому мені світі"

    лайя "Я вже багато років живу так, наче кожен мій день — останній"

    павка "Я багато років працювала, щоб дослужитися до цієї позиції. Щоб жити в Оазі, а не на периферії міста"
    павка "Кожен день мого життя — цеглина. І з них складається моє теперішнє"
    павка "Я ДУЖЕ хочу опинитися на волі. На волі, а не в одиночній камері"

    лайя "Я добре тебе розумію. Я був за межами Купола"

    show павка задумлива at left2
    павка "Тоді чому ти зараз тут?"

    лайя "…"

    "{i}Як же хочется повернутися і подивитися йому в очі! Але це може бути небезпечно…"

    menu:
        "Обернутися і подивитися йому в очі":
            $ renpy.notify('Gained achievement: "Що казали його очі?"')
            $відносини_лайя += 1
            play sound "audio/Сцена 3/Шурхіт.mp3"
            show павка весела at left2
            show лайя сумний at right2
            "..."
            show лайя обурений at right2
            лайя "Що?!"
            menu:
                "повернутись назад":
                    play sound "audio/Сцена 3/Шурхіт.mp3"

            show павка розгублена at left2
            лайя "Я не просто так сказав тобі не обертатися. Ти тільки-но поставила під загрозу і себе, і мене"

            show павка задумлива at left2
            "{i}Голос звучить металево і недоброзичливо. Схоже, він наляканий"

            show лайя нейтральний at right2
            show павка розгублена at left2
            павка "Вибач! Я не хотіла"

        "{i}Просто чекати на відповідь":
            show павка нейтральна at left2
            show лайя затемнений at right2
            лайя "Зараз не час для сумнівів. Ти зробиш те, що я скажу, а натомість отримаєш те, чого так палко бажаєш"

            #show лайя рішучий at right2
            лайя "Свободу від Куполу"
            лайя "Свободу від годіуму"
            лайя "Музику"

            show павка здивована at left2
            павка "Ти знаєш про музику?"
            #павка "Що ти знаєш про музику?"

            #show лайя нейтральний at right2
            лайя "Я знаю достатньо, щоб розуміти, чому за можливість її творити варто ризикнути всім, що в тебе є"
            лайя "Мій статус дає мені доступ до інформації, яку приховують від людей. Ти не уявляєш собі, наскільки далеко сягає брехня Оази"

            show павка задумлива at left2
            "{i}І Чому я маю йому вірити? Хоча..."
            "{i}Може, він розповість щось про музику Давніх?"

            show павка здивована at left2
            #show лайя усміхнений at right2
            лайя "За межами Куполу існує світ, Павко. Світ без годіуму і тиранії Оази. Де можна створювати що завгодно і не боятися переслідувань"

            menu:
                "{i}Розкажи ще":
                    $відносини_лайя += 1
                    #show лайя рішучий at right2
                    show павка здивована at left2
                    лайя "Я міг би розповісти тобі про Вічнозелене місто. Про стародавні манускріпти, що розмовляють музикою. Про Гори, що чекають на пісню Шукача, про Великий Плач і про Вежу Думок"
                    "{i}Звучить просто неймовірно! Може справді буде нагода поговорити про все це?"
                    лайя "Але все це не на часі. Можливо, колись у нас ще буде можливість поговорити"

                    show павка замріяна at left2
                    #show лайя нейтральний at right2
                    павка "А ти вмієш інтригувати! То яке у тебе для мене завдання?"

                "{i}Я знала! Знала!!" :
                    $відносини_лайя += 1
                    show павка весела at left2
                    #show лайя нейтральний at right2
                    павка "Я так і думала!"
                    павка "Адже там немає ніякої Оази, немає жодних автоматів, що видають наркотики"

                    #show лайя усміхнений at right2
                    лайя "Ти розумніша, ніж здається. Це добре. Але ти навіть не уявляєш, про що говориш. Я теж не уявляв, доки не побачив на власні очі"

                    show павка замріяна at left2
                    "Він мене інтригує. Мені здається, що в нас є трохи спільного бачення"

                    show павка рішуча at left2
                    #show лайя нейтральний at right2
                    павка "Так що ти хочеш, щоб я зробила? Я маю на увазі, що треба від мене організації, яку ти представляєш?"

                "{i}Пфф. Спроба вразити detected":
                    show павка роздратована at left2
                    #show лайя нейтральний at right2

                    павка "Я і так це знаю! Ти ж не думаєш, що я така сама наївна, як інші мешканці Куполу?"

                    #show лайя рішучий at right2
                    лайя "Ти нічого не знаєш, Павко. Світ за межами куполу більший, ніж ти можеш уявити. Втім, згодом ти сама все побачиш"
                    show павка задумлива at left2
                    "Якщо подумати, то він правий. Не уявляю. Треба обережніше з цим типом"

                    show павка рішуча at left2
                    павка "Так що я маю зробити, щоб ти допоміг мені вибратися з Куполу?"

            show павка нейтральна at left2
            #show лайя нейтральний at right2
            лайя "Що ж, спершу ти повинна зібрати для мене інформацію"
            лайя "Ми збираємо дані про споживачів годіуму"

            menu:
                "{i}Поцікавитися, навіщо це їм":
                    $відносини_лайя += 1
                    show павка задумлива at left2
                    павка "Навіщо це вам? Якщо це не черговий страшний секрет"

                    #show лайя обурений at right2
                    лайя "Я не можу тобі це сказати"

                "{i}Не сувати свого носа в чужі справи":
                    "{i}..."


            show павка нейтральна at left2
            #show лайя нейтральний at right2
            лайя "Сьогодні ти вийдеш на роботу, як завжди. В місті чимало автоматів з годіумом, і деякі з них час від часу ламаються. Ви будете відповідати на виклики і приїжджати ремонтувати автомати, як завжди"

            show павка задумлива at left2
            "{i}Ага, сьогодні якраз багато роботи"

            show павка нейтральна at left2
            лайя "Але сьогодні, як ти знаєш, не звичайний день. Замість свого стандартного діагностичного приладу ти будеш використовувати той, що знайдеш під місцем, на якому зараз сидиш"

            show павка здивована at left2
            menu:
                "{i}Пошарити рукою під сидінням":
                    play sound "audio/Сцена 3/Шурхіт.mp3"

            "{i}Ой, до лави справді щось приліплено!"
            stop sound


            павка "Виглядає так само, як мій прилад для діагностики. Цікаво, звідки в них такий точний дублікат? "

            show павка нейтральна at left2
            лайя "Як ти знаєш, кожен автомат обладнаний блоком для збору й обробки даних. Він знаходиться на основній платі, за центральним процесором"
            лайя "Ти приєднаєшся до нього за допомогою цього приладу та ініціюєш протокол діагностики. Після того, як процедура буде завершена, ти дістанеш прилад і закриєш кришку автомата"

            show павка задумлива at left2
            павка "І це все?"

            show павка нейтральна at left2
            лайя "Не так вже й складно, правда? Після завершення робочого дня ти знищиш цей прилад у дезинтеграторі і вирушиш на вулицю Чисту, будинок 2"
            лайя "Там, біля рекламного білборду,на тебе чекатиме людина в капелюсі. Вона передасть тобі посвідчення технічного співробітника наукової експедиції"

            лайя "Захопи вдома теплий одяг і вирушай з цим посвідченням до південно-східної брами. Там, біля пункту пропуску, ти знайдеш групу вчених. "
            лайя "Серед них буду і я. Підійди до мене і скажи, що ти моя нова асистентка. Разом ми вийдемо за межі Куполу і ти будеш вільна"

            лайя "Запам'ятала?"

            show павка рішуча at left2
            павка "Так, кураторе Лайо"

            #show лайя усміхнений at right2
            лайя "Добре. Є питання?"

            #show лайя нейтральний at right2
            menu:
                "{i}Що я скажу Інкі?":
                    show павка розгублена at left2
                    павка "Що я скажу своїй напарниці?"

                    лайя "Не кажи їй нічого — ані про мене, ані про свою місію. Якщо буде задавати питання — вигадай щось. Я знаю, що ти вважаєш її своєю подругою, але в нас немає підстав їй довіряти"
                    menu:
                        "Вона мені не подруга":
                            show павка роздратована at left2
                            павка "Вона мені не подруга, ми просто працюємо разом"

                            лайя "Тим краще. Сподіваюсь, ти розумієш, що залишити нашу розмову в таємниці — в твоїх інтересах"
                            show павка нейтральна at left2

                        "Я не вмію брехати!":
                            show павка розгублена at left2
                            павка "А що як вона здогадається? В мене все на обличчі написано, я не зможу це приховати!"

                            #show лайя рішучий at right2
                            лайя "Ти так довго успішно приховувала від усіх свою таємницю, і сьогодні теж впораєшся. Інакше ти наразиш себе на таку небезпеку, що навіть я не зможу тебе захистити"

                "{i}Що, як мене побачить Перевіряючі?":
                    show павка розгублена at left2
                    павка "Що, як мене побачить Перевіряючі?"
                    лайя "І що? Ти технік-ремонтник, виконуєш свою роботу. Хіба це протизаконно?"

                "{i}А це точно безпечно?":
                    show павка розгублена at left2
                    павка "А це точно безпечно? На мене не почнеться полювання, чи ще щось?"

                    #show лайя рішучий at right2
                    лайя "Ти вже наразила себе на небезпеку тим, що прийшла на зустріч зі мною. Але хіба цей ризик не вартий того, щоб нарешті звільнитися від тиранії Оази?"

                    show павка рішуча at left2
                    павка "Так, але... Ти не відповів на запитання"

                    #show лайя нейтральний at right2
                    лайя "Це безпечно. Як я сказав, ми просто збираємо інформацію. Все пройде плавно, якщо ти будеш вести себе розумно і не втрачатимеш пильності. Більшого гарантувати тобі я не можу"

            show павка нейтральна at left2
            #show лайя нейтральний at right2

            павка "В мене є ще одне питання"

            #show лайя здивований at right2
            лайя "Так?"

            show павка задумлива at left2
            павка '"Куратор". Слово наче знайоме, але воно застаріле. Що воно означає?'

            #show лайя нейтральний at right2
            лайя "Провідник. Наставник"

            if відносини_лайя >= 2:
                #show лайя усміхнений at right2
                лайя "Чесно кажучи, не люблю я весь цей бюрократичний пафос. Будь ласка, називай мене просто Лайя"
                show павка усміхнена at left2
                define лайя = Character("Лайя", color = "ff0a54" )
                павка "Добре, Лайя"

            лайя "В мене до тебе теж є питання."
            #show лайя усміхнений at right2
            лайя "Мелодія, яку ти наспівала. Вона мені сподобалась. Як вона називається?"
            show павка здивована at left2

            "{i}Я навіть не здогадувалась, що мелодіям можна давати імена!"

            menu:
                "Коли зелінь ожива":
                    "{i}..."
                "Там, поза атмосферою":
                    "{i}..."
                "Душа вітру":
                    "{i}..."


            show павка усміхнена at left2
            #show лайя усміхнений at right2
            лайя "Дякую, що поділилася"
            лайя "І дякую тобі за твою довіру"
            show павка нейтральна at left2
            #show лайя нейтральний at right2
            лайя "Бувай"

            show павка рішуча at left2
            павка "Слава заснов..."

            #show лайя злий at right2
            "{i}Стоп... Дурна звичка"

            show павка весела at left2
            павка "Бувай"
            #show лайя нейтральний at right2
            stop music fadeout 3
            scene фон
            "{i}..."
            jump scene_four
    define лайя = Character("Куратор Лайя", color = "ff0a54" )
    show павка нейтральна at left2
    show лайя нейтральний at right2
    лайя "Зараз не час для сумнівів. Ти зробиш те, що я скажу, а натомість отримаєш те, чого так палко бажаєш"

    show лайя рішучий at right2
    лайя "Свободу від Куполу"
    лайя "Свободу від годіуму"
    лайя "Музику"

    show павка здивована at left2
    павка "Ти знаєш про музику?"
    #павка "Що ти знаєш про музику?"

    show лайя нейтральний at right2
    лайя "Я знаю достатньо, щоб розуміти, чому за можливість її творити варто ризикнути всім, що в тебе є"
    лайя "Мій статус дає мені доступ до інформації, яку приховують від людей. Ти не уявляєш собі, наскільки далеко сягає брехня Оази"

    show павка задумлива at left2
    "{i}І чому я маю йому вірити? Хоча..."
    "{i}Може він розповість щось про музику Давніх?"

    show павка здивована at left2
    show лайя усміхнений at right2
    лайя "За межами Куполу існує світ, Павко. Світ без годіуму і тиранії Оази. Де можна створювати що завгодно, і не боятися переслідувань"

    menu:
        "{i}Розкажи ще":
            $відносини_лайя += 1
            show лайя рішучий at right2
            show павка здивована at left2
            лайя "Я міг би розповісти тобі про Вічнозелене місто. Про стародавні манускріпти, що розмовляють музикою. Про Гори, що чекають на пісню Шукача, про Великий Плач і про Вежу Думок"
            "{i}Звучить просто неймовірно! Може справді буде нагода поговорити про все це?"
            лайя "Але все це не на часі. Можливо, колись у нас ще буде можливість поговорити"

            show павка замріяна at left2
            show лайя нейтральний at right2
            павка "А ти вмієш інтригувати! То яке у тебе для мене завдання?"

        "{i}Я знала! Знала!!" :
            $відносини_лайя += 1
            show павка весела at left2
            show лайя нейтральний at right2
            павка "Я так і думала!"
            павка "Адже там немає ніякої Оази, немає ніяких автоматів, що видають наркотики"

            show лайя усміхнений at right2
            лайя "Ти розумніша, ніж здається. Це добре. Але ти навіть не уявляєш, про що говориш. Я теж не уявляв, доки не побачив на власні очі"

            show павка замріяна at left2
            "Він мене інтригує. Здається, що в нас є трохи спільного бачення"

            show павка рішуча at left2
            show лайя нейтральний at right2
            павка "Так що ти хочеш, щоб я зробила? Я маю на увазі, що треба від мене вашій організації?"

        "{i}Пфф. Спроба вразити detected":
            show павка роздратована at left2
            show лайя нейтральний at right2

            павка "Я і так це знаю! Думаєш я така ж наївна, як і інші мешканці Куполу?"

            show лайя рішучий at right2
            лайя "Ти нічого не знаєш, Павко. Світ за межами куполу більший, ніж ти можеш уявити. Втім, згодом ти і сама все побачиш"
            show павка задумлива at left2
            "Якщо подумати, то він правий: не уявляю. Треба обережніше з цим типом. Я навіть обличчя його не бачу. А він про мене знає немало"

            show павка рішуча at left2
            павка "Так що я маю зробити, щоб ти допоміг мені вибратися з Куполу?"

    show павка нейтральна at left2
    show лайя нейтральний at right2
    лайя "Що ж, спершу ти повинна зібрати для мене інформацію"
    лайя "Ми збираємо дані про споживачів годіуму"

    menu:
        "{i}Поцікавитися, навіщо це їм":
            $відносини_лайя += 1
            show павка задумлива at left2
            павка "Навіщо це вам? Якщо це не черговий страшний секрет"

            show лайя обурений at right2
            лайя "Я не можу тобі цього сказати"

        "{i}Не сувати свого носа в чужі справи":
            "{i}..."


    show павка нейтральна at left2
    show лайя нейтральний at right2
    лайя "Сьогодні ти вийдеш на роботу як завжди. В місті чимало автоматів з годіумом, і деякі з них час від часу ламаються. Ви будете відповідати на виклики і приїжджати ремонтувати автомати, як завжди"

    show павка задумлива at left2
    "{i}Ага, сьогодні якраз багато роботи"

    show павка нейтральна at left2
    лайя "Але сьогодні, як ти знаєш, не звичайний день. Замість свого стандартного діагностичного приладу ти будеш використовувати той, що знайдеш під місцем, на якому зараз сидиш"

    show павка здивована at left2
    menu:
        "{i}Пошарити рукою під сидінням":
            play sound "audio/Сцена 3/Шурхіт.mp3"

    "{i}Ой, до лави справді щось приліплено!"
    stop sound

    павка "Виглядає так само, як мій прилад для діагностики. Цікаво, звідки в них такий точний дублікат?"

    show павка нейтральна at left2
    лайя "Як ти знаєш, кожен автомат обладнаний блоком для збору і обробки даних. Він знаходиться на основній платі, за центральним процесором"
    лайя "Ти приєднаєшся до нього за допомогою цього приладу й ініціюєш протокол діагностики. Після того, як процедура буде завершена, ти дістанеш прилад і закриєш кришку автомата"

    show павка задумлива at left2
    павка "І це все?"

    show павка нейтральна at left2
    лайя "Не так вже й складно, правда? Після завершення робочого дня ти знищиш цей прилад у дезинтеграторі і вирушиш за адресою вул. Д, будинок 2"
    лайя "Там, біля рекламного білборду на тебе чекатиме людина в капелюсі. Вона передасть тобі посвідчення технічного співробітника наукової експедиції"

    лайя "Захопи вдома теплий одяг і вирушай з цим посвідченням до південно-східної брами. Там, біля пункту пропуску, ти знайдеш групу вчених"
    лайя "Серед них буду і я. Підійди до мене і скажи, що ти моя нова асистентка. Разом ми вийдемо за межі Куполу і ти будеш вільна"

    лайя "Запам'ятала?"

    show павка рішуча at left2
    павка "Так, кураторе Лайо"

    show лайя усміхнений at right2
    лайя "Добре. Є питання?"

    show лайя нейтральний at right2
    menu:
        "{i}Що я скажу Інкі?":
            show павка розгублена at left2
            павка "Що я скажу своїй напарниці?"

            лайя "Не кажи їй нічого — ні про мене, ні про свою місію. Якщо буде задавати питання — вигадай щось. Я знаю, що ти вважаєш її своєю подругою, але в нас немає підстав їй довіряти"
            menu:
                "Вона мені не подруга":
                    show павка роздратована at left2
                    павка "Вона мені не подруга, ми просто працюємо разом"

                    лайя "Тим краще. Сподіваюсь, ти розумієш, що залишити нашу розмову в таємниці — в твоїх інтересах"
                    show павка нейтральна at left2

                "Я не вмію брехати!":
                    show павка розгублена at left2
                    павка "А що, як вона здогадається? В мене все на обличчі написано, я не зможу це приховати!"

                    show лайя рішучий at right2
                    лайя "Ти так довго успішно приховувала від усіх свою таємницю, і сьогодні теж впораєшся. Інакше ти наразиш себе на таку небезпеку, що навіть я не зможу тебе захистити"

        "{i}Що, як мене побачить Перевіряючі?":
            show павка розгублена at left2
            павка "Що, як мене побачить Перевіряючі?"
            лайя "І що? Ти технік-ремонтник, виконуєш свою роботу. Хіба це протизаконно?"

        "{i}А це точно безпечно?":
            show павка розгублена at left2
            павка "А це точно безпечно? На мене не почнеться полювання, чи ще щось?"

            show лайя рішучий at right2
            лайя "Ти вже наразила себе на небезпеку тим, що прийшла на зустріч зі мною. Але хіба цей ризик не вартий того, щоб нарешті звільнитися від тиранії Оази?"

            show павка рішуча at left2
            павка "Так, але... Ти не відповів на запитання"

            show лайя нейтральний at right2
            лайя "Це безпечно. Як я і сказав, ми просто збираємо інформацію. Все пройде плавно, якщо ти будеш вести себе розумно і не втрачатимеш пильності. Більшого гарантувати тобі я не мож."

    show павка нейтральна at left2
    show лайя нейтральний at right2

    павка "В мене є ще одне питання"

    show лайя здивований at right2
    лайя "Так?"

    show павка задумлива at left2
    павка '"Куратор". Слово наче знайоме, але воно застаріле. Що воно означає?'

    show лайя нейтральний at right2
    лайя "Провідник. Наставник"

    if відносини_лайя >1:
        show лайя усміхнений at right2
        лайя "Чесно кажучи, не люблю я весь цей бюрократичний пафос. Будь ласка, звертайся до мене просто Лайя"
        define лайя = Character("Лайя", color = "ff0a54" )
        show павка усміхнена at left2
        павка "Добре, Лайя"

    лайя "В мене до тебе теж є питання."
    show лайя усміхнений at right2
    лайя "Мелодія, яку ти наспівувала. Вона мені сподобалась. Як вона називається?"
    show павка здивована at left2

    "{i}Я навіть не здогадувалася, що мелодіям можна давати імена!"

    menu:
        "{i}Коли зелень оживає":
            "{i}..."
        "{i}Поза атмосферою планети":
            "{i}..."
        "{i}Душа вітру":
            "{i}..."


    show павка усміхнена at left2
    show лайя усміхнений at right2
    лайя "Дякую, що поділилася"
    лайя "І дякую тобі за твою довіру"
    show павка нейтральна at left2
    show лайя нейтральний at right2
    лайя "Бувай"

    show павка рішуча at left2
    павка "Слава заснов..."

    show лайя злий at right2
    "{i}Стоп... Дурна звичка"

    show павка весела at left2
    павка "Бувай"
    show лайя нейтральний at right2
    stop music fadeout 3
    scene фон
    "{i}..."
    jump scene_four
