label scene_twelve:
    scene кімната116_флешбек_1
    play music "audio/Сцена 11/Катакомби Амбієнт I.mp3"

    "То був самий звичайний вечір, ми з Інкі відпрацювали свою зміну і розійшлися по домах"

    "Я вже збиралася лягти спати, аж раптом залунав телефонний дзвінок"

    menu:
        "Відповісти на дзвінок":

            мама "В нашому секторі автомати не видають годіум. Батькові не вистачило дози. Вже втретє за останні два дні"

            мама "Йому дуже важко — боюся, що може відмовити серце"

            павка "Чому ви мені раніше не сказали? Я б ще вчора вам його привезла"

            мама "Не хотіли тебе турбувати… Павонько, приїжджай, благаю! Приїжджай і привези нам годіум"

            павка "Зараз беру машину в колежанки та їду"

            menu:
                "Зателефонувати Інкі":

                    інкі "Слухаю"

                    павка "Дай машину. В моєї сім'ї дуже важка ситуація. Потрібно терміново відвезти годіум"

                    інкі "Співчуваю тобі, Павко, але машина в ремонті. Пам'ятаєш, в ній весь день щось тарахтіло не так, як треба?"

                    інкі "До ранку її мають відремонтувати. Можеш з'їздити перед роботою"

                    павка "Але мені терміново треба!"

                    інкі "Співчуваю тобі, але…"

                    #*дзіннь - звук кидання трубки*

                    "В мене ще не було знайомств. На той момент я працювала в Оазі лише кілька місяців. Варіантів здобути автомобіль було не багато"

                "Подзвонити у головний офіс":

                    автовідповідач "Нажаль, відділок автотранспорту зараз не працює. Зателефонуйте завтра. У разі, якщо виникли скарги та пропозиції, можемо з'єднати вас з відділком скарг та про…"

                    menu:
                        "Кинути трубку":

                            павка "Чорт!"

                            #*дзвінннь - звук кидання трубки*

                "Зайти до сусідки":

                    #*стук у металеві двері*

                    павка "привіт, Суйро, можеш дати мені свою машину?"

                    суйра "Так, можу"

                    суйра "Але лише завтра, бо сьогодні її мій син забрав — він зараз у трансконекторі на периферії міста"

                    павка "От халепо!"

                    суйра "Щось сталося?"

                    "Суйра — корінна жителька Оази. Але я все ж таки спробувала"

                    павка "Моєму батьку погано. Він живе на периферії міста"

                    суйра "Який жах! І що з ним? В мене сестра медик, може вона допоможе…"

                    павка "В їхньому секторі вже другий день немає годіуму"

                    суйра "А-а-а… Он воно що"

                    "Я читала на її обличчі презирство разом з огидою"

                    суйра "Слухай, Павко. Тільки-но пригадала, що маю термінові справи. Маю йти. Бувай!"

            "Можна було б піти туди пішки — але дійду я туди не раніше, ніж завтра вранці"

            "Наш з Інкі робочий аеромобіль долетає до нашого сектору за двадцять дев'ять хвилин, якщо летіти досить високо"

            "Але більшість жителів Оази не мають дозволу там літати"

            "Можна було б заплатити кому-небудь, щоб довез мене до нашого сектору — але в мене на той момент не було грошей, щоб купити час багатія"

            "Дзвони батькам, Павко. Більше тобі нічого не залишається"

            menu:
                "Подзвонити батькам":
                    батько "так, доню?"

                    павка "Тобі тяжко?"

                    батько "Та ні, в мене все добре. Ну, майже все"

                    "Його безсилий голос було ледве чутно. В мене опускалися руки. Я не знайшла виходу. І мій Батько помре через мене"

                    павка "Нажаль я не зможу приїхати. В мене нема доступу до автотранспорту. Я зможу приїхати тільки зранку"

                    #*зітхання*

                    батько "Дотягну якось до ранку. Вранці ти приїдеш?"

                    павка "Обов'язково приїду"

                    павка "Я можу тобі якось допомогти, тату?"

                    батько "Просто побудь зі мною тут і зараз"

                    павка "Як ти почуваєшся? Що в тебе болить?"

                    батько "Наче всі сили з мене хтось висмоктав. І тягне в грудях. Тільки мамі своїй не кажи — вона думає, що в мене може статися серцевий напад"

                    "За кілька годин в нього станеться серцевий напад. Він знав це. Я знала це. Він знав, що я знаю"

                    батько "Та не будемо про те…"

                    батько "Пам'ятаєш, я тобі якось розповідав про гори? Мені про те бабуся розповіла, а їй — її бабуся, вона бачила гори"

                    батько 'Я уявляю собі, що піднявся на гору і бачу знизу воду, що тече та завивається… То називається "річка", а її завитки називаються "меандрами". Так красиво'

                    батько "Я уявляю то собі, і мені стає трохи легше…"

                    павка "А знаєш, одного разу річка мені наснилася. Вода в ній була блакитна"

                    #*звук зітхання від болю*

                    батько "Ай! От курво…."

                    павка "Що таке?"

                    батько "Та нічого. Вже все нормально. Просто… Невеличка судома"

                    'Я знала, що це НЕ нормально. Ці "невеличкі" судоми, якщо нічого з ними не зробити, ламають кістки. Я маю щось зробити'

                    "Останній тиждень в мене була дурна звичка. Тарабанити пальцями на панелі машини, коли ми були з Інкі"

                    "В мене був ритм"

                    "І я пригадала свій сон про блакитну річку. У води був голос. Вище, нижче, тонкіше, грубіше"

                    "Але в голосу ріки не було ритму"

                    "І тут мені в голову прийшла ідея! Я поєднала ритм і голос"

                    "В мене вийшло щось зовсім інше. Просто так, з першого разу — мої вуста заговорили прадавньою мовою музики"

                    #*пісня Павки*

                    павка "…"

                    батько "Що це було?"

                    батько "Доню, мені стало легше. Біль відступив!"

                    батько "Донечко, ти прогнала мій біль і мою скруту! Я не знаю, як ти це зробила, але твій голос наче був голосом самої річки. Її водограїв та притоків"

                    батько "І ще прабабуся розповідала про пісні. Здається, це воно і є"

                    батько "Заспіваєш мені ще?"

                    #*пісня Павки*
                    "..."
                    "....."
