label scene_twelve:
    scene кімната116_флешбек_1
    play music "audio/Сцена 12/Флешбек З Батьком.mp3"

    "{i}То був самий звичайний вечір, ми з Інкі відпрацювали свою зміну і розійшлися по домах"

    "{i}Я вже збиралася лягти спати, аж раптом залунав телефонний дзвінок"

    menu:
        "Відповісти на дзвінок":

            show павкадім розгублена at left2
            мама "В нашому секторі автомати не видають годіум. Батькові не вистачило дози. Вже втретє за останні два дні"

            show павкадім розгублена at left2
            мама "Йому дуже важко — боюся, що може відмовити серце"

            show павкадім зла at left2
            павка "Чому ви мені раніше не сказали? Я б ще вчора вам його привезла"

            show павкадім розгублена at left2
            мама "Не хотіли тебе турбувати… Павонько, приїжджай, благаю! Приїжджай і привези нам годіум"

            show павкадім рішуча at left2
            павка "Зараз беру машину в колежанки та їду"

            menu:
                "Зателефонувати Інкі":

                    show павкадім рішуча at left2
                    show інкі2 нейтральна at right2
                    інкі "Слухаю"

                    павка "Дай машину. В моєї сім'ї дуже важка ситуація. Потрібно терміново відвезти годіум"

                    show павкадім здивована at left2
                    show інкі2 сумна at right2
                    інкі "Співчуваю тобі, Павко, але машина в ремонті. Пам'ятаєш, в ній весь день щось тарахтіло не так, як треба?"

                    show інкі2 весела at right2
                    інкі "До ранку її мають відремонтувати. Можеш з'їздити перед роботою"

                    show павкадім роздратована at left2
                    павка "Але мені терміново треба!"

                    show інкі2 сумна at right2
                    інкі "Співчуваю тобі, але…"

                    play sound "audio/Сцена 12/Звук Кидання Трубки.mp3"

                    show павкадім розгублена at left2
                    hide інкі2 сумна at right2
                    "{i}В мене ще не було знайомств. На той момент я працювала в Оазі лише кілька місяців. Варіантів здобути автомобіль було не багато"

                "Подзвонити у головний офіс":

                    show павкадім рішуча at left2
                    автовідповідач "Нажаль, відділок автотранспорту зараз не працює. Зателефонуйте завтра. У разі, якщо виникли скарги та пропозиції, можемо з'єднати вас з відділком скарг та про…"

                    menu:
                        "Кинути трубку":

                            show павкадім зла at left2
                            павка "Чорт!"

                            play sound "audio/Сцена 12/Звук Кидання Трубки.mp3"

                "Зайти до сусідки":

                    show павкадім рішуча at left2
                    play sound "audio/Сцена 12/Стук В Металеві Двері.mp3"

                    павка "привіт, Суйро, можеш дати мені свою машину?"

                    суйра "Так, можу"

                    суйра "Але лише завтра, бо сьогодні її мій син забрав — він зараз у трансконекторі на периферії міста"

                    show павкадім роздратована at left2
                    павка "От халепо!"

                    суйра "Щось сталося?"

                    show павкадім нейтральна at left2
                    "{i}Суйра — корінна жителька Оази. Але я все ж таки спробувала"

                    show павкадім сумна at left2
                    павка "Моєму батьку погано. Він живе на периферії міста"

                    суйра "Який жах! І що з ним? В мене сестра медик, може вона допоможе…"

                    show павкадім розгублена at left2
                    павка "В їхньому секторі вже другий день немає годіуму"

                    суйра "А-а-а… Он воно що"

                    "{i}Я чула в її мовчанні презирство разом з огидою"

                    суйра "Слухай, Павко. Тільки-но пригадала, що маю термінові справи. Маю йти. Бувай!"

            "{i}Можна було б піти туди пішки — але дійду я туди не раніше, ніж завтра вранці"

            "{i}Наш з Інкі робочий аеромобіль долетає до нашого сектору за двадцять дев'ять хвилин, якщо летіти досить високо"

            show павкадім задумлива at left2
            "{i}Але більшість жителів Оази не мають дозволу там літати"

            "{i}Можна було б заплатити кому-небудь, щоб довез мене до нашого сектору — але в мене на той момент не було грошей, щоб купити час багатія"

            show павкадім сумна at left2
            "{i}Дзвони батькам, Павко. Більше тобі нічого не залишається"

            menu:
                "Подзвонити батькам":
                    show павкадім сумна at left2
                    show батько нейтральний at right2
                    батько "так, доню?"

                    павка "Тобі тяжко?"

                    show павкадім нейтральна at left2
                    show батько посміхається at right2
                    батько "Та ні, в мене все добре. Ну, майже все"

                    show павкадім сумна at left2
                    "{i}Його безсилий голос було ледве чутно. В мене опускалися руки. Я не знайшла виходу. І мій Батько помре через мене"

                    show павкадім розгублена at left2
                    show батько нейтральний at right2
                    павка "Нажаль я не зможу приїхати. В мене нема доступу до автотранспорту. Я зможу приїхати тільки зранку"

                    play sound "audio/Сцена 12/Зітхання.mp3"

                    show батько посміхається at right2
                    батько "Дотягну якось до ранку. Вранці ти приїдеш?"

                    show павкадім весела at left2
                    show батько нейтральний at right2
                    павка "Обов'язково приїду"

                    show павкадім задумлива at left2
                    павка "Я можу тобі якось допомогти, тату?"

                    show батько посміхається at right2
                    батько "Просто побудь зі мною тут і зараз"

                    show павкадім розгублена at left2
                    show батько нейтральний at right2
                    павка "Як ти почуваєшся? Що в тебе болить?"

                    show батько пригнічений at right2
                    батько "Наче всі сили з мене хтось висмоктав. І тягне в грудях. Тільки мамі своїй не кажи — вона думає, що в мене може статися серцевий напад"

                    show павкадім сумна at left2
                    "{i}За кілька годин в нього станеться серцевий напад. Він знав це. Я знала це. Він знав, що я знаю"

                    show батько посміхається at right2
                    батько "Та не будемо про те…"

                    батько "Пам'ятаєш, я тобі якось розповідав про гори? Мені про те бабуся розповіла, а їй — її бабуся, вона бачила гори"

                    батько 'Я уявляю собі, що піднявся на гору і бачу знизу воду, що тече та завивається… То називається "річка", а її завитки називаються "меандрами". Так красиво'

                    батько "Я уявляю то собі, і мені стає трохи легше…"

                    show павкадім усміхнена at left2
                    павка "А знаєш, одного разу річка мені наснилася. Вода в ній була блакитна"

                    play sound "audio/Сцена 12/Зойк Від Болю.mp3"

                    show павкадім розгублена at left2
                    show батько пригнічений at right2
                    батько "Ай! От курво…."

                    павка "Що таке?"

                    батько "Та нічого. Вже все нормально. Просто… Невеличка судома"

                    show павкадім сумна at left2
                    '{i}Я знала, що це НЕ нормально. Ці "невеличкі" судоми, якщо нічого з ними не зробити, ламають кістки. Я маю щось зробити'

                    show павкадім задумлива at left2
                    "{i}Останній тиждень в мене була дурна звичка. Тарабанити пальцями на панелі машини, коли ми були з Інкі"

                    "{i}В мене був ритм"

                    show павкадім замріяна at left2
                    "{i}І я пригадала свій сон про блакитну річку. У води був голос. Вище, нижче, тонкіше, грубіше"

                    "{i}Але в голосу ріки не було ритму"

                    show павкадім рішуча at left2
                    "{i}І тут мені в голову прийшла ідея! Я поєднала ритм і голос"

                    "{i}В мене вийшло щось зовсім інше. Просто так, з першого разу — мої вуста заговорили прадавньою мовою музики"

                    stop music
                    #*пісня Павки*
                    play sound "audio/Пісні Павка/ПісняО2.mp3"

                    show павкадім співає at left2
                    павка "…"

                    show павкадім здивована at left2
                    show батько нейтральний at right2
                    батько "Що це було?"

                    show батько умиротворений at right2
                    батько "Доню, мені стало легше. Біль відступив!"

                    батько "Донечко, ти прогнала мій біль і мою скруту! Я не знаю, як ти це зробила, але твій голос наче був голосом самої річки. Її водограїв та притоків"

                    show павкадім усміхнена at left2
                    батько "І ще прабабуся розповідала про пісні. Здається, це воно і є"

                    show батько посміхається at right2
                    батько "Заспіваєш мені ще?"

                    #*пісня Павки*
                    stop sound
                    play sound "audio/Пісні Павка/ПісняО2.mp3"

                    hide батько посміхається at right2
                    hide павка усміхнена at left2

                    scene фон

                    "..."

                    stop sound
                    play music "audio/Сцена 11/Тема Нижніх Катакомб Приглушена ІІ.mp3"

                    scene катакомби_1

                    show павка2 здивована at left2
                    "{i}Що це? Я чую музику? Тут?"

                    "{i}То он як вони виживають без годуму! І нема в тому нічого дивного"

                    show павка2 усміхнена at left2
                    "{i}Це ясно як білий день"

                    show павка2 весела at left2
                    show генто нейтральний at right2
                    павка "Ви живете без годіуму завдяки музиці"

                    show павка2 нейтральна at left2
                    show генто усміхнений at right2
                    генто "Так... І завдяки багато чому ще"

                    show генто нейтральний at right2
                    генто "Давай рухатися швидше, нам ще довго йти"

                    hide генто нейтральний at right2
                    show павка2К рішуча at left2
                    "{i}Але я не можу просто пройти повз це.. Я чую справжню музику — вперше в моєму житті!"

                    menu:
                        "Іти за музикою":
                            scene фон
                            "..."
                            jump scene_thirteen
