label scene_five:
    $обіцянка_інкі = False

    play music "audio/Сцена 5/КопіяТемаМіста.mp3" fadeout 1
    scene автомат_годіум_стрічка with dissolve
    show інкі весела at right2 with dissolve
    show павка нейтральна at left2 with dissolve
    інкі "О! Перевіряючі тут вже побували."

    show інкі здивована at right2 with dissolve
    інкі "Ти була права — його обікрали."

    show інкі задумлива at right2 with dissolve
    інкі "Може в тебе дар передбачення?"

    show павка весела at left2 with dissolve
    павка "Не кажи дурниць, Інкі. Краще допоможи мені зняти ці стрічки."

    show павка задумлива at left2 with dissolve
    play sound "audio/Сцена 5/ЗвукЦелофановихСтрічок.mp3"
    scene автомат_годіум with dissolve

    "{i}Інкі не повинна знати, що я допомагаю підпільній організації. Треба придумати, як мені ввести ті знаки в код програми і не спалитися."

    show інкі роздратована at right2 with dissolve
    інкі "Так, подивимося, що тут у нас…"

    play sound "audio/Сцена 5/ЗвукВідкриттяАвтомату.mp3"
    show інкі весела at right2 with dissolve
    інкі "Як ти і казала. Годіуму немає."

    інкі "…"

    show інкі роздратована at right2 with dissolve
    інкі "Але це ще не все! Уявляєш, тут не тільки годіум поцупили, ще й викачали весь код."

    show інкі здивована at right2 with dissolve
    інкі "ВЕСЬ! КОД!!!11"

    show павка здивована at left2 with dissolve
    "{i}Такого ще не було. Може, то справа рук організації, до якої належить Лайя?"

    show павка рішуча at left2 with dissolve
    павка "Оце хлопці дали жару…"

    show інкі скептична at right2 with dissolve
    інкі "Що? Ти їх знаєш?"

    show павка розгублена at left2 with dissolve
    павка "Звісно ні... Але погодься — зробити той обсяг роботи в такий короткий час, це треба мати вражаючі здібності."

    show інкі задумлива at right2 with dissolve
    інкі "І як Перевіряючі могли упустити це? Просто не вкладається в голові."

    show інкі весела at right2 with dissolve
    інкі "Треба викликати перевіряючих."

    show павка налякана at left2 with dissolve
    павка "Тількі не це!"

    show інкі скептична at right2 with dissolve
    інкі "А-га! Злякалася, що всі дізнаються, що ти в нас Невживанка?"

    show павка розгублена at left2 with dissolve
    "{i}Йой, щось я розхвилювалася."

    "{i}Треба взяти себе в руки."

    show павка рішуча at left2 with dissolve
    павка "І не злякалася зовсім. Просто…"

    інкі "Просто що?"

    "{i}І справді, що?"

    menu:
        "Нав'яжуть бюрократію":
            show павка весела at left2 with dissolve
            павка "Просто не хочу гаяти свій час на посиденьки над їхньою бюрократією. Ну ти знаєш — в них купа документації. Ми знов всю обідню перерву в їхньому відділку просидимо."

        "Де перевіряючі — там і нещасні випадки":
            show павка рішуча at left2 with dissolve
            павка "Не хочу залучати сюди перевіряючих. Де перевіряючі — там завжди хто-небудь помирає або травмується."

    if відносини_інкі < 2:
        show інкі нейтральна at right2 with dissolve
        інкі "Як скажеш. Мені пофіг, якщо чесно. Але якщо що — вся відповідальність на тобі."
    else:
        show інкі задумлива at right2 with dissolve
        інкі "Та та… Мабуть, і справді краще не треба…"

    show павка нейтральна at left2 with dissolve
    павка "Давай просто надішлемо їм повідомлення, як закінчимо тут і виїдемо в наступний сектор."

    show інкі задумлива at right2 with dissolve
    інкі "Бо це ж ми в секторі А-91О, тут злочинність зашкалює."

    show інкі налякана at right2 with dissolve
    інкі "Якщо якийсь фрік знов до нас приїбеться, то мені тиждень бедтріпів гарантований."

    show інкі рішуча at right2 with dissolve
    інкі "Передай мені електронний ключ під номером 91-ОЩ. Я спробую тут швиденько закінчити."

    menu:
        "Зробити що вона каже":
            show павка весела at left2 with dissolve
            павка "Тримай."

    play sound "audio/Сцена 5/ЗвукВідкриттяАвтоматуГарний.mp3"
    "{i}Так, коли мова йде про трансконектори, Інкі не має рівних."

    "{i}Технік другого розряду у ї 21 — це вам не жарти!"

    show інкі нейтральна at right2 with dissolve
    інкі "А знаєш, Павко, я вчора читала в новинах, що сектор А104-Р тепер перший в антирейтингу по самогубствах."

    show павка сумна at left2 with dissolve
    павка "М-хм. Ми ж тамтешній трансконектор минулого тижня три рази ремонтували!"

    інкі "Отож-бо й воно… І то тільки в нашу зміну. Які там хакери — там ніхто не париться. В людей агресія зашкалює, ось вони й крушать все, що бачать."

    show павка задумлива at left2 with dissolve
    павка "Здається, туди зменшили постачання годіуму? На три чи чотири кредити?"

    інкі "Ну то й що? Вони можуть більше працювати, щоб потрапити в кращі райони…"

    інкі "Я ж змогла якось видертися звідти… Через нестачу годіуму в мене був важкий стан, але я наполегливо працювала і тому тепер живу в самій Оазі."

    show павка рішуча at left2 with dissolve
    павка "Не у всіх є ті можливості, що були в тебе. В когось є малі діти або хворі в сім'ї — вони не працюють. А їсти всі хочуть."

    павка "Хто має більше часу та сил, той розвиває свою кар'єру. А хто ні — той вішається на колготках або з даху стрибає."

    show інкі розгублена at right2 with dissolve
    інкі "Так, але в мене…"

    show інкі весела at right2 with dissolve
    інкі "Забудь."

    інкі "Я просто найкраща!"

    show інкі рішуча at right2 with dissolve
    інкі "Так, а тепер не заважай мені — маю ввести код."

    define робі = Character("???")

    show павка налякана at left2 with dissolve
    show робі нарік злий at center with dissolve
    робі "Гей ти, де мій годіум, жінко?"

    show робі нарік роздратований at center
    "{i}О мій бог"

    "{i}Кого я бачу."

    "{i}Як же він жахливо виглядає."

    show павка рішуча at left2 with dissolve
    define робі = Character("Робі")
    інкі "Віджени того придурка. Він мені світло затуляє."

    show робі нарік злий at center with dissolve
    робі "Де мій годіум? Я тебе питаю, дурепо!"

    show робі нарік роздратований at center with dissolve
    павка "Пане, прохання відійти — ви заважаєте працювати ремонтній бригаді."

    show робі нарік злий at center with dissolve
    робі "Я заслужив свій базовий годіум! І я нікуди не піду з цього місця, поки його не отримаю!"

    show павка рішуча at left2 with dissolve
    павка "Прошу вас, пане, відійдіть."

    робі "Ти що, охрініла?"

    if відносини_інкі >=2:

        if годіум_інкі < 1:
            play sound "audio/Сцена 5/ЗвукПляшкиЯкуХоваютьНазад.mp3"
            show інкі роздратована at right2 with dissolve
            інкі "Та дай ти йому той годіум... Он у мене в машині ще доза є. Пожалій людину."

            show павка сумна at left2 with dissolve
            "{i}Ти просто не знаєш, що це за людина, Інкі."

        if годіум_інкі == 1:
            show інкі розгублена at right2 with dissolve
            інкі "Я б віддала йому свою дозу, але в мене зайвої не лишилося. Доведеться тобі щось вигадати."

            "{i}О, я вже знаю що мені робити!"

            show робі нарік роздратований at center with dissolve
            menu:
                "Застосувати електрошокер":
                    scene автомат_годіум at shaking
                    play sound "audio/Сцена 5/ЗвукЕлектрошокера.mp3"
                    show робі нарік злий at center with dissolve
                    show павка зла at left2 with dissolve
                    show інкі розгублена at right2 with dissolve
                    павка "Ось тобі, сволото."

                    scene автомат_годіум
                    робі "Ай, боляче! Не можна бути такою злою, дівчино!"

                    павка "Поговори мені ще."

                    show робі нарік сумний at center with dissolve
                    робі "Та добре, добре! Йду. Бачиш — я пішов."

                    show інкі рішуча at right2 with dissolve
                    інкі "Не ображайтеся на мою подругу — в неї поганий ранок. За годину трансконектор працюватиме справно!"

                    show робі нарік роздратований at center with dissolve
                    робі "Поганий ранок, ага… Гадюка, така сама, як моя колишня…"

                    hide робі роздратований with dissolve
                    інкі "Ну от. Він пішов, і наче навіть не вибісив мене. Чого не скажеш про тебе…"

                    павка "Пізніше розповім. Якщо настрій буде."

                "Дати Робі годіум":
                    $відносини_інкі += 1
                    show павка нейтральна at left2 with dissolve
                    павка "Ось, тримай. За годину автомат буде в робочому стані."

                    show робі нарік задоволений at center with dissolve
                    робі "Молодець, жінко! Так тримати!"

                    hide робі злий with dissolve
                    інкі "Ну от. Він пішов, все обійшлося. Зробили добру справу — допомогли людині з ломкою."

    if відносини_інкі < 2:
        show інкі роздратована at right2 with dissolve
        інкі "Здихайся вже його. Я не можу в таких умовах працювати."

        show павка розгублена at left2 with dissolve
        "{i}Якби це було так просто! Що ж мені робити?"

        if годіум_інкі < 1:
            menu:
                "Дати Робі годіум Інкі":
                    play sound "audio/Сцена 5/ЗвукПляшкиЯкуХоваютьНазад.mp3"
                    $відносини_інкі -= 1
                    show павка рішуча at left2 with dissolve
                    павка "Ось, тримай. За годину автомат буде в робочому стані."

                    show робі нарік задоволений at center  with dissolve
                    робі "Молодець, жінко! Так тримати!"

                    hide робі задоволений with dissolve
                    show інкі роздратована at right2 with dissolve
                    інкі "Гей, ти що, віддала йому мою дозу? Геть здуріла??"

                    menu:
                        "Вибачитись":
                            $обіцянка_інкі = True
                            $відносини_інкі += 1
                            show павка розгублена at left2 with dissolve
                            павка "Вибач, на мене щось найшло. Треба було швидко реагувати, і я зробила те, що перше прийшло в голову."

                            show павка весела at left2 with dissolve
                            павка "Не гнівайся на мене, гаразд? Після роботи пригощу тебе подвійним 36-м, і знову засяєш як сонечко, е?"
                            $ renpy.notify('Gained achievement: "Подвійні стандарти"')

                            show інкі нейтральна at right2 with dissolve
                            інкі "Ну гаразд, тільки якщо подвійним. Ти сьогодні сама на себе не схожа."

                            show інкі весела at right2 with dissolve
                            інкі "Ну що ж, хоч зробили добру справу - допомогли людині з ломкою."

                        "Відрізати" :
                            show павка роздратована at left2 with dissolve
                            $відносини_інкі -= 1
                            павка "Заспокойся. Ти свою дозу сьогодні вже отримала. Не скупися на щастя для інших."

                            show інкі сумна at right2 with dissolve
                            інкі "Щось занадто багато охочих до мого щастя останнім часом."

                            інкі "Я такого від тебе не очікувала, кицюне."

                "Застосувати електрошокер":
                    scene автомат_годіум at shaking
                    show павка зла at left2 with dissolve
                    show робі нарік наляканий at center with dissolve
                    show інкі роздратована at right2 with dissolve
                    play sound "audio/Сцена 5/ЗвукЕлектрошокера.mp3"
                    павка "Ось тобі, сволото."

                    scene автомат_годіум
                    show робі нарік злий at center with dissolve
                    робі "Ай, боляче! Не можна бути такою злою, дівчино!"

                    павка "Поговори мені ще."

                    show робі нарік сумний at center with dissolve
                    робі "Та добре, добре! Йду. Бачиш — я пішов."

                    show інкі весела at right2 with dissolve
                    інкі "Не ображайтеся на мою подругу — в неї поганий ранок. За годину трансконектор працюватиме справно!"

                    show робі нарік роздратований at center with dissolve
                    робі "Поганий ранок, ага… Гадюка, така сама, як моя колишня…"

                    hide робі роздратований with dissolve
                    show інкі нейтральна at right2 with dissolve
                    інкі "Ну от. Він пішов, і наче навіть не вибісив мене. Чого не скажеш про тебе…"

                    show павка нейтральна at left2 with dissolve
                    павка "Пізніше розповім. Якщо настрій буде."

                    show інкі скептична at right2 with dissolve
                    інкі "Тримай це при собі, люба. Мені на сьогодні вистачає проблем."

        #if годіум_інкі <= 1:
            #show інкі рішуча at right2
            #show павка зла at left2
            #show робі нарік наляканий at center
#
            #play sound "audio/Сцена 5/ЗвукЕлектрошокера.mp3"
#
            #павка "Ось тобі, сволото"

            #робі "Ай, боляче! Не можна бути такою злою, дівчино!"

            #павка "Поговори мені ще"

            #show робі нарік сумний at center

            #show павка рішуча at left2
            #робі "Та добре, добре! Йду. Бачиш — я пішов"
            #show інкі весела at right2
            #інкі "Не ображайтеся на мою подругу — в неї поганий ранок. За годину трансонектор працюватиме справно!"

            #show робі нарік роздратований at center
            #робі "Поганий ранок, ага… Гадюка, така сама, як моя колишня…"
            #hide робі роздратований with dissolve

            #інкі "Ну от. Він пішов, і наче навіть не вибісив мене. Чого не скажеш про тебе…"

            #show павка нейтральна at left2
            #show інкі задумлива at right2
            #павка "Пізніше розповім. Якщо настрій буде"

            #show інкі скептична at right2
            #інкі "Тримай це при собі, люба. Мені на сьогодні вистачає проблем"


    show інкі рішуча at right2 with dissolve
    інкі "Зовсім трошки залишилося. Почекай, я зараз свою частину закінчу — і ти зможеш приступити до діагностики."

    show павка задумлива at left2 with dissolve
    "{i}Блін, він мене навіть не впізнав."

    show павка сумна at left2 with dissolve
    "{i}Оце йому годіум мізки виніс. Але ж ми розлучилися тільки півроку тому!"

    "{i}І він так змінився. Схуд, зблід… В рекламі кажуть, що годіум не має поганих наслідків..."

    scene фон
    stop music fadeout 2
    "..."

    jump scene_six
