label scene_thirteen :
    scene фон with dissolve
    play music "audio/Сцена 11/Тема Нижніх Катакомб Приглушена ІІ.mp3"

    "{i}Я спускаюсь гвинтовими сходами з боку від основного тунелю. Внизу панує абсолютна темрява, але з кожним кроком музика лунає все гучніше."

    "{i}Ця музика не схожа ні на створені комп'ютером треки трансконекторів, ні на мої несміливі витвори."

    "{i}Хтось торкається металевих ниток, що сяють в самому серці темряви."

    "{i}І серце темряви б’ється в дивному ритмі, наче воно складається з багатьох сердець."

    scene нижні_катакомби with dissolve
    stop music
    play music "audio/Сцена 11/Тема Нижніх Катакомб Чиста.mp3"

    "{i}В самій глибині підземних катакомб — простора кімната зі стінами з цегли. Тут розташувалась компанія людей."

    "{i}Вони й створюють музику. Але це ще не все. Люди співають. Без слів. І як співають!"

    "{i} Як же тепло від вигляду їх усміхнених обличч! Одна дівчина мені підморгує та вказує на вільне місце, де можна присісти."

    "{i} Чи бачила я хоч раз у житті такі привітні обличчя?"

    "{i} Дивно, але я розумію сенс цієї пісні, розумію його без слів."

    "{i}Про часи сивої давнини і про те, як з'явилося наше місто."

    "{i}Ця музика виринає ніби з мого серця."

    "{i}Бо співає завжди серце."

    "{i}Спіралі музики дзвенять, витягаючись невидимими нитками від одного музиканта до іншого, всім клітинам наших тіл переносить повідомлення."

    "{i}Інформація. Образи. Казка про давнину."

    "{i}Але я точно знаю, що все, про що йшлося в пісні — правда."

    "{i}Напівтемрява підземелля холодна і тривожна, але люди черпають цю темряву жменями, і темрява стає білою."

    "{i}У білому кольорі розгортаються аромати квітів і моря."

    "{i}Я знаю, що це — квіти, луки, море, хоча ніколи їх не бачила. Я дізнаюся про них з пам'яті самої музики."

    "{i}Музика пробуджує мене. Нову мене. Справжню."

    "{i}Я — Павка, я вільна людина."

    "{i}І я починаю співати. Разом із усіма."

    stop music
    play music "audio/Сцена 11/Тема Нижніх Катакомб Павка А Потім Всі Разом.mp3"

    "{i}Там, усередині пісні, — стогін вітру, що шукає порятунку серед диких скель."

    "{i}Крізь обрій нашої свідомості. Голосом інших світів. Музика зустрічає мене та приймає у свої обійми."

    "{i}Огортає мене подихом моря, лісу, гори, морозного та безкрайнього космосу."

    "{i}Я не знаю тих людей, але всередині цієї пісні стаю частиною їхньої спільноти."

    "{i}І стає дійсністю найзаповітніший сон серця Темряви."

    "{i}Всередині ритму сердець, у непроглядному світлі музики ми піднімаємось на саму вершину гори Сеамул і бачимо Катастрофу, яка зруйнувала Стародавній світ."

    "{i}Колись давно люди і птахи-велетні, що спустилися з неба, жили в мирі. Але один із птахів був надто великим, і його кроки викликали землетруси та розпліскували океани."

    "{i}Щоб не руйнувати все довкола, птах склав крила та завмер на багато століть. Він став схожий на гору. Гору назвали Сеамулом, а про те, що в її середині б'ється чиєсь живе серце, усі забули."

    "{i}Але самотність змусила його знов розкрити крила, і..."

    "{i}Сеамул прокляв колосів на вічну немотність, і вони застигли, вкрилися пилом, а потім їх замело землею всі вони стали горами."

    "{i}Люди спробували знищити Сеамула, але своєю зброєю обурили гарячу кров Землі, і вона пролилася і вкрила поверхню планети. Уламки птаха-велетня розлетілися по всій Землі, і всі люди загинули."

    "{i}Але одна велика група людей сховалася в середині гори з великим плато. Люди побудували захисний купол. Так закінчилася велика епоха."

    "{i}Масто назвали Куполом. Майже все, що залишилося від світу Стародавніх, вкрилося пилом та іржею, а потім згнило."

    "{i}Жителі Купола взяли від світу Стародавніх тільки технології та жадобу."

    "{i}Для того, щоб зберегти такий порядок речей, вони в Куполі винайшли дурманну речовину, що відбирає зв'язок розуму з реальністю. Люди самі себе засліпили."

    "{i}Роз'єднані люди позбавили себе пам'яті про Стародавніх, що знали справжнє та вміли створювати дива, яких полюбили космічні птахи-велетні."

    "{i}Найстрашніше — те, що жителі Купола позбавили себе вміння творити, довіривши створення жалюгідного сурогату мистецтва машинам."

    "{i}Хто не має музики — той не має зв'язку. Той не знає душі, не знає кохання, не може поєднати розрізнені клаптики знань воєдино і побудувати з каміння шлях."

    "{i}Світ жителів Купола розколовся на тисячі дрібних уламків, а їхня любов перетворилася на війну."

    scene фон

    "{i}Але зовні Купола сама Музика."

    "{i}на великий розлом над безоднею відчаю."

    "{i}натягла величну тетиву, з якої пускає стріли завтрашніх днів."

    "{i}де прийдуть нові люди, які повернуть зв'язок."

    "{i}світові, що розколовся на уламки."

    scene нижні_катакомби

    "{i}Кожним ударом серця, кожним вдихом та звуком музики ми плетемо душу пісні."

    "{i}Але ось спалахує і виструнчається останній звук, і перша пісня, яку я почула в моєму житті, закінчується."

    stop music
    play music "audio/Сцена 11/Ембіенс Нижніх Катакомб.mp3"

    show павка2 налякана at left2 with dissolve
    show генто нейтральний at right2 with dissolve
    генто "Павко! Ось де ти!"

    show павка2 здивована at left2 with dissolve
    павка "Що це було?"

    show генто невдоволений at right2 with dissolve
    генто "Ти не повинна була сюди приходити. Тобі не можна було це чути."

    show павка2 весела at left2 with dissolve
    павка "Але ж це музика! Справжня музика!"

    павка "Я так довго шукала її, мріяла піти за нею на край світу, а вона, виявляється, весь цей час була просто під моїми ногами!"

    show генто усміхнений at right2 with dissolve
    генто "Так, це музика. Ходім."

    "{i}Я з неохотою підвожусь і попрощаюсь з музикантами. Вони привітно мені кивають, і ми з Генто відходимо."

    генто "Тепер ти знаєш, як нам вдається тут виживати."

    генто "Серед нас є ті, хто зберігає крихти пам’яти про Стародавніх і про їх музику."

    show генто сумний at right2 with dissolve
    генто "Але це лише крихти. Вони допомагають нам триматися за життя, але цього недостатньо."

    show генто невдоволений at right2 with dissolve
    генто "Ми хочемо жити вільно і бачити небо. Не віддавати останні краплі свого життя на потребу купки еліт в Оазі."

    show генто сумний at right2 with dissolve
    павка "Чому ви тоді погоджуєтесь віддавати їм свою радість і задоволення? Чому просто не підете всі разом з-під Купола?"

    генто "Бо ми залежимо від Купола. Їжа, медикаменти, обладнання — вони дають нам лише жалюгідні залишки, але назовні немає і цього."

    генто "Десь далеко існують інші поселення, але дістатися їх важко, і не всі вони будуть раді непроханим гостям."

    генто "Тому більшість із нас залишається тут і погоджується на умови Оази."

    show павка2 налякана at left2 with dissolve
    павка "Це все так жахливо!"

    show генто посмішка at right2 with dissolve
    генто "Згоден. Але саме тому для нас важливі такі люди, як ти. Ті, хто наважується покинути Купол в пошуках чогось більшого."

    show павка2 нейтральна at left2 with dissolve
    генто "Можливо, колись ти повернешся і принесеш нам нові пісні, які розповідатимуть не тільки про минуле, але і про майбутнє..."

    show генто нейтральний at right2 with dissolve
    генто "Але все це — потім."

    show генто посмішка at right2 with dissolve
    генто "Давай нарешті виведемо тебе з цього клятого міста!"

    jump scene_final
