label scene_four:

    image машина_анімована = Movie(size=(2030, 1080), play="images/Scene 4/машина_анімована.ogv")

    scene машина
    play music  "audio/Сцена 4/ТемаПавкиТаІнкі.mp3" fadeout 1
    "{i}Інкі не помічає мого наближення, бо відвернулась до авто і приймає годіум."

    play sound  "audio/Сцена 4/ПрийомГодіуму.mp3" fadeout 1
    show інкі годіум at right2 with dissolve
    "{i}Ранок тільки настав. Цікаво, вкотре вона вже закидується?"

    menu:
        "Привітатися":
            show павка весела at left2 with dissolve
            павка "Слава засновникам Купола!"

            show інкі налякана at right2 with dissolve
            інкі "Слава! Слава! Слава!!!"

        "Запитати, чи не зарано для годіуму":
            $відносини_інкі +=1
            show павка рішуча at left2 with dissolve
            павка "Чи не зарано для годіуму?"

            show інкі збуджена at right2 with dissolve
            інкі "А? Що? Павко, це ти? Слава засновникам!"

    show інкі збуджена at right2 with dissolve
    show павка задумлива at left2 with dissolve
    "{i}Я все ще не придумала, що мені прославляти."

    menu:
        "Слава тверезості":
            show павка весела at left2 with dissolve
            павка "Слава тверезості!"

            show інкі скептична at right2 with dissolve
            інкі "Знайшла що прославляти. Від цього люди вмирають, між іншим."

        "Слава пилу під ногами":
            show павка весела at left2 with dissolve
            павка "Слава пилу під ногами!"

            show інкі скептична at right2 with dissolve
            інкі "Ти що завгодно готова прославляти, тільки б не тих, хто на це справді заслуговує? От дивачка!"

    show павка нейтральна at left2 with dissolve
    show інкі весела at right2 with dissolve
    інкі "Ти запізнилась. Я чекала на тебе і вирішила прийняти ще одну дозу. Як рекомендує доктор Хакім: дві вранці, дві ввечері."

    show інкі задумлива at right2 with dissolve
    інкі "Виглядаєш жахливо! Знову пропустила ранковий прийом?"

    show павка задумлива at left2 with dissolve
    "{i}Інкі знову лізе зі своїми порадами. Зараз буде лекцію про користь годіуму для здоров'я читити."

    "{i}Чи хочу я з нею дружити? Або ну її нафіг, таку подругу?"

    menu:
        "Відшити її":
            $відносини_інкі -=1
            show павка роздратована at left2 with dissolve
            павка "Ти, здається, щойно сказала, що ми запізнюємось на роботу. То може позбавиш мене чергових нотацій і ми сядемо вже нарешті в машину?"

            show інкі здивована at right2 with dissolve
            інкі "Гаразд, як скажеш. У когось сьогодні з ранку поганий настрій."

        "Послухати, що вона скаже":
            $відносини_інкі +=1
            show інкі роздратована at right2 with dissolve
            інкі "Павко, ну не дивись у простір ніби ти там щось своє думаєш. Поговори зі мною!"

            show інкі налякана at right2 with dissolve
            інкі "Я переживаю! Якщо ти справді припиниш приймати годіум, то одного разу ти просто не прийдеш на роботу."

            інкі "А потім я дізнаюся з новин, що чергова дурепа стрибнула з багатоповерхівки."

            show інкі сумна at right2 with dissolve
            інкі "І я буду до кінця своїх днів звинувачувати себе, що не нагадала тобі вчасно про таку просту річ, що без годіуму помирають."

            інкі "Що ми не живемо без годіуму ще з бородатих давен, коли вибухнув той клятий вулкан."

            show інкі нейтральна at right2 with dissolve
            інкі "Так ти приймаєш годіум, чи як?"

            menu:
                "Це тебе не обходить":
                    $відносини_інкі -=1
                    show павка роздратована at left2 with dissolve
                    павка "Це тебе не обходить."

                    show інкі нейтральна at right2 with dissolve
                    інкі "Маєш рацію, хай кожен сам вирішує свої проблеми."

                    інкі "Але навіщо навмисне ускладнювати собі життя, відмовляючись від годіуму? Тут я тебе не розумію."

                "Ні, ти ж знаєш":
                    $відносини_інкі +=1
                    show павка сумна at left2 with dissolve
                    павка "Ні, ти ж знаєш."

                    show інкі здивована at right2 with dissolve
                    інкі "От дивачка. Кайфуєш від депресії та безпросвітності?"

                    show інкі весела at right2 with dissolve
                    інкі "Годіум дозволяє побачити справжні кольори світу. Ти просто не знаєш, що втрачаєш."

            show інкі весела at right2 with dissolve
            інкі "Годіум об'єднує, ти ж знаєш, що це так."

    show інкі нейтральна at right2 with dissolve
    інкі "Час вирушати. Сьогодні важкий день, багато квитків на ремонт по всьому місту."

    menu:
        "Сісти в машину":
            play sound "audio/Сцена 4/СіданняВМашину.mp3"

            show інкі задумлива at right2 with dissolve
            stop sound fadeout 1
            інкі "Точно не хочеш трошки? В мене є додаткова доза. Ось побачиш, тобі полегшає."

    show павка рішуча at left2 with dissolve
    павка "..."

    show інкі здивована at right2 with dissolve
    інкі "Гаразд, гаразд, зрозуміла. Тільки не треба на мене так дивитись! Поїхали вже."

    show машина_анімована behind  павка with dissolve

    "{i}'Годіум об'єднує'. А як же. Все її життя — лише низка втеч від реальності і випадкових сексуальних зв'язків."

    show павка задумлива at left2 with dissolve
    павка "А нащо тобі запасна доза?"

    павка "Ти ж сказала, що вже прийняла другу вранішню за рекомендацією доктора Хакіма."

    павка "Чи то вже була не друга?"

    show інкі весела at right2 with dissolve
    інкі"Де друга, там і третя. Годіуму забагато не буває!"

    show павка здивована at left2 with dissolve
    павка "Ще й як буває!"

    show інкі роздратована at right2 with dissolve
    інкі "І взагалі, чого ти причепилась? Тільки давай ти не будеш знову штовхати мені свої божевільні ідеї про життя без годіуму."

    show павка задумлива at left2 with dissolve
    "{i}Ні, ну справді — не розповідати ж їй зараз про те, що пропонував мені Робі в день, коли ми розійшлися…"

    show інкі весела at right2 with dissolve
    інкі "Завдяки годіуму мені життя в кайф. Нащо відмовлятись від того, що дозволяє тобі забути про проблеми?"

    show павка нейтральна at left2 with dissolve
    павка "Інкі?"

    show інкі здивована at right2 with dissolve
    інкі "М-м-м?"

    show павка розгублена at left2 with dissolve
    павка "В тебе все гаразд?"

    show інкі сумна at right2 with dissolve
    інкі "…"

    show інкі рішуча at right2 with dissolve
    інкі "В мене все тіп-топ. Я найкраща, пам‘ятаєш?"

    show інкі збуджена at right2 with dissolve
    інкі "О, а ти бачила нову рекламу годіуму-45?"

    інкі "Треба буде в кінці робочого дня заїхати та зберегти її для моєї колекції."

    show павка рішуча at left2 with dissolve
    павка "Ти ніколи не думала, що ця синтетика нам насправді не потрібна?"

    show інкі скептична at right2 with dissolve
    інкі "Чому ти питаєш?"

    show павка сумна at left2 with dissolve
    павка "Знаєш, були часи, коли люди не жили на препаратах."

    show інкі задумлива at right2 with dissolve
    інкі "Я тобі більше скажу — я навіть намагалася кинути приймати годіум, як всі в підлітковому віці. І це ледь не закінчилося ДУЖЕ погано."

    show інкі рішуча at right2 with dissolve
    інкі "Так що моя тобі порада — змирися з досягненнями науки та забудь казочки про Стародавніх, які жили без годіуму."

    інкі "Прийми світ таким, який він є..."

    show інкі весела at right2 with dissolve
    інкі"Хто вживає годіум-56 — того депресія ніколи не з'їсть!"

    show павка нейтральна at left2 with dissolve
    "{i}Знов вона за старе."

    show інкі збуджена at right2 with dissolve
    інкі "Хто вживає годіум-57 — для того трансконектор рідний дім!"

    show павка рішуча at left2 with dissolve
    павка "Дякую за цитату."

    show інкі весела at right2 with dissolve
    інкі "На здоров'я!"

    show павка задумлива at left2 with dissolve
    павка "Ти ж знаєш, що всі ці слогани генерують алгоритми, налаштовані на довжину хвиль нашого мозку, щоб впасти в пам'ять якомога краще?"

    show інкі скептична at right2 with dissolve
    інкі "Ти так кажеш, наче в цьому є щось погане."

    show інкі весела at right2 with dissolve
    інкі "Вони налаштовані на те, щоб приносити задоволення."

    show інкі скептична at right2 with dissolve
    інкі "Ти ж не хочеш сказати, що ти проти задоволення, м-м-м?"

    menu:
        "Наркотики, Інкі, це не єдиний спосіб відчути задоволення":
            show павка нейтральна at left2 with dissolve
            павка "Наркотики, Інкі, це не єдиний спосіб відчути задоволення."

        "Не можна жити одним задоволенням":
            show павка нейтральна at left2 with dissolve
            павка "Не можна жити одним задоволенням."

            павка "І тікати весь час від проблем — теж не найкраща історія."

    show інкі розгублена at right2 with dissolve
    інкі "І яку альтернативу ти мені пропонуєш?"

    show павка сумна at left2 with dissolve
    павка "Знаєш, чому я кинула приймати годіум?"

    show інкі весела at right2 with dissolve
    інкі "Давно було цікаво. Розкрий-но мені свою таємницю, кицюню!"

    "{i}Вона з мене глузує. Але хто зна, може це мій останній шанс до неї достукатися."

    show павка замріяна at left2 with dissolve
    павка "Я відкрила для себе дещо нове. Музику. І вона замінила мені годіум."

    павка "Музика може допомогти і тобі. Ти можеш вживати менше."

    if відносини_інкі <= 1:
        show інкі роздратована at right2 with dissolve
        інкі "Хто, ну хто тобі сказав, що мені потрібна допомога? Тим паче, від тебе?"
    else:
        show інкі скептична at right2 with dissolve
        інкі "Павко, я тебе поважаю, і все таке, але ти явно заганяєшся."

    інкі '"Вживати менше" - це, бляха, неминуча смерть.'

    show інкі роздратована at right2 with dissolve
    інкі "Твоя музика - це якесь підозріле лайно, яке будь-якій здоровій людині варто обходити стороною."

    show інкі розгублена at right2 with dissolve
    інкі "Давай просто припинемо цю розмову, і не будемо більше ніколи повертатись до цієї теми, гаразд?"

    show павка задумлива at left2 with dissolve
    "{i}Це вже занадто, навіть для Інкі. В неї явно щось негаразд. Може, не варто її чипати? Хоча після таких закидонів мені важко буде дивитись їй у вічі."

    menu:
        "Посварити Інкі":
            $ лайка_інкі = True
            $відносини_інкі -=1
            show павка роздратована at left2 with dissolve
            павка "Музика — це не лайно, Інкі! Лайно — це те, як ти зі мною розмовляєш!"

            павка "Я тобі тут душу відкриваю, а ти мені так відповідаєш? І яка ти мені після цього подруга?!"

            show інкі здивована at right2 with dissolve
            інкі "Ну бля-яха му-уха. Що ж ти сьогодні така зла?"

            show павка рішуча at left2 with dissolve
            павка "На себе подивись. В тебе мізки годіумом так просякли, що уже не шариш, що людям говориш."

            show інкі розгублена at right2 with dissolve
            інкі "Ну добре, добре. Вибач! Давай тепер закінчимо цю розмову, просто закінчимо і забудемо, добре?"

        "Розповісти про свої почуття":
            $відносини_інкі +=1
            show павка сумна at left2 with dissolve
            павка "Інкі, навіщо ти таке кажеш? Ти ж навіть не знаєш, про що йде мова."

            павка "Музика змінила моє життя, і коли ти кажеш, що це лайно... мене це дуже ображає."

            show інкі розгублена at right2 with dissolve
            інкі "Блін, ну навіщо ти так все ускладнюєш? Я просто ляпнула що мені в голову прийшло, ти ж мене знаєш."

            інкі "Ну вибач, я не хотіла тебе образити. Давай більше не будемо повертатися до цієї теми, добре?"

        "Ігнорувати неадеквашку":
            show павка нейтральна at left2 with dissolve
            "{i}Пофіг. Треба тільки перетерпіти цей останній день, і все. Зараз не найкращій час на розбиратись в чужих проблемах."

    show інкі роздратована at right2 with dissolve
    інкі "Все це лайно змушує мене хвилюватися."

    show павка задумлива at left2 with dissolve
    "{i}Інкі тягнеться за новою дозою..."

    menu:
        "Зупинити Інкі":
            play sound "audio/Сцена 5/ЗвукПляшкиЯкуХоваютьНазад.mp3"
            show інкі роздратована at right2 with dissolve
            інкі "Відчепися від мене! Я тебе не вчу жити, і ти мене не вчи!"

            show павка здивована at left2 with dissolve
            павка "Інкі…"

            show інкі розгублена at right2 with dissolve
            інкі "Так, бляха-муха, в мене проблеми! Великі проблеми!"

            show інкі збуджена at right2 with dissolve
            інкі "І тому мені треба прийняти годіум сорок п'ятий — і знову засяяти!"

            menu:
                "Вагомий аргумент":
                    $ годіум_інкі = 1
                    show павка сумна at left2 with dissolve
                    павка "Гаразд, як забажаєш."

                    show інкі годіум at right2 with dissolve
                    play sound  "audio/Сцена 4/ПрийомГодіуму.mp3" fadeout 1
                    інкі "Гик! Наче знов розвидняється."

                "Стояти на своєму":
                    $ renpy.notify('Gained achievement: "Сухий закон"')
                    $відносини_інкі += 1
                    show павка рішуча at left2 with dissolve
                    павка "Інкі, будь ласка."

                    show інкі розгублена at right2 with dissolve
                    інкі "Ну гаразд, гаразд... Потерплю заради тебе. Потім вдома наздожену."

        "Нехай зловживає":
            $ годіум_інкі = 1
            show інкі годіум at right2 with dissolve
            play sound  "audio/Сцена 4/ПрийомГодіуму.mp3" fadeout 1
            інкі "Гик! Наче знов розвидняється."

    show інкі весела at right2 with dissolve
    інкі "До речі, ми підїжджаємо до першого трансконектору. Подивимося, що там у нас у квитку на ремонт…"

    show інкі задумлива at right2 with dissolve
    інкі '"Автомат не видає годіум". Як гадаєш, в чому з ним проблема?'

    show павка весела at left2 with dissolve
    павка "Я не гадаю, я знаю."

    павка "Хтось знов його хакнув і вкрав увесь годіум."

    show інкі здивована at right2 with dissolve
    інкі "Ого, ти що відкрила в собі телепатичні здібності? Це такий побічний ефект відмови від годіуму?"

    show павка нейтральна at left2  with dissolve
    павка "Звісно ні. Щоб здогадатися, що на периферії у 9 з 10 випадків нас викликають перезавантажити прогу після крадіжки — багато розуму не треба."

    show павка роздратована at left2 with dissolve
    павка "Ти могла б і сама здогадатись. Невже годіум настільки роз'їв тобі мозок?"

    show інкі розгублена at right2 with dissolve
    інкі "Та ні. То все вік."

    show павка рішуча at left2 with dissolve
    павка "Тобі 21, Інкі! Треба менше вживати!"

    if відносини_інкі >= 2:

        if лайка_інкі == True :
            show інкі роздратована at right2 with dissolve
            інкі "Будеш зі мною так говорити — я скажу слово на літеру Л."

            show павка задумлива at left2 with dissolve
            павка "Л… "

            menu:
                "Ліпосоми?":
                    павка "Ліпосоми?"

                "Лесбійка?":
                    павка "Лесбійка?"

                "Лазня?":
                    павка "Лазня?"

            $ renpy.notify('Gained achievement: "Слідкуй за мовою!"')
            show інкі весела at right2 with dissolve
            інкі "Лайно!!"

            show павка весела at left2 with dissolve
            павка "О ні, ти знов сказала це слово…"

            інкі "Так, сказала."

            інкі "І бачиш — тобі вже майже весело."

        if лайка_інкі == False :
            show інкі сумна at right2 with dissolve
            інкі "Кицюню, за що ти так на мене насіла сьогодні?"

            інкі "Ти не уявляєш собі, скільки лайна мені довелося вигребсти від своїх…"

            show інкі розгублена at right2 with dissolve
            інкі "Просто дай мені спокій і не лізь в душу, гаразд?"

            show павка здивована at left2 with dissolve
            "{i}Оу, схоже я справді зачепила її за живе."

            павка "Вибач, не буду."

            show павка нейтральна at left2 with dissolve
            павка "Але якщо захочеш поговорити — я завжди поруч."

            show інкі нейтральна at right2 with dissolve
            інкі "…"

    if відносини_інкі < 2:

        if годіум_інкі == 1:
            show інкі весела at right2 with dissolve
            інкі "Пфф, ватева."

            інкі "Зовсім вже з катушок злітаєш без регулярної дози."

        if годіум_інкі == 0:
            show інкі роздратована at right2 with dissolve
            інкі "Пішла ти..."

            show павка здивована at left2 with dissolve
            павка "…"

    scene машина
    stop music fadeout 3
    show павка нейтральна at left2 with dissolve
    show інкі нейтральна at right2 with dissolve
    інкі "Ми на місці."

    scene фон
    "..."
    jump scene_five
