label scene_two:

    play music "audio/Сцена 2/Будильник.mp3"

    scene кімната116_аберація at shaking

    "{i}Ой лишенько, знов цей сон…"
    menu:
        "Вимкнути будильник":
            play sound "audio/Сцена 2/Клавіша.mp3"
            stop music fadeout 1

    scene кімната116
    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1
    "{i}Мозок продовжує зображати те, чого я ніколи не бачила. Дивний в мене мозок."

    "{i}Дивний і протизаконний."

    show павкадім нейтральна at center with dissolve

    #play music ЄМБІЕНТ

    "{i}Але така вже я є."

    show павкадім замріяна at center with dissolve
    "{i}Як же добре було в тому сні!.."

    show павкадім сумна at center with dissolve
    "{i}Ті люди... Вони раділи просто так, без будь-якого годіуму!"

    scene кімната116_аберація
    show павкадім голова at center with dissolve
    play music "audio/Сцена 2/Дзвін1.mp3"
    "{i}А от тут не так добре."

    # ЗВУК ВМИКАННЯ КІМНАТИ
    play sound "audio/Сцена 2/Клавіша.mp3"
    show павкадім голова at left2 with dissolve
    кімната "Доброго ранку, пані Павко!"

    павка "Вітаю, 116-ий."

    кімната "Всі мої прилади справні, я готовий розпочати роботу."

    кімната "Не забудьте прийняти свою щоденну ранкову дозу годіуму-3015! Прийом годіуму-3015 з ранку — це гарантія продуктивного та щасливого дня!"

    кімната "Почуваєте себе розгубленою? Приймайте годіум! Годіум — ваш зв'язок зі світом!"

    кімната "Годіум об'єднує! Годіум — ваша персональна доза щастя!"

    menu:
        "Вимкнути рекламу":
            кімната "Вибачте, Павко. Щодня нагадувати вам про необхідність приймати годіум — мій обов'язок."

    "{i}Ух, бісова кімната!"

    "{i}Цей дзвін… Мозок знову клянчить дозу? Давно такого не було…"

    "{i}Гаразд, спробуємо дещо…"

    menu:
        "Дати ладу дзвону в голові":
            stop music fadeout 1
            show павкадім співає at left2 with dissolve
            play music "audio/Пісні Павка/ПісняА1.mp3" fadeout 1
            "..."

    scene кімната116
    stop music fadeout 2
    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1
    show павкадім задоволена at left2 with dissolve
    павка "Спрацювало."

    show павкадім нейтральна at left2 with dissolve
    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1
    кімната "Ви не вживали годіум вже 159 днів. Обережно! Таке довге утримання може нашкодити вашому здоров'ю! Бажаєте, щоб я зв'язався з лікарем?"

    show павкадім роздратована at left2 with dissolve
    павка "Дякую, 116-ий. Все гаразд. Лікарів не треба."

    menu:
        "Подивитися на годинник":
            show павкадім здивована at left2 with dissolve
            "{i}От халепа, до роботи залишилося лише 20 хвилин!"

    "{i}Час одягатись."

    hide павкадім здивована with dissolve
    show павка нейтральна at left2 with dissolve
    play sound "audio/Сцена 2/РозрядкаБатареї.mp3"
    кімната 'Нагадую, що заряд моєї батареї дорівнює 0,5%%. Необхідно перейти в режим глибокого сну для підзарядки.'

    show павка задумлива with dissolve
    "{i}У голові виринають картини вчорашньої ночі. Людина в плащі і капелюсі. Дивна розмова у дивному місці."

    "{i}Виконуючи її інструкції, вчора ввечері я відключила 116-того від живлення, а потім декілька разів наказувала йому готувати їжу і прибирати кімнату - щоб розрядити його батареї."

    show павка болить голова at left2 with dissolve
    "{i}Чому ж так боліла голова?"

    "{i}Вживати я почала ще підлітком, як і всі мої однолітки. І кинула лише кілька місяців тому."

    show павка задумлива at left2 with dissolve
    "{i}Ломки в мене вже давно не було. Але якщо подумати…"

    '{i}Може, мозок викидує коники тому, що до сьогодні в нього ще залишалась "надія"? Якщо в мозку може бути надія...'

    show павка рішуча at left2 with dissolve
    "{i}Але сьогодні особливий день. І те, що я збираюсь зробити, раз і назавжди поставить хрест на його сподіваннях."

    '{i}Вже ввечері я буду там, де немає жодного годіуму. Ось мозок і бунтує. З "переляку", що більше ніколи не отримає дозу. Якщо тільки може мозок налякатися.'

    show павка нейтральна at left2 with dissolve
    "{i}Організм людини  — це тобі не трансконектор! Не дві кнопочки натиснути."

    play sound "audio/Сцена 2/ЗупинкаПриладів.mp3" fadeout 1
    кімната "Низький заряд батареї! Переходжу в режим сну."

    show павка весела at left2 with dissolve
    stop sound
    "{i}Уф, спрацювало! Слава засновникам Купола!"

    show павка роздратована at left2 with dissolve
    "{i}Тьху ти! Знову ця безглузда фраза. Я ж збираюся втекти з цього міста і мені начхати на тих, хто його заснував."

    show павка рішуча at left2 with dissolve
    "{i}Вигадаю свою власну прославляючу фразу!"

    show павка задумлива at left2 with dissolve
    "{i}Так, кого б мені прославити..."

    menu:
        "Слава Невживанцям":
            show павка роздратована at left2 with dissolve
            "{i}Маячня твереза."

        "Слава Музиці":
            show павка роздратована at left2 with dissolve
            "{i}Маячня упорота." # (^-^)

    show павка весела at left2 with dissolve
    "{i}Щось я надто захопилася маячнею. Повернуся до цього пізніше <3"

    "{i}Час переглянути повідомлення від незнайомця."

    menu:
        "Придивитись до голографічної картки":
            scene кімната116_зум with dissolve
            hide павка роздратована at left2 with dissolve
            show павка нейтральна at left2 with dissolve
            "{i}Людина в капелюсі сказала, що ключ від моєї свободи — на цій картці."

    show павка налякана at left2 with dissolve
    "{i}А що як все, що каже Оаза — правда?"

    "{i}І за межами Куполу насправді немає жодної людини?"

    "{i}Або якщо вони в своєму меню віддають перевагу жителям Купола?"

    show павка рішуча at left2 with dissolve
    "{i}Павко, вище носа! Адже це все заради музики."

    "{i}Заради зустрічі з тими, хто здатний мене їй навчити!"

    menu:
        "Програти голографічне повідомлення":
            show ляйя голограма at right2 with dissolve
            show павка здивована at left2 with dissolve
            stop music fadeout 1
            play music "audio/Сцена 2/ТемаЛайі.mp3" fadeout 1
            лайя "Доброго ранку, Павка. Мене звуть Лайя, я твій куратор."

    show павка замріяна at left2 with dissolve
    "{i}Який приємний тихий голос..."

    show павка задумлива at left2 with dissolve
    '{i}Але що таке в біса "куратор"? Треба буде запитати.'

    show павка нейтральна at left2 with dissolve
    лайя "Якщо ти бачиш це повідомлення, значить ти одна з тих, кому обридла тиранія Оази і хто готовий боротися за свою свободу."

    лайя "Ми допоможемо тобі назавжди втекти з-під Купола."

    лайя "Але за це ти повинна будеш допомогти нам."

    лайя "Якщо ти згодна — чекаю на тебе сьогодні о 8:51 у трансконекторі на розі вулиць А та Б."

    лайя "Зайшовши до трансконектору, візьми в автоматі годіум та сядь на третю лавочку зліва."

    лайя 'Коли почуєш фразу "Залізяці корозія", відповіси: "Людям — кайф". В жодному разі не обертайся.'

    лайя "Пам'ятай: якщо ти прийдеш до мене — назад шляху не буде."

    лайя "Можливо, прослухавши це все, ти занепокоїлася."

    show павка налякана at left2 with dissolve
    "{i}Не те слово. Мені триндець як лячно!"

    show павка задумлива at left2 with dissolve
    лайя "Нікому не розповідай про це повідомлення. І не хвилюйся: складно не буде."

    лайя "Чому б ти не хотіла покинути Купол — твоя мрія заслуговує на те, щоб здійснитись."

    лайя "Це повідомлення автоматично самознищиться одразу після закінчення. Зустрінемося на іншому боці. Свободу від Купола!"

    hide ляйя голограма with dissolve
    scene кімната116 with dissolve
    show павка нейтральна at center with dissolve
    stop music fadeout 3
    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1
    "{i}От і все."

    "{i}Ось, значить, як стають підпільниками. Тобі просто пропонують угоду. Ти приходиш на зустріч. І все, ти державний зрадник."

    show павка задумлива at center with dissolve
    "{i}Ще є шанс все проігнорувати. Можу вдати, ніби не було сьогодні вранці жодної голограми в цій квартирі."

    "{i}Дані на картці вже видалено. Тепер це просто шматок пластику, який нічого нікому не доведе."

    menu:
        "Викинути карту в дезинтегратор":
            play sound "audio/Сцена 2/КришкаCмітника1.mp3"
            "{i}Тоді продовжу жити під Куполом. В Оазі. Працюватиму гвинтиком в системі і ненавидітиму своє життя."

    "{i}Далі слухатиму безглузді жарти Інкі. Щовечора потайки змиватиму годіум в унітаз."

    show павка сумна at center with dissolve
    "{i}Не буду наражати себе на небезпеку. Ніколи не почую справжню музику."

    "{i}Уявлятиму, наче щось знаю про світ з напівзабутих розповідей, які чула колись у дитинстві."

    "{i}А потім все одно почну приймати годіум, щоб викинути з голови свої нікчемні мрії."

    "{i}Але це не допоможе, і я буду страждати до кінця своїх днів..."

    show павка зла at center with dissolve
    "{i}Блін, ну кого я обдурюю?"

    show павка рішуча at center with dissolve
    "{i}Ну добре, добре! Угоді — бути."

    show павка нейтральна at left2 with dissolve
    павка "Прокинься, 116-ий."

    кімната "Вітаю, Павко! Заряд моєї батареї становить 34,41%%"

    павка "116-ий, відчини двері і закрий за мною."

    кімната "Так, Павко. Гарного вам дня!"

    кімната "Увага! Термінове повідомлення."

    show павка налякана at left2 with dissolve
    "{i}Дідько, що ще? Невже 116-ий якось підслухав повідомлення від Лайї?"

    кімната "Ви забули замовити вечерю."

    show павка весела at left2 with dissolve
    павка "Те ж саме, що й учора."

    кімната "Павко?"

    show павка нейтральна at left2 with dissolve
    павка "Що, 116-ий?"

    кімната "У вас все добре?"

    show павка усміхнена at left2 with dissolve
    павка "Так, 116-ий. Немає причин для хвилювання."

    кімната "Приготую на вечерю ваші улюблені синтетичні сендвичі. Гарного дня!"

    павка "І тобі, 116-ий."

    scene фон with dissolve
    play sound "audio/Сцена 5/ЗвукВідкриттяАвтоматуГарний.mp3"
    stop music fadeout 3
    scene фон
    "..."
    jump scene_three
