label scene_two:

    play music "audio/Сцена 2/Будильник.mp3"

    scene кімната116_аберація at shaking

    павка "...."
    павка "От лишенько, знов цей сон…"
    menu:
        "{i}Вимкнути сигнал":
            play sound "audio/Сцена 2/Клавіша.mp3"
            stop music fadeout 1

    scene кімната116

    павка "Мій мозок продовжує зображувати те, чого я ніколи не бачила. Ох мозку, мозку… Чого ти в мене такий дивний."
    павка "І антизаконний. Бо я не мала би такого собі дозволяти."

    show павкадім нейтральна at left2 with dissolve

    #play music ЄМБІЕНТ

    павка "Але я то є я."
    show павкадім замріяна at left2
    павка "Як же там добре."


    play music "audio/Сцена 2/Дзвін1.mp3"
    scene кімната116_аберація
    show павкадім голова at left2
    павка "А от тут не настільки добре."

    # ЗВУК ВМИКАННЯ КІМНАТИ
    кімната "Доброго ранку, пані Павко! "
    павка "Вітаю, 116."

    кімната "Всі мої прилади справні, я готова розпочати роботу. І не забудьте прийняти свою щоденну ранкову дозу годіуму3015!"
    кімната "Прийом годіуму3015 з ранку - це гарантія продуктивного та щасливого дня! Годіум - твій зв‘язок зі світом."
    кімната "Приймай годіум, залишайся на зв‘язку. Годіум — запорука сімейного щастя. "
    кімната "Годіум поєднує."

    menu:
        "Зупинити рекламу":
            кімната "Вибачте, Павко. Приносити вам нову рекламу годіуму — мій обов'язок."

    кімната "Я не винуватий, мене таким зробили!"

    павка "Цей дзвін… Мозок знову клянчить годіум? Давно такого не було."

    "{i}Напевно, це через вчорашнє. Гаразд, спробуємо дещо…"

    menu:
        "{i}Дати ладу дзвону в голові":
            stop music
            play music "audio/Пісні Павка/ПісняА1.mp3" fadeout 1

    scene кімната116 with dissolve

    show павкадім задоволена at left2 with dissolve
    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ
    павка "Спрацювало."
    stop music fadeout 3
    show павкадім нейтральна at left2

    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1

    кімната "Ви не вживали годіум вже 159 днів. Обережно! Таке довге утримання від годіуму може нашкодити вашому здоров'ю! Бажаєте, щоб я зв'язався з лікарем?"
    павка "Дякую, 116. Все в порядку. Лікарів не треба"

    menu:
        "{i}Подивитися на годинник":
            show павкадім здивована at left2
            павка "От халепо, до роботи залишилося лише 20 хвилин!"

    "{i}Час одягатись..."
    hide павкадім здивована with dissolve
    show павка нейтральна at left2 with dissolve

    павка "Довго ж ти мене будив, 116"

    show павка рішуча at left2

    кімната "Низький заряд, Павко."

    show павка здивована at left2

    "{i}М-м?"

    play music "audio/Сцена 2/РозрядкаБатареї.mp3"

    кімната "Хочу вам нагадати, що заряд моєї батареї менше 1 процента. Мені перейти в режим глибокого сну?"

    "{i}У голові виринають картини вчорашньої ночі. Людина в плащі і капелюсі. Дивна розмова у дивному місці."

    павка "Точно… Дякую, 116."
    кімната "Чекаю наказу відбій."

    stop music fadeout 2
    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1
    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ

    "{i}Виконуючи інструкції тієї людини, я віддала 116 наказ готувати мені їжу і прибиратися в квартирі знову і знову. Поки його батарея не розрядилася."
    "{i}Мій мозок не отримує годіум вже давно. І ломки в мене зазвичай немає. Але якщо подумати…"
    "{i}Перші місяці були нестерпні, але я навчилась приборкувати ломку. Дивно, що вона з'явилась знову зараз"
    "{i}І ломки в мене зазвичай немає. Але якщо подумати…"
    show павка сумна at left2
    "{i}Взагалі-то я вживала годіум з самого отроцтва. І кинула вживати лише кілька місяців тому."
    show павка задумлива at left2
    "{i}Може, мозок викидує мені коники якраз тому, що до сьогодні мого мозку була 'надія' "
    show павка рішуча at left2
    "{i}Але сьогодні особливий день. І те, що я збираюсь зробити, раз і назавжди скаже цим поривам Стоп."
    "{i}Вже ввечері я буду там, де ніякого годіуму немає. Ось він і бунтує. З переляку."
    show павка нейтральна at left2
    "{i}Так, людський мозок — це тобі не трансконектор… Не дві кнопочки натиснути."
    "..."
    scene кімната116_аберація with dissolve
    play sound "audio/Сцена 2/Дзвін2.mp3"

    menu:
        "{i}Вимкнути дзвін":
            павка "Заспокойся, голове"
            stop sound fadeout 1

    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ
    scene кімната116

    show павка весела at left2
    павка "Уф, спрацювало! Слава творцям-засновникам."
    show павка роздратована at left2
    павка "Тьху ти! Знову ця безглузда фраза. Я ж збираюся зрадити це місто разом з тими, хто його заснував."
    show павка рішуча at left2
    павка "Придумаю іншу фразу, що одухотворює."
    show павка задумлива at left2
    павка "Так, кого б прославити..."
    show павка роздратована at left2
    menu:
        "Слава Невживанцям":
            павка "Маячня якась."
        "Слава музиці":
            павка "Маячня якась." # (^-^)

    павка "Щось я надто захопилася. Повернуся до цього пізніше."
    scene кімната116_зум with dissolve

    play music "audio/Сцена 2/ТемаЛайі.mp3"
    menu:
        "Подивитись на картку":
            павка "Та людина в капелюсі сказала мені, що ключ від моєї свободи - на цій картці."

    павка "Але перш, ніж я подивлюсь голографічне повідомлення…"
    павка "116, засни"
    play sound "audio/Сцена 2/ЗупинкаПриладів.mp3"
    кімната "Засинаю"
    павка "Ну ось я і залишилася одна в цій квартирі."
    stop sound fadeout 2

    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ

    show павка налякана at left2 with dissolve
    "{i}Що якщо все, що каже Оаза — правда?"
    "{i}І там насправді немає жодної людини?"
    "{i}Або якщо вони в своєму меню віддають перевагу жителям Купола? М-м?"
    show павка рішуча at left2
    "{i}Гаразд, Павко. Вище ніс! Адже це все заради музики."
    "{i}Заради зустрічі з тими, хто здатний мене їй навчити!"

    show павка здивована

    play music "audio/Сцена 2/ТемаЛайі.mp3"
    menu:
        "{i}Програти голографічне повідомлення":
            show ляйя голограма at right2 with dissolve
            лайя "Доброго ранку, Павка. Мене звуть Лайя. "

    лайя "Я твій куратор"

    show павка замріяна at left2
    "{i}Який приємний тихий голос..."

    show павка задумлива at left2
    "{i}А що таке куратор? Треба буде запитати."

    show павка нейтральна at left2
    лайя "Якщо ти бачиш це повідомлення, значить ти одна з тих, кому обридла тиранія Оази і хто готовий встати до боротьби за свою свободу."
    лайя "Ми допоможемо тобі назавжди втекти з-під Куполу. "
    лайя "Але за це ти повинна будеш допомогти нам."
    лайя "Якщо ти згодна — чекаю на тебе сьогодні о 8:51 у трансконекторі на розі вулиць А та Б."
    лайя "Якщо ти прийдеш до мене — назад шляху не буде."
    лайя "Можливо, прослухавши це все, ти почала переживати."

    "{i}Не те слово. Мені триндець як лячно!"

    лайя "Ні в якому разі нікому не розповідай про це повідомлення"
    лайя "Навіщо б ти не йшла за межі Купола — твоя мрія заслуговує на те, щоб стати реальністю."
    лайя "Це повідомлення автоматично самознищиться одразу після закінчення. Свобода від Куполу! Зустрінемося на іншому боці."

    hide ляйя голограма with dissolve
    show павка нейтральна at center
    "{i}От і все."
    "{i}Значить, так стають підпільниками. Тобі просто пропонують угоду. Ти приходиш на зустріч. І все, ти державний зрадник."

    демон "Ще є шанс все проігнорувати. Можу вдати, наче й не було сьогодні вранці жодної голограми в цій квартирі."
    демон "Цей шматок непридатного пластику нічого нікому не доведе. Дані на ньому вже видалено."

    play sound "audio/Сцена 2/КришкаCмітника2.mp3"
    menu:
        "{i}Викинути карту в дезінтегратор":
            play sound "audio/Сцена 2/КришкаCмітника1.mp3"
            "{i}Тоді продовжу жити в під Куполом. В Оазі. Працюватиму гвинтиком в системі і ненавидітиму своє життя."



    "{i}Далі слухатиму безглузді її жарти. Далі тайком змиватиму годіум в унітаз"
    "{i}Коротше кажучи, залишуся у світі, який добре знаю."

    демон "Блін, ти серйозно?"
    демон "Ну залишайся. І ти ніколи не почуєш музику, якою вона була до вибуху Сеамула."
    демон "Уявлятимеш, що щось знаєш про світ. За напівзабутими розповідями, які чула колись у дитинстві. А потім почнеш приймати годіум, щоб забути загнившу мрію."

    павка "Ну добре, добре! — угоді бути."

    scene кімната116 with dissolve
    show павка нейтральна at left2 with dissolve

    павка "Прокинься, 116."

    кімната "Вітаю, пані Павко."

    #павка "116, видай мені чистий комплект робочого одягу."

    #кімната "Так, пані Павко."

    павка "116, відчини двері і закрий за мною."

    кімната "Так, пані Павко. Гарного вам дня! "

    кімната "Пані Павко! Ви забули замовити вечерю."

    павка "Те ж саме, що й учора."

    кімната "Пані Павко?"

    павка "Що, 116?"

    кімната "У вас все добре?"

    кімната "Га? Так, 116. Нема причин хвилюватися."

    кімната "Приготую на вечерю ваші улюблені синтетичні сендвичі. Гарного дня!"

    павка "І тобі, 116."

    "{i}Прощавай, 116. Ти був мені другом. Настільки, наскільки міг."
    scene фон with dissolve

    play sound "audio/Сцена 2/КришкаCмітника2.mp3"
    stop music fadeout 3
    scene фон
    "..."
    jump scene_three
