label scene_two:

    play music "audio/Сцена 2/Будильник.mp3"

    scene кімната116_аберація at shaking

    павка "...."
    павка "Ой лишенько, знов цей сон…"
    menu:
        "{i}Вимкнути сигнал":
            play sound "audio/Сцена 2/Клавіша.mp3"
            stop music fadeout 1

    scene кімната116
    play music "audio/Сцена 2/КвартираПавки.mp3"
    павка "Мозок продовжує зображувати те, чого я ніколи не бачила. Дивний в мене мозок"
    павка "Дивний і протизаконний"

    show павкадім нейтральна at left2 with dissolve

    #play music ЄМБІЕНТ

    павка "Але я то є я"
    show павкадім замріяна at left2
    павка "Як же добре було в тому сні!.."


    play music "audio/Сцена 2/Дзвін1.mp3"
    scene кімната116_аберація
    show павкадім голова at left2
    павка "А от тут не настільки добре"

    # ЗВУК ВМИКАННЯ КІМНАТИ
    кімната "Доброго ранку, пані Павко! "
    павка "Вітаю, 116-ий"

    кімната "Всі мої прилади справні, я готовий розпочати роботу. І не забудьте прийняти свою щоденну ранкову дозу годіуму-3015!"
    кімната "Прийом годіуму-3015 з ранку — це гарантія продуктивного та щасливого дня! Годіум - твій зв‘язок зі світом."
    кімната "Приймай годіум, залишайся на зв‘язку! Годіум — твій зв'язок з усім світом!"
    кімната "Годіум об'єднує! Годіум — це щастя!"

    menu:
        "Вимкнути рекламу":
            кімната "Вибачте, Павко. Приносити вам нову рекламу годіуму — мій обов'язок"

    "{i}Ух, бісова кімната!"

    кімната "Я не винен, мене таким зробили!"

    павка "Цей дзвін… Мозок знову клянчить годіум? Давно такого не було…"

    "{i}Напевно, це через учорашнє. Гаразд, спробуємо дещо…"

    menu:
        "{i}Дати ладу дзвону в голові":
            stop music
            play music "audio/Пісні Павка/ПісняА1.mp3" fadeout 1

    scene кімната116 with dissolve

    show павкадім задоволена at left2 with dissolve
    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ
    павка "Спрацювало."
    stop music fadeout 3
    show павкадім нейтральна at left2

    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1

    кімната "Ви не вживали годіум вже 159 днів. Обережно! Таке довге утримання від годіуму може нашкодити вашому здоров'ю! Бажаєте, щоб я зв'язався з лікарем?"
    павка "Дякую, 116-ий. Все гаразд. Лікарів не треба"

    menu:
        "{i}Подивитися на годинник":
            show павкадім здивована at left2
            павка "От халепа, до роботи залишилося лише 20 хвилин!"

    "{i}Час одягатись..."
    hide павкадім здивована with dissolve
    show павка нейтральна at left2 with dissolve

    play music "audio/Сцена 2/РозрядкаБатареї.mp3"

    кімната' Хочу вам нагадати, що заряд моєї батареї дорівнює 0,5%%. Можу перейти в режим глибокого сну?'
    stop music fadeout 2
    "{i}У голові виринають картини вчорашньої ночі. Людина в плащі і капелюсі. Дивна розмова у дивному місці"
    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1
    павка "Точно… Дякую, 116-ий"
    кімната "Чекаю наказу, відбій"



    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ

    "{i}Виконуючи інструкції тієї людини, вчора ввечері я віддала 116-му наказ готувати мені їжу і прибиратися в квартирі знову і знову. Поки його батарея не розрядилася"
    "{i}Чому ж так болить голова?"
    "{i}Взагалі-то я вживала годіум з самого отроцтва. І кинула вживати лише кілька місяців тому"
    "{i}І ломки в мене зазвичай немає. Але якщо подумати…"
    show павка задумлива at left2
    '{i}Може, мозок викидує мені коники якраз тому, що до сьогодні в нього була "надія"? Якщо в мозку може бути "надія"...'
    show павка рішуча at left2
    "{i}Але сьогодні особливий день. І те, що я збираюсь зробити, раз і назавжди скаже моїй залежності “стоп”"
    '{i}Вже ввечері я буду там, не буде ані єдиного шансу отримати годіум. Ось мозок і бунтує. З "переляку". Якщо тільки може мозок налякатися'
    show павка нейтральна at left2
    "{i}Організм людини  — це тобі не трансконектор — не дві кнопочки натиснути"
    "..."
    scene кімната116_аберація with dissolve
    play sound "audio/Сцена 2/Дзвін2.mp3"

    menu:
        "{i}Вимкнути дзвін":
            павка "Заспокойся, голове"
            stop sound fadeout 1

    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ
    scene кімната116

    show павка весела at left2
    павка "Уф, спрацювало! Слава засновникам Куполу!"
    show павка роздратована at left2
    павка "Тьху ти! Знову ця безглузда фраза. Я ж збираюся втекти з цього міста і мені нібито начхати на тих, хто його заснував"
    show павка рішуча at left2
    павка "Вигадаю свою власну прославляючу фразу!"
    show павка задумлива at left2
    павка "Так, кого б мені прославити..."
    show павка роздратована at left2
    menu:
        "Слава Невживанцям":
            павка "Маячня твереза"
        "Слава Музиці":
            павка "Маячня упорота" # (^-^)

    павка "Щось я надто захопилася маячнею. Повернуся до цього пізніше<3"
    scene кімната116_зум with dissolve

    play music "audio/Сцена 2/ТемаЛайі.mp3"
    menu:
        "Придивитись до голографічної картки":
            павка "Та людина в капелюсі сказала мені, що ключ від моєї свободи — на цій картці."

    павка "Але перш ніж я подивлюсь голографічне повідомлення…"
    павка "116-ий, засни"
    play sound "audio/Сцена 2/ЗупинкаПриладів.mp3"
    кімната "Добраніч, Павко!"
    павка "Ну ось я і залишилася в цій квартирі наодинці з собою"
    stop sound fadeout 2

    # ДОДАТИ ЄМБІЕНТ КВАРТИРИ

    show павка налякана at left2 with dissolve
    "{i}А що як все, що каже Оаза — правда?"
    "{i}І там насправді немає жодної людини?"
    "{i}Або як вони в своєму меню віддають перевагу жителям Купола? М-м?"
    show павка рішуча at left2
    "{i}Гаразд, Павко. Вище носа! Адже це все заради музики."
    "{i}Заради зустрічі з тими, хто здатний мене їй навчити!"

    show павка здивована


    menu:
        "{i}Програти голографічне повідомлення":
            play music "audio/Сцена 2/ТемаЛайі.mp3"
            show ляйя голограма at right2 with dissolve
            лайя "Доброго ранку, Павка. Мене звуть Лайя. "

    лайя "Я твій куратор"

    show павка замріяна at left2
    "{i}Який приємний тихий голос..."

    show павка задумлива at left2
    '{i}Але що в біса таке "куратор"? Треба буде запитати'

    show павка нейтральна at left2
    лайя "Якщо ти бачиш це повідомлення, це означає, що ти одна з тих, кому обридла тиранія Оази і хто готовий стати до боротьби за свою свободу."
    лайя "Ми допоможемо тобі назавжди втекти з-під Куполу. "
    лайя "Але за це ти повинна будеш допомогти нам."
    лайя 'Якщо ти згодна — чекаю на тебе сьогодні о 8:51 у трансконекторі на розі вулиць А та Б. Зайди до трансконектору, візьми годіум та сядь на третю лавочку зліва.'
    лайя 'Як почуєш фразу "Залізяці корозія", відповіси: "Людям — кайф". В жодному разі не обертайся.'
    лайя "Якщо ти прийдеш до мене — назад шляху не буде."
    лайя "Можливо, прослухавши це все, ти занепокоїлася."

    "{i}Не те слово. Мені триндець як лячно!"

    лайя "Є просте правило безпеки: нікому не розповідай про це повідомлення. І не переживай: складно не буде."
    лайя "З яких би причин ти не йшла за межі Купола — твоя мрія заслуговує на те, щоб стати реальністю."
    лайя "Це повідомлення автоматично самознищиться одразу після закінчення. Зустрінемося на іншому боці. Свободу від Куполу!"

    hide ляйя голограма with dissolve
    show павка нейтральна at center
    stop music fadeout 3
    "{i}От і все."
    "{i}Ось, значить, як стають підпільниками. Тобі просто пропонують угоду. Ти приходиш на зустріч. І все, ти державний зрадник"

    "{i}Ще є шанс все проігнорувати. Можу вдати, наче й не було сьогодні вранці жодної голограми в цій квартирі"
    "{i}Дані на голографічній картці вже видалено. Цей шматок непридатного пластику нічого нікому не доведе"

    #play sound "audio/Сцена 2/КришкаCмітника2.mp3"
    menu:
        "{i}Викинути карту в дезинтегратор":
            play sound "audio/Сцена 2/КришкаCмітника1.mp3"
            "{i}Тоді продовжу жити під Куполом. В Оазі. Працюватиму гвинтиком в системі і ненавидітиму своє життя"
    play music "audio/Сцена 2/КвартираПавки.mp3" fadeout 1


    "{i}Далі слухатиму безглузді жарти Інкі. Надалі потайки змиватиму годіум в унітаз"
    "{i}Коротко кажучи, буду жити так само, як зараз…"

    "{i}Блін, ну кого я обдурюю?"
    "{i}Ну, залишуся я. Не буду наражати себе на небезпеку. І що? Ніколи не почую справжню музику. Буду сидіти тут при своєму…"
    "{i}Уявлятиму, наче щось знаю про світ за напівзабутими розповідями, які чула колись у дитинстві та за рекламою годіуму від 116-го"
    "{i}А потім все одно почну приймати годіум, щоб викинути з голови свою загнившу мрію"
    "{i}Але нічого мені не вдасться і я буду страждати до кінця своїх днів"
    павка "Ну добре, добре! Угоді — бути."

    scene кімната116 with dissolve
    show павка нейтральна at left2 with dissolve

    павка "Прокинься, 116-ий"

    кімната "Вітаю, Павко"

    #павка "116-ий, видай мені чистий комплект робочого одягу"

    #кімната "Так, пані Павко"

    павка "116-ий, відчини двері і закрий за мною"

    кімната "Так, Павко. Гарного вам дня!"

    кімната "Павко! Термінове сповіщення"

    "{i}Від цього незапланованого меседжу в мене мороз по шкірі. Невже 116-ий якось дізнався про..."

    кімната "Ви забули замовити вечерю"

    павка "Те ж саме, що й учора"

    кімната "Пані Павко?"

    павка "Що, 116-ий?"

    кімната "У вас все добре?"

    кімната "Га? Так, 116-ий. Немає причин для хвилювання"

    кімната "Приготую на вечерю ваші улюблені синтетичні сендвичі. Гарного дня!"

    павка "І тобі, 116-ий"

    "{i}Прощавай, 116-ий. Ти був мені другом. Настільки, наскільки міг"
    scene фон with dissolve

    play sound "audio/Сцена 2/КришкаCмітника2.mp3"
    stop music fadeout 3
    scene фон
    "..."
    jump scene_three
