
label scene_seven:
    scene фон
    "..."
    "......"
    scene автомат_годіум2 with dissolve
    play music  "audio/Сцена 4/МістоАмбієнт2.mp3" fadeout 5

    show павка нейтральна at left2 with dissolve
    show інкі нейтральна at right2 with dissolve

    інкі "Фу-у-у-ух, я втомилась"

    show інкі задумлива at right2
    інкі "Ти собі не уявляєш, як"

    show павка задумлива at left2
    show інкі нейтральна at right2
    павка "Ну звісно уявляю, ми ж були увесь цей час разом"

    show павка усміхнена at left2
    павка "Але нам пощастило: цей автомат не зламався — за нами тільки рутинний огляд"

    show інкі весела at right2
    show павка нейтральна at left2
    павка "Перевіримо цей трансконектор — і можна двігать"

    if обіцянка_інкі == True:
        show інкі збуджена at right2
        show павка здивована at left2
        інкі "Ти ж пам'ятаєш, що ти мені подвійну порцію годіум-36 обіцяла?"

        show інкі весела at right2
        show павка нейтральна at left2
        павка "Ага"

    show інкі рішуча at right2
    show павка нейтральна at left2
    "{i}Мені теж треба залізти у той автомат. Це моя єдина можливість звідси вибратися"

    show павка рішуча at left2
    show інкі нейтральна at right2
    інкі "Ну що ж, почнемо"

    show павка нейтральна at left2
    play sound "audio/Сцена 5/ЗвукВідкриттяАвтоматуГарний.mp3"

    павка "Інкі, а можна в тебе спитати щось особисте?"

    show інкі скептична at right2
    інкі "Що саме? А-а-а, пофіг. Валяй"

    menu:
        "А твоя сім'я?":
            show інкі нейтральна at right2
            show павка рішуча at left2
            павка "Розкажеш про них?"

            show павка нейтральна at left2
            show інкі здивована at right2
            інкі "А що з ними? Сім'я як сім'я."

            show інкі сумна at right2
            інкі "Так, мені важко з ними, і я через те змушена закидуватися годіумом більше за нормальні дози. Але то таке."

            інкі "Мабуть, я не хочу зараз про них говорити."
            $ renpy.notify('Gained achievement: "Серйозна розмова"')

        "Я тобі подобаюсь?":
            show інкі здивована at right2
            show павка нейтральна at left2
            інкі "З чого такі питаннячка раптом?"

            show павка усміхнена at left2
            show інкі нейтральна at right2
            павка "Так, цікаво"

            show павка нейтральна at left2
            show інкі весела at right2
            інкі "Я тобі так скажу"

            show павка здивована at left2
            show інкі збуджена at right2
            інкі "Таких неордінарних поглядів на життя, як у тебе, я ще не зустрічала. Але годі про це"

    menu:
        "А твоя колекція реклами?":
            show павка здивована at left2
            show інкі нейтральна at right2
            павка "Що вона для тебе?"

            if відносини_інкі < 3:
                show інкі задумлива at right2
                show павка нейтральна at left2
                інкі "Та, це трохи дивна звичка"

                show інкі весела at right2
                інкі "Я ніби хочу зібрати у себе весь найкращий контент"

                show інкі збуджена at right2
                інкі "Вони красиві. А мене штирить від краси"

                show інкі нейтральна at right2
                інкі "Я вічна гонщиця в погоні за насолодою"

            if відносини_інкі >= 3:
                show інкі задумлива at right2
                show павка нейтральна at left2
                інкі "Ті кольорові анімовані зображення і слогани… Я тобі скажу, тільки обіцяй, що не будеш сміятися"

                show інкі нейтральна at right2
                павка "Обіцяю"

                show інкі задумлива at right2
                інкі "Іноді мені починає здаватися, що вони мають на мене дуже сильний вплив"

                show інкі сумна at right2
                інкі "Майже як сам годіум"

                show павка здивована at left2
                show інкі нейтральна at right2
                павка "Чому?"

                show павка нейтральна at left2
                show інкі весела at right2
                інкі "Просто тому, що вони красиві. Ти знаєш про мою колекцію. Так от, в мене вдома ними вся спальня заліплена"

                show інкі весела at right2
                show павка усміхнена at left2
                інкі "І ось я лежу вечорами в ліжечку, споглядаю їх, і мені здається, що я сама щаслива людина в світі. Бо мене оточують такі дивні створені комп'ютером штуки"

                show павка нейтральна at left2
                show інкі нейтральна at right2
                інкі "Вони наповнюють мене відчуттям, що я не просто в лежу в одній з квартирі в одному з будинків, а знаходжуся в середині спільного серцебиття"

                show павка весела at left2
                show інкі весела at right2
                інкі "Одне серце на всіх, одне бажання, одна пристрасть"

                show павка нейтральна at left2
                show інкі нейтральна at right2
                інкі "Але то таке. Незважай"

                show інкі весела at right2
                show павка нейтральна at left2
                інкі "Коротше кажучи, вони мені в кайф"

    menu:
        "Як годіум?":
            show інкі весела at right2
            show павка нейтральна at left2
            інкі "Точно! Екстравагантна реклама — це годіум для моїх очей"

            інкі "Суміш світлових хвилей різної частоти, ідеально збалансована за допомогою компьютерних алгоритмів для отримання мною максимального задоволення"

            show павка весела at left2
            show інкі нейтральна at right2
            павка "Звучить так, наче ти сама просто машина"

            show павка нейтральна at left2
            show інкі весела at right2
            інкі "Так! Я машина для праці і задоволення!"

        "Як мистецтво?":
            show павка нейтральна at left2
            show інкі розгублена at right2
            інкі "М? Це щось на старій мові, я не розумію"

    show інкі задумлива at right2
    show павка задумлива at left2
    павка "Я чула, що колись люди самі створювали такі речі. Малювали, робили музику. Це називалось “мистецтво”"

    show павка нейтральна at left2
    show інкі скептична at right2
    інкі "А, чула про таке. В них наче були якісь витвори, які вони витворяли. Тепер все це робить комп'ютер. Можна не паритися і просто споживати"

    if відносини_інкі >= 3:
        show інкі задумлива at right2
        show павка нейтральна at left2
        інкі "А що ти думаєш про мистецтво?"

        show павка усміхнена at left2
        show інкі скептична at right2
        павка "Насправді завдяки йому мені вдається не приймати годіум і не їхати з глузду"

        show павка нейтральна at left2
        show інкі нейтральна at right2
        павка "Мистецтво допомагає мені не стати однією з самогубців, про яких ти читаєш у ранкових новинах"

    show павка сумна at left2
    show інкі нейтральна at right2
    павка "Якось була дуже погана ситуація, і я у відчаї створила пісню. Музика врятувала близьку мені людину. З того часу я не вживаю годіум"

    show павка нейтральна at left2
    show інкі здивована at right2
    інкі "Чому ти просто не пішла до Залу Насолоди і не повтичила в Лампу Радості?"

    show павка задумлива at left2
    show інкі скептична at right2
    павка "Ти не розумієш, це інше"

    show павка замріяна at left2
    show інкі нейтральна at right2
    павка "Інколи мені вдається скласти кілька звуків в єдине ціле, щоб висловити свої почуття. Тоді мене охоплює така велика радість, що всякий там годіум і поруч з нею не валявся"

    play sound "audio/Пісні Павка/Мугикання.mp3"

    show інкі налякана at right2
    show павка нейтральна at left2
    інкі "..."
    інкі "....."
    інкі "Стоп. Замовкни. Ти що робиш?!"

    show інкі нейтральна at right2
    show павка налякана at left2
    павка "Все, все, мовчу. Я не хочу нам неприємностей"
    stop sound fadeout 4
    show павка задумлива at left2

    "{i}Я справді не хотіла. Мабуть, мене захопила моя власна розповідь"

    show павка нейтральна at left2
    show інкі розгублена at right2
    інкі "Тоді чому ти це робиш? Це ж заборонено!"

    show павка сумна at left2
    show інкі нейтральна at right2
    павка "Вибач"

    if відносини_інкі >= 3:
        show інкі рішуча at right2
        show павка весела at left2
        інкі "Але звучить цікаво. Росповіси про це? Ввечері..."

    if відносини_інкі < 3:
        show інкі роздратована at right2
        show павка нейтральна at left2
        інкі "І взагалі, будеш про таке патякати — я викличу Перевіряючих, зрозуміло? Я не хочу проблем"

    play sound "audio/Сцена 5/ЗвукВідкриттяАвтомату.mp3"

    show павка усміхнена at left2
    show інкі рішуча at right2
    інкі "Так, я закінчила! Тут твоєї роботи всього на п’ять хвилин"

    if обіцянка_інкі == True:
        show інкі збуджена at right2
        show павка здивована at left2
        інкі "Де там моя обіцяна подвійна порція годіуму36?!"

    if обіцянка_інкі == False:
        show інкі збуджена at right2
        show павка здивована at left2
        інкі "Нарешті, можна залити спогади про цей тупий день черговою порцією божественного 36-го"
        if відносини_інкі >= 2:
            show інкі весела at right2
            show павка нейтральна at left2
            інкі "Ти зі мною?"

    show інкі скептична at right2
    show павка нейтральна at left2
    "{i}Треба залізти в цей клятий автомат і зробити свою справу. Але як не спалитися перед Інкі?"
    stop music fadeout 2
    play music "audio/Сцена 7/ТемаПередВтечею.mp3"
    menu:
        "Посіяти сумнів в її компетенції":
            $ відносини_інкі = відносини_інкі - 1
            show інкі скептична at right2
            show павка рішуча at left2
            павка "Краще я все ще раз перевірю, бо хто зна, що ти впустила через твої годіумні зашквари."

            show павка налякана at left2
            show інкі роздратована at right2
            інкі "Нащо ти таке кажеш, я у своїй справі краща, в мене жодної помилки не було — і ти про це знаєш!"

            show павка нейтральна at left2
            show інкі скептична at right2
            інкі "Це взагалі-то ти в нас фрік, а не я! Але роби як хочеш — ти не знайдеш там ані єдиної помилки"

        "Подивитись деталь в автоматі":
            show інкі нейтральна at right2
            show павка рішуча at left2
            павка "Хочу нагадати собі, як виглядає одна деталь. Просто для самоосвіти…"

            show павка нейтральна at left2
            show інкі здивована at right2
            інкі "Е-е-е… А це обов’язково робити саме зараз? Дивна ти…"

        "Бути відвертою":
            $ відносини_інкі = відносини_інкі + 1
            show інкі нейтральна at right2
            show павка рішуча at left2
            павка "Слухай, Інкі, мені треба зробити дещо важливе. Не можу сказати що, але від цього залежить моя подальша доля. Це не займе більше 5 хвилин"

    if відносини_інкі >= 3:
        show інкі розгублена at right2
        show павка нейтральна at left2
        інкі "В мене погані передчуття, але гаразд, роби що треба"

        show павка здивована at left2
        show інкі весела at right2
        інкі "Але май на увазі, що я розраховую на повний звіт під дозою годіуму сьогодні ввечері. Ти пригощаєш!"


    if відносини_інкі == 2:
        show інкі скептична at right2
        show павка нейтральна at left2
        інкі "Щоб ти не надумала, роби це швидко"

        show павка налякана at left2
        show інкі сумна at right2
        інкі "І я не хочу нічого про це знати, зрозуміло?"

    if відносини_інкі < 2:
        show інкі скептична at right2
        show павка нейтральна at left2
        інкі "Ти сьогодні себе весь день дивно поводиш, я так і знала, що ти щось задумала"

        show павка налякана at left2
        show інкі роздратована at right2
        інкі "Мабуть без годіуму зовсім дах їде, вирішила загарбати собі зайву пляшечку за рахунок компанії, е?"

        show павка сумна at left2
        інкі "До автомати ти підійдеш через мій труп, зрозуміла?"

        menu:
            "Застосувати електрошокер":
                $шок_інкі = True
                $відносини_інкі = 0
                show павка сумна at left2
                show інкі нейтральна at right2
                павка "Вибач, Інкі"

                show павка нейтральна at left2
                show інкі налякана at right2
                інкі "ГЕЙ, ти що зовсім здуріла???!"

                play sound "audio/Сцена 7/Електрошокер.mp3"
                hide інкі налякана with dissolve

                show павка здивована at left2
                "Чого не зробиш заради свободи"

                show павка рішуча at left2
                "В мене є десять хвилин доки вона не оговталась і мене не помітили"

            "Спробувати вмовити":
                show павка рішуча at left2
                show інкі розгублена at right2
                павка "Інкі, ти не розумієш. Це щось дуже важливе для мене. Пусти мене, будь ласка!"

                show павка нейтральна at left2
                show інкі роздратована at right2
                інкі "Я не для того стільки років працювала як робот і вибивалась в люди, щоб все це було зруйновано в один день якоюсь божевільною невживанкою! А ну геть від автомату!"

                show павка сумна at left2
                show інкі рішуча at right2
                інкі "Я викликаю Перевіряючих!"

                show павка задумлива at left2
                show інкі нейтральна at right2
                "Вона тягнеться за рацією. Треба діяти швидко, інакше про свободу можна забути"

                menu:
                    "Застосувати електрошокер":
                        $шок_інкі = True
                        $відносини_інкі = 0

                        show інкі розгублена at right2
                        show павка сумна at left2
                        павка "Вибач, Інкі."

                        show павка рішуча at left2
                        show інкі налякана at right2
                        інкі "ГЕЙ, ти що зовсім здуріла???!"

                        show павка нейтральна at left2

                        play sound "audio/Сцена 7/Електрошокер.mp3"
                        hide інкі налякана with dissolve

                        "Чого не зробиш заради свободи"

                        show павка рішуча at left2
                        "В мене є десять хвилин доки вона не оговталась і мене не помітили"

                    "Остання спроба порозумітись!":
                        $ відносини_інкі = відносини_інкі + 1
                        show павка рішуча at left2
                        show інкі скептична at right2
                        павка "Інкі, життя поза межами Купола існує! Життя без годіуму і без Оази. Без необхідності витрачати себе на безглузду роботу, перемежовану відчайдушним наркотичним забуттям"

                        show павка рішуча at left2
                        show інкі здивована at right2
                        павка "Я хочу спробувати побачити цей світ. Чи померти, намагаючись це зробити. Бо жити так, як зараз я більше не можу"

                        show павка сумна at left2
                        show інкі сумна at right2
                        павка "Розмієш?"

                        if відносини_інкі >= 2:
                            show інкі сумна at right2
                            show павка нейтральна at left2
                            інкі "Павко, це піздець. Ти серйозно в це віриш?"

                            show павка сумна at left2
                            show інкі скептична at right2
                            павка "Так. Це мій єдиний шанс на порятунок. Я по твоїм очам бачу, що ти мене розумієш"

                            show павка нейтральна at left2
                            show інкі роздратована at right2
                            інкі "Бля! Лайно! Блядське лайно!"

                            show павка здивована at left2
                            show інкі розгублена at right2
                            інкі "Гаразд, але щоб ти не задумала, роби це швидко"

                            show павка нейтральна at left2
                            show інкі скептична at right2
                            інкі "І я не хочу нічого про це знати, зрозуміло?"

                        if відносини_інкі < 2:
                            show інкі скептична at right2
                            show павка здивована at left2
                            інкі "Непогана спроба, кицюне"

                            інкі "Але мене цими казками не обдуриш"

                            show павка налякана at left2
                            show інкі рішуча at right2
                            інкі "Прийом, Перевіряючі. Це технічний юніт 45-6. В мене критична ситуація, спроба пограбування трансконнектору №18б. Терміново виїжджайте!"

                            show павка сумна at left2
                            show інкі рішуча at right2
                            scene gameover with dissolve
                            hide інкі рішуча with dissolve
                            hide павка сумна with dissolve
                            "{i}Ну от і все. На цьому моя історія закінчується"

                            jump scene_seven

    scene фон with dissolve
    "..."
    "....."
    "*Минуло 5 хвилин*"
    scene автомат_годіум2 with dissolve
    if шок_інкі == False:
        show інкі нейтральна at right2
    show павка весела at left2
    "..."
    павка "Ну от і все! Наш робочий день закінчено!"

    if шок_інкі == False:

        if відносини_інкі >= 3 and годіум_інкі == True:

            show інкі задумлива at right2
            show павка нейтральна at left2
            інкі "Слухай, Павко, я здогадалася, що ти не плануєш мене пригощати годіумом-36 — це не в твоєму стилі. Але перш ніж ми розійдемося, я б хотіла тобі дещо розказати"

            show павка здивована at left2
            show інкі розгублена at right2
            інкі "Ти питала про мою сім'ю. Так от. Моя мама дуже хотіла, щоб я добре вчилася, і я це зробила, а потім я дослужилася до того, щоб мене перевели сюди, в Оазу"

            show павка нейтральна at left2
            show інкі нейтральна at right2
            інкі "І мама змінилася. Може то пов'язано зі скороченням поставки годіуму в наш сектор. Або з чимось іншим. Не знаю точно"

            show павка здивована at left2
            show інкі задумлива at right2
            інкі "Але останнім часом вона вимагає від мене додаткових доз годіума. Спершу я їй їх привозила, але згодом вона почала вимагати ще більше, і ще, і ще. Вона каже мені, що я маю то робити, бо я її донька"

            show павка сумна at left2
            інкі "Це просто зводить мене зглузду. І я боюся залишатися насамоті з собою, бо мені страшно поринати в ці думки. Це моя мама, і вона поводиться жахливо. Більше за все я боюся її істерик…"

            show павка розгублена at left2
            show інкі розгублена at right2
            інкі "Або можливо того, що одного дня прочитаю про її самогубство в новинах"

            show павка сумна at left2
            show інкі сумна at right2
            інкі "Ти не могла б провести зі мною вечір? Хоч трохи, хоч пару годин…"
            show інкі налякана at right2
        if відносини_інкі >= 3 and годіум_інкі == True:
            show інкі задумлива at right2
            show павка нейтральна at left2
            інкі "Подруго! Я хочу тобі дещо розповісти"

            show інкі сумна at right2
            show павка здивована at left2
            інкі "Сльози стоять в мене в очах, мені дуже важко з цим жити!"

            show інкі нейтральна at right2
            павка "Що таке, Інкі? В тебе все ж таки щось сталося?"

            show павка розгублена at left2
            show інкі розгублена at right2
            інкі "Моя мама вимагає від мене годіум. Вона поводиться жалюгідно, і виводить мене з себе"

            show павка сумна at left2
            інкі "Я не розумію, чому вона так змінилася. Можна я просто поплачу на твоєму плечі?"

            show павка розгублена at left2
            show інкі сумна at right2
            павка "Та плач…"

            show павка нейтральна at left2
            інкі "Плачу-у-у-у-у!...."

            show інкі збуджена at right2
            інкі "Ну все, ходім за годіум-36!"
            show інкі налякана at right2
        if відносини_інкі < 3 and годіум_інкі == True:
            show інкі рішуча at right2
            show павка нейтральна at left2
            інкі "Ти просто крейзі вумен! Я тут намагаюся з тобою подружитися, а ти хуйнею маєшся"

            show павка розгублена at left2
            show інкі скептична at right2
            інкі "Дівка чудить без дози"

            show павка нейтральна at left2
            show інкі рішуча at right2
            інкі "В тебе зовсім мізки без речовин перегоріли?"

            show павка здивована at left2
            show інкі здивована at right2
            інкі "Гей народе, моя напарниця щось витворяє з автоматами — мабуть в неї дах з'їхав!"
            show інкі налякана at right2
        if відносини_інкі < 3 and годіум_інкі == False:
            show інкі скептична at right2
            show павка нейтральна at left2
            інкі "Павко, я не знаю, що ти задумала, і нащо копирсалася в автоматах, але все це супер підозріло"

            show павка здивована at left2
            show інкі роздратована at right2
            інкі "Нічого особистого, але я доповім про це керівництву!"
            show інкі налякана at right2
            #*автомат, біля якого знаходяться дівчата, починає бібікати, бузікати, загоряється екран, на екрані логотип Антареса, голос говорить*


    play music "audio/Сцена 2/ТемаЛайі.mp3"

    scene автомат_годіум тривога with dissolve
    if шок_інкі == False:
        show інкі здивована at right2
    show павка здивована at left2
    голос "Громадяни Купола! З вами говорить підпільна організація Антарес"

    if шок_інкі == False:
        show інкі розгублена at right2
    show павка задумлива at left2
    "{i}Чорт, це зовсім не схоже на простий збір інформації…"

    show павка налякана at left2
    голос "Купка еліт в Оазісі наживається на стражданнях та злиднях мільйонів жителів периферії"

    show павка задумлива at left2
    if шок_інкі == False:
        show інкі налякана at right2
    голос "Вони використовують годіум, щоб промивати вам мізки та приховувати від вас правду"

    show павка налякана at left2
    голос "За межами Купола є життя, ви можете бути вільними від їх тиранії"

    show павка зла at left2
    голос "Але щоб це зрозуміти, вам спочатку треба протверезіти"

    show павка рішуча at left2
    if шок_інкі == False:
        show інкі нейтральна at right2
    голос "З цієї миті подача годіуму зупиняється у всіх автоматах. Це початок кінця"

    голос "Геть тиранію Оази!"

    show павка здивована at left2
    "{i}Що? Що це в біса означає?!"

    "{i}Мене підставили!"
    menu:
        "Треба бігти":
            show павка налякана at left2

        "Довбаний Лайя!":
            show павка зла at left2
    stop music fadeout 3

    play music "audio/Сцена 7/Тривога.mp3" fadeout 1
    "..."

    if шок_інкі == False:
        show інкі налякана at right2
    show павка налякана at left2

    гучномовець "УВАГА. УВАГА. ВЧИНЕНО ДИВЕРСІЮ. ВИКОРИСТАННЯ АЕРОТРАНСПОРТУ ЗАБОРОНЕНО"

    гучномовець "РОЗХОДЬТЕСЯ ПО СВОЇХ ДОМІВКАХ І ЧЕКАЙТЕ НА ПЕРЕВІРЯЮЧИХ. ЗАБОРОНЕНО ЗАЛИШАТИ ОАЗУ, ДОКИ ДИВЕРСАНТА НЕ БУДЕ ЗНАЙДЕНО"

    show павка задумлива at left2
    if шок_інкі == False:
        show інкі нейтральна at right2
    "{i}Запізно"

    if шок_інкі == False:
        show інкі розгублена at right2
        show павка нейтральна at left2
        інкі "Це якась нісенітниця. Цього не може бути!"

        інкі "Я сплю і це мій страшний сон, навіянний тією дивачкою. Я зараз прокинуся і все буде добре"

        show павка задумлива at left2
        show інкі нейтральна at right2
        "Що ж мені робити?"

        show павка нейтральна at left2
        інкі "Це ти зробила. І це ніякий не сон…"

        if відносини_інкі < 3 and годіум_інкі == False:
            show інкі роздратована at right2
            show павка нейтральна at left2
            інкі "Ах ти тварюка, я так і знала, що ти хотіла нас усіх залишити без годіуму!"

            show інкі скептична at right2
            show павка розгублена at left2
            інкі "Я викликаю Перевіряючих"
            hide інкі скептична with dissolve
            $ renpy.notify('Gained achievement: "Нічого особистого"')
        if відносини_інкі < 3 and годіум_інкі == True:
            show інкі розгублена at right2
            show павка нейтральна at left2
            інкі "Чорт, я не знаю, що за хуйня зараз твориться, і не хочу мати з цим нічого спільного"

            show павка здивована at left2
            show інкі скептична at right2
            інкі "Я просто сумлінно виконувала свою роботу, а тут ця невживанка влаштувала діверсію"

            show інкі сумна at right2
            show павка нейтральна at left2
            інкі "Просто посиджу тут, поки Перевіряючі не приїдуть… Вони все зрозуміють, я ж нічого поганого не робила!"
            hide інкі сумна with dissolve

        if відносини_інкі >= 3 and годіум_інкі == True:
            show інкі роздратована at right2
            show павка розгублена at left2
            інкі "Що за лайно! Я вже не витримую…! Спочатку мама, тепер це!"

            інкі "Нехай все воно горить вогнем! Як же я ненавиджу цей світ!"

            show павка нейтральна at left2
            show інкі рішуча at right2
            інкі "Я допоможу тобі, Павко! Я не здам тебе!!"

            інкі "Біжи, я тебе прикрию"

            show павка розгублена at left2
            інкі "Я Антарєс, Я Антарєс, візьміть мене!!"

            show павка здивована at left2
            павка "Ееее… як скажеш, подруго"

            hide інкі рішуча with dissolve

        if відносини_інкі >= 3 and годіум_інкі == False:
            show інкі сумна at right2
            show павка нейтральна at left2
            інкі "Чорт, я не знаю, що за хуйня зараз твориться, але я на твоєму боці, Павко"

            show інкі розгублена at right2
            show павка усміхнена at left2
            інкі "Напевно, ти маєш свої причини на те, щоб робити те, що ти робиш"

            show павка нейтральна at left2
            інкі "Я знаю, що таке важке життя, знаю, що таке, коли ти маєш проблеми. Ні в чому тебе не звинувачую"

            show інкі весела at right2
            інкі "Я тебе не здам. Біжи, я тебе прикрию"

            show павка усміхнена at left2
            павка "Дякую, Інкі! Я це не забуду"
            hide інкі весела with dissolve

    show павка рішуча at center with dissolve
    "{i}Час тікати"

    scene фон
    "..."
    jump scene_eight
