label scene_final:
    scene фон with dissolve
    play music "audio/Сцена 14/Кроки В Тунелі.mp3"

    "{i}Чим далі ми йдемо від кімнати з музиками, тим темніше катакомби"

    "{i}І тим більш сирим стає повітря. Я доторкаюся до стіни, слизької та бугристої"

    генто "Краще не треба. Багато що бігає по цих стінах"

    "{i}І що ж там може бігати?"

    павка "Ти бачиш у пітьмі?"

    генто "Зовсім трохи. Це в певному сенсі профдеформація"

    "{i}Коли стає зовсім темно, я уповільнююся, витягую вперед руку і інстинктивно замружую очі"

    "{i}Мозок боїться, що попереду може бути перешкода"

    генто "Не бійся, тут тільки ми з тобою"

    "{i}Я намагаюся не боятися, але виходить в мене не одразу"

    "{i}Лише за кілька кроків мені вдається йти з нормальною швидкістю і не мружитися"

    генто "Обережніше. тут сходини"

    "{i}Ми піднімаємося довго, періодично зупиняючись, щоб перевести подих"

    "{i}Коли сходини закінчуються, ми йдемо вузьким коридором вперед і вгору"

    "{i}Я думаю про все, що сталося"

    "{i}Про своє життя, що було зіткане з брехні"

    "{i}Про своїх батьків, яким я більше нічим не допоможу"

    "{i}Я увесь час розвалювалася на частини, і мене пічкали годіумом, приховуючи мої закривавлені рани"

    "{i}Годіум — це зв'язок"

    "{i}Якби ж то!"

    "{i}Химерний клей, зроблений наполовину з брехні, наполовину з інших людей"

    "{i}Мене спустошували. Використовували. З мене зробили людожерку"

    "{i}Але тепер все скінчилося"

    "{i}Тобто, зовсім все"

    "{i}Раніше я була — Павка. Механікиня, що працює з трансконекторами"

    "{i}А хто я тепер? Що на мене чекає?"

    if відносини_лайя >=3 and відносини_інкі >=3 :

        "{i}Я залишаю місто, яке зробило мене такою, яка я є"

        "{i}Але яким би не був Купол, він дав мені веселі будні з Інкі та обіцянку дружби з Лайєю"

        "{i}Тож може, це місто не таке вже й пропаще?"

        "{i}Наші веселі будні з Інкі"

        "{i}Наші розмови з Лайєю, що змусили мене замислитися"

        "{i}Мої друзі. Я збережу спогади про вас у своєму серці"

        "{i}І може, ми ще зустрінемося колись у майбутньому"

    elif відносини_лайя <3 and відносини_інкі >=3 :

        "{i}Я залишаю місто, яке зробило мене мною"

        "{i}Яким би Купол не був, тут я зустріла Інкі"

        "{i}Подруго! Наші з тобою будні були найкращіми"

        "{i}Я збережу спогади про тебе в своєму серці"

        "{i}Сподіваюся, ми ще зустрінемося колись у майбутньому"

    elif відносини_лайя >=3 and відносини_інкі <3 :

        "{i}Я залишаю місто, яке зробило мене мною"

        "{i}Яким би Купол не був, тут я зустріла Лайю"

        "{i}Наші розмови змусили мене замислитися"

        "{i}І я думаю, ця зустріч ще вплине на моє майбутнє"

        "{i}Можливо, колись ми зустрінемося знову"

        "{i}Я збережу спогади про тебе в своєму серці"

    elif відносини_лайя <3 and відносини_інкі <3 :

        "{i}Я залишала місто, яке зробило мене мною"

        "{i}Воно забрало геть усі мої сили і знищило мою віру в людей"

        "{i}Купол породив жорстокість і зраду"

        "{i}І що б не чекало на мене попереду — назад мені дороги не має"

        "{i}І з чим я йду?"

        "{i}Мені залишилась хіба лише надія"

    "{i}Це те добро, що в мене є"

    "{i}Ми виходимо в коридор, в кінці якого на нас чекає тускле світло. Я починаю бачити"

    show павка2 нейтральна at left2 with dissolve
    show генто нейтральний at right2 with dissolve
    генто "Ми приготували для тебе дещо, що зробить твоє життя назовні трохи легшим"

    генто "Спорядження і трохи їжі на перший час"

    show павка2 усміхнена at left2
    павка "Дякую"

    генто "Ну от і все. Тепер ти вільна. Залишу тебе тут. А ти виходь, як відчуєш, що вже готова"

    show генто посмішка at right2
    генто "Щасти тобі, Павко!"

    stop music
    play music "audio/Сцена 11/Ембіенс Нижніх Катакомб.mp3"

    show павка2 задумлива at left2
    "{i}І тут я дещо пригадую"

    show павка2 весела at left2
    "{i}Нарешті я розумію, що мені треба прославляти"

    menu:
        "Єднання людей заради справедливості":

            павка "Свободу від Куполу!"

            генто "Тоді знай, що ми з Лайєю чекатимемо на тебе, Павко. Але будь твоя воля!"

            "{i}Так щиро, як Генто, мені ще ніхто не посміхався"

            генто "Свободу від Куполу!"

            павка "І свободу від хибних зв'язків!"

        "Єдність із самою собою":

            павка "Бажаю тобі знайти серед усього цього самого себе"

            павка "Дійти до справжнього себе і більше себе нікуди своє не відпускати"

            генто "А мені не треба. Я зроблений зі свого світу. Залишалося тільки обрати ставлення — і я його обрав"

            menu:
                "Хіба ставлення не є зв'язок?":

                    генто "Саме так, Павко. Лайя казав мені, що ти дуже розумна"

                    генто "Що б там не казали, а коли в люде й є спільні погляди — це мене тішить. Свободу від Куполу!"

        "Нічого":

            "{i}В мене не залишилося нічого"

            "{i}Ні-чо-го"

            "{i}Я спалила всі мости"

            "{i}І йду у новий світ з пустими руками"

            menu:
                "І це страшно":

                    "{i}Це лякає мене. Але врешті решт, щоб дати місце новому, треба викинути старе"

                "І це захоплююче":

                    "{i}Хіба є щось краще за пустоти, які маєш заповнити самим собою?"

    "{i}Інколи не вдається встановити зв'язок з людьми, можливо зараз, можливо, ця проблема має глибші корені"

    "{i}Але завжди має бути щось, за що треба триматись, за це можна ризикнути життям"

    hide генто посмішка at right2
    "{i}Генто йде, остання людина з міста Купол, з якою мені довелося говорити"

    stop music

    "{i}Ще якийсь час я мовчу, усвідомлюючи, що от-от я нарешті..."

    menu:
        "Дізнаюся, що ж там, поза Куполом":
            "..."
        "Розірву усі зв'язки з цим жахливим містом":
            "..."
        "Вийду у світ, де є музика":
            "..."

    "{i}Тоді налягаю на двері, і вони важко, повільно відкриваються"

    hide павка2 весела at left2
    scene назовні_куполу
    play music "audio/Сцена 14/Тема Виходу Назовні Основна.mp3"

    "{i}Запахи стають сильніше. Знайомі запахи, яких я ніколи не чула"

    "{i}Це запах вітру з мого сну"

    "{i}Запах квітів, землі і чогось свіжого"

    "{i}Все це знаходиться десь далеко — а під ногами в мене лише каміння. Але все це торкається мого обличчя. Справжній вітер!"

    "{i}І коли очі звикають до світла, я починаю бачити кольори"

    "{i}Неймовірно чиста блакить. Руда земля, що піднімається до самого неба"

    "{i}Це як у моєму сні, тільки краще"

    show павка2 весела at left2
    павка "Ну що ж, вітаю тебе, світ!"
    "ТИТРИ"
    return
