# Гра починається тут.

label start:
    $ right2 = Position(xalign=0.8, yalign=1.1)
    $ left2 = Position(xalign=0.2, yalign=1.1)
    scene сон with dissolve

    #$ renpy.notify('Gained achievement: "О дивний новий світ..."')


    play music "audio/Сцена 1/Ємбіент.mp3"
    play sound "audio/Сцена 1/Листя.mp3"

    "{i}Тут так світло і спокійно, що хочеться співати"



    "{i}Навколо так багато зеленого кольору"
    "{i}Прохолодний, прозорий подих вітру — і ось зелені ромби на шкірястих, шорстких стовпах тремтять"
    "{i}Жовті кола біля ніг нахилилися під силою повітря"
    "{i}Щось мені підказує, що все довкола — живе. Хоч то й не люди"
    "{i}Витягуються, повзуть вгору тонкі нитки живої зелені"
    "{i}Як все це дивно. Здається, ще трохи — і я почую кришталевий передзвін їхніх голосів."
    play sound "audio/Сцена 1/СміхДіти.mp3"
    голос1 "Павка! Давай з нами!"

    "{i}Я не впізнаю голос, але знаю, що то кличе мене друг"

    павка "Я зараз, тільки…"

    "{i}Вітерець торкається щік і запускає у волосся свої незримі прохолодні нитки. Так приємно…"
    "{i}Все навколо ніжиться у вітрі"

    play sound "audio/Сцена 1/Сміх1.mp3"

    голос2 "Павко, хутчіш сюди! Бо почнемо без тебе!"

    play music "audio/Сцена 1/ТемаСну.mp3" fadeout 3

    "{i}Цей чудовий чарівний звук"

    menu:
        "Прислухатись":
            "{i}Дівчата і хлопці в кольоровому просторому одязі сидять на лавці і співають"
            play sound "audio/Сцена 1/Флейта.mp3"

    "..."
    "{i}Схоже, ці приємні звуки створює он той хлопець"
    "{i}Музика народжується в нього під пальцями, коли він прикладає їх до отворів на довгастому предметі"

    голос1 "{i}{b}Над синім морем"
    голос1 "{i}{b}Моря зелені"

    голос2 "Приєднуйся, Павко! Чи ти забула пісню, яку сама написала?"

    голос1 "{i}{b}А там понад світом — стоока безодня"

    "{i}Ой, що це там, вдалині? Витягуються з землі до самого неба, такі високі… Звідкись приходить слово "гори""

    scene гори with dissolve

    голос1 "{i}{b}Світи нескінченні"
    голос1 "{i}{b}Моря прозорі"

    "{i}А над горами — безкрайній синьо-рожевий простір"

    "{i}Вдома – на волі. Так і має бути."

    scene фон with dissolve

    stop music fadeout 2

    павка "..."
    stop sound fadeout 3
    jump scene_two
