# Гра починається тут.

label start:
    $ right2 = Position(xalign=0.8, yalign=1.1)
    $ left2 = Position(xalign=0.2, yalign=1.1)
    scene сон with dissolve

    play music "audio/Сцена 1/Ємбіент.mp3"
    play sound "audio/Сцена 1/Листя.mp3"

    "{i}Неймовірно світло, і від цього світла хочеться співати."
    $ renpy.notify("Інкі не забуде цього...")

    "{i}Навколо так багато зеленого кольору."
    "{i}Прохолодний, прозорий подих вітру — і ось зелені ромби на шкірястих, шорстких стовпах тремтять."
    "{i}Жовті кола біля ніг нахилилися під силою повітря."
    "{i}Щось мені підказує, що все довкола — живе. Хоч то й не люди."
    "{i}Плавні, повзучі, витягуються вгору тонкі нитки живої зелені."
    "{i}Як все це дивно. Здається, ще трохи — і я почую кришталевий передзвін їхніх голосів."
    play sound "audio/Сцена 1/СміхДіти.mp3"
    голос1 "Павка! Давай з нами!"

    "{i}Я не впізнаю голос, але знаю, що то кличе мене друг."

    павка "Я зараз, тільки…"

    "{i}Вітерець торкається щік і запускає у волосся свої незримі прохолодні нитки. Так приємно…"
    "{i}Все навколо ніжиться у вітрі."

    play sound "audio/Сцена 1/Сміх1.mp3"

    голос2 "Павко, хутчіш сюди! Бо почнемо без тебе!"

    play music "audio/Сцена 1/ТемаСну.mp3" fadeout 3

    "{i}Цей чудовий чарівний..."

    menu:
        "Прислухатись":
            "{i}Дівчата і хлопці в гарному кольоровому одязі сидять на лавці і співають."
            play sound "audio/Сцена 1/Флейта.mp3"

    "..."
    "{i}Схоже, ці чарівні звуки створює он той хлопець із дивною геометричною штукою"
    "{i}Він витягує ці звуки з неї і кидає їх у вітер."

    голос1 "{i}{b}Над синім морем"
    голос1 "{i}{b}Моря зелені"

    голос2 "Приєднуйся, Павко! Чи ти забула пісню, яку сама написала?"

    голос1 "{i}{b}А там над ним — стоока безодня"

    голос1 "Ой, що це там, вдалині? Витягуються до неба із землі, високі…"

    scene гори with dissolve

    "{i}Серед моря всіх відтінків зеленого."

    голос1 "{i}{b}Світи нескінченні"
    голос1 "{i}{b}Моря прозорі"

    "{i}А над ними — безкрайній синьо-рожевий простір. Це вдома?"

    голос1 "{i}{b}Почуємо завтра — а кличуть сьогодні"

    "{i}Дома – на волі. Так і має бути."

    scene фон with dissolve

    stop music fadeout 2

    павка "..."
    stop sound fadeout 3
    jump scene_two
