label scene_eleven:

    play music "audio/Сцена 11/Катакомби Амбієнт I.mp3"
    scene катакомби_1 with dissolve

    "{i}Не вірю своїм очам."

    "{i}Під землею на мене чекає ціле підземне містечко."

    "{i}Стоїть гомін голосів. Це й було звуком, який я почула раніше."

    "{i}Все довкола зроблене зі сміття. Зшито зі шматків тканини, зкреплено з залізяк."

    "{i}По закутках на матрацах та просто на підлозі сидять люди."

    "{i}Дуже бліді. Майже в усіх подекуди стирчать з блискучих поголених голів дреди."

    "{i}Такі самі, як у Йербі."

    "{i}Вдягнені зовсім не так, як люди в Оазі. Але й не так, як люди на периферії міста. А ще цей сморід…"

    "{i}Запах поту. Йербі сказав, що тут живуть ті, хто виконує найбруднішу роботу в місті."

    "{i}Що він мав на увазі?"

    "{i}Повз мене проходять двоє хлопців."

    хлопець1 "Ще одна прибулиця з поверхні…"

    хлопець2 "Що тобі тут треба? Краще забирайся звідси."

    хлопець1 "Геть!"

    "{i}Він різко нахиляється до мене й загрозливо піднімає свої довгі, неймовірно худі руки, намагаючись мене нажахати. Сміються з мого подиву."

    "{i}А потім вони йдуть. Але я встигла дещо помітити на його руках, коли він витяг їх з рукавів балахону."

    "{i}Шрами від порізів."

    "{i}Придивившись до людей, я помічаю, що дехто з них сидить, огорнувши руками коліна, і похитується."

    "{i}А хтось лежить, обхопивши руками голову."

    "{i}Синдром відміни?"

    "{i}Та ні, я ж безліч разів бачила абстиненцію. І у цих людей вона, м'яко кажучи, нетипова."

    "{i}Від цього дивного місця, від дивних людей з їх дивними симптомами стає моторошно."

    "{i}Що ж тут в біса таке відбувається?!"

    "{i}У похитуваннях людей з дивним симптомом, який я спочатку прийняла за ломку, є ритм. І моє тіло починає похитуватися в цьому ритмі, саме по собі."

    show генто нейтральний at right2 with dissolve
    show павка здивована at left2 with dissolve
    невідомий "Металу — корозія."

    show павка розгублена at left2 with dissolve
    "{i}Ніколи б не подумала, що ці слова можуть колись викликати в мене таке полегшення!"

    "{i}Я приходжу до тями."

    павка "Людям — кайф?"

    show павка усміхнена at left2 with dissolve
    павка "Ви тут, щоб допомогти мені покинути Купол?"

    show генто посмішка at right2 with dissolve
    невідомий "Свобода від Купола! Саме так. Мене, до речі, звати Генто."

    show павка задумлива at left2 with dissolve
    "{i}Я повинна дізнатися про те, що тут відбувається. Але спершу…"

    павка "Я маю тобі дещо сказати. Твій товариш, Йербі…"

    генто "Знаю, Павко. Мені вже повідомили. Йербіонім Амікаріус загинув смертю хоробрих. То ж ходім, Павко — завершимо те, заради чого він віддав своє життя."

    show павка рішуча at left2 with dissolve
    "{i}Якщо я не дізнаюся про все це зараз — не дізнаюся того вже ніколи."

    павка "Що з цими людьми?"

    генто "Відпочивають, як бачиш."

    павка "Ні, з ними щось не так. Йербі казав, що тут живуть ті, хто виконує найбруднішу роботу в Куполі. Що це за робота?"

    генто "Різноробочі вони. Ходім, вихід з катакомб — там."

    павка "Стій. Послухай мене. Я тікаю з Купола заради музики, але я також тікаю від цього клятого міста."

    павка "Я маю знати, що за сила мені все життя переламала. Мені та всім, кого я знаю."

    павка "А ці люди виглядають навіть гірше за тих, кому не вистачає годіуму. Розкажи мені."

    show генто невдоволений at right2 with dissolve
    генто "Тихше. Тут не слід казати слово 'годіум'. Ти тут туристка — тож не лізь у наші справи. Йди за мною і не треба зайвих питань, будь ласка."

    show павка задумлива at left2 with dissolve
    "{i}Мені нема чого втрачати. Я не можу покинути Купол, не розгадавши його загадку."

    "{i}Адже це місто створило мене."

    show павка рішуча at left2 with dissolve
    павка "Почекай."

    show генто невдоволений at right2 with dissolve
    генто "Ні."

    павка "Я МАЮ дізнатися правду."

    павка "Перед тим, як я заберуся з цього міста, я хочу дізнатися правду."

    show генто усміхнений at right2 with dissolve
    генто "Правду… Нащо вона тобі?"

    show павка рішуча at left2 with dissolve
    menu:
        "Мені набридло жити в темряві":
            show генто нейтральний at right2 with dissolve
            павка "Все моє життя мене оточувала брехня. Світ, виліплений з брехні."

            show павка рішуча at left2 with dissolve
            павка "Тепер я хочу знати про цей світ все, що тільки можна."

            show генто усміхнений at right2 with dissolve
            генто "І не лячно тобі?"

            show павка розгублена at left2 with dissolve
            павка "Чесно кажучи, трохи лячно."

            show павка рішуча at left2 with dissolve
            павка "Але я готова."

        "Я не можу змиритися з їх стражданнями":
            show павка рішуча at left2 with dissolve
            павка "Ці люди страждають, і я хочу знати, що можна зробити, щоб їм допомогти."

            show генто сумний at right2 with dissolve
            генто "А якщо їм вже нічим не можна допомогти? Що тоді?"

            show павка весела at left2 with dissolve
            павка "Надія все одно залишається. Хіба не для цього існує Антарес? Щоб допомагати людям не втрачати надію?"

        "Це якось пов’язано з тим, що я шукаю":
            show павка задумлива at left2 with dissolve
            павка "Я відчуваю, що це все якось пов'язано: годіум, музика, страждання цих людей…"

            show павка рішуча at left2 with dissolve
            павка "Я маю це зрозуміти, перш ніж рушатиму далі."

            show генто усміхнений at right2 with dissolve
            генто "То в тебе є місія, е? Що ж, сподіваюсь, ти знайдеш, що шукаєш."

    show генто нейтральний at right2 with dissolve
    генто "Гаразд, я покажу тобі правду."

    генто "Але попереджаю, що вона може тобі не сподобатися. Ти впевнена, що зможеш з цим далі жити?"

    павка "Впевнена, як ніколи."

    show генто усміхнений at right2 with dissolve
    генто "Тоді йди за мною. Зараз якраз обідня перерва, і ми зможемо пройти в робочу залу непоміченими."

    show генто нейтральний at right2 with dissolve
    "{i}Ми йдемо у бічний тунель, який закінчується величезними металевими дверима."

    "{i}Розсувні двері реагують на наше наближення, відкриваючи прохід."

    "{i}Коли двері зачиняються, Генто простягає руку до стіни. Щось клацає. На мить мені стає страшно. Я підозрюю пастку."
    scene катакомби_22 with dissolve
    show павка рішуча at left2 with dissolve
    show генто нейтральний at right2 with dissolve
    "{i}Заспокойся, Павко.Він не зможе заподіяти мені шкоди. Навіть якщо захоче. Надто слабкий на вигляд."

    генто "Ми ж не хочемо, щоб нас застали зненацька?"

    "{i}Ого, а у цій кімнаті висока стеля. Кімната потопає в плутанині гумових змій."

    "{i}Серед всіх цих дротів якісь крісла, а над кріслами на дротах зі стелі звисають шоломи дивної форми. На кожному — купа маленьких деталей."

    "{i}Кабіна, схожа на душову — але там точно не приймають душ. Вся техніка — наднова, все сяє, а ще…"

    генто "Не схоже на те, з чим тобі доводилося працювати, правда?"

    павка "Все це — ніби техніка з якогось майбутнього… Навіть Інкі б не змогла зрозуміти, що тут до чого."

    генто "Так, ці технології добре фінансують. Не дивно, що вони випереджають за розвитком ті, що на поверхні."


    павка "І що це?"

    генто "Ми в одній з наших робочих зал."

    павка "Ви не просто різноробочі. То хто ж ви?"

    show генто сумний at right2 with dissolve
    генто "А ми — ніхто."

    павка "В якому сенсі — ніхто?"

    генто "Ніхто з нас ніколи не зможе дослужитися навіть до професії прибиральника."

    генто "На нас не чекають на поверхні, нам не дають робочі місця. Я маю на увазі справжні робочі місця."

    генто "Нам не пропонують ніяких розваг і не готують їжу на замовлення."

    генто "Ми живемо й помираємо тихо, мов таргани за стінкою."

    генто "Ось це — шоломи для забору гормонів радості та задоволення. А ось це…"

    "{i}І Генто нахиляється, щоб показати мені свою зачіску. Тицяє пальцем у свої дреди."

    show павка здивована at left2 with dissolve
    "{i}А вони ще спочатку здалися мені косичками! Я тягнусь доторкнутись до них рукою. Генто не проти."

    "{i}Трубки, під'єднані до черепа. На доторк пластик теплий, ніби живий. Зігрітий теплом тіла мого супутника. Кожна з трубок закінчується маленькою чорною пащею, чорною прірвою коридора між світом зовнішнім та внутрішнім."

    генто "Роз'єми для під'єднання шолому. Я настільки до них звик, що вони — ніби продовження мого тіла."

    show павка здивована at left2 with dissolve
    павка "…"

    show павка налякана at left2 with dissolve
    павка "Вони роблять годіум з людей???"

    show генто усміхнений at right2 with dissolve
    генто "Технічно він зроблений з гормонів, які виробляють наші тіла."

    show генто сумний at right2 with dissolve
    генто "Але ти правильно все зрозуміла. Ваше зілля видобувають з наших мізків."

    show генто нейтральний at right2 with dissolve
    "{i}Бляха. Бляха, бляха, бляха…"

    "{i}Так, я одразу зрозуміла, для чого ці роз'єми. Але доки він це не сказав, в мене залишалася надія, що я помилилася."

    павка "Я… Я думала, що він синтетичний."

    "{i}Мене зараз знудить. Дихання перехоплює, в горлі стає ком."

    "{i}Як же я розлючена!"

    "{i}Годіум — це люди!"

    show павка розгублена at left2 with dissolve
    "{i}Нам усе життя навішують, що годіум — це синтетика."

    павка "Чорт забирай… Лайя був правий — я навіть гадки не мала, наскільки далеко сягає брехня Оази!"

    show павка сумна at left2 with dissolve
    павка "Наше штучне щастя — це люди. Про існування яких ми навіть не знали."

    павка "Нас годують людьми."

    павка "Це жахливо. Пробач мені… Я не знала."

    show генто сумний at right2 with dissolve
    генто "Ти ні в чому не винна. Ніхто зі споживачів годіуму не винен."

    show генто усміхнений at right2 with dissolve
    генто "Я ж казав, що правда тобі не сподобається."

    павка "Як… як ви виживаєте?"

    show генто усміхнений at right2 with dissolve
    "{i}Генто сміється. Мені дивно це бачити, з огляду на те, що з нього, якщо я правильно все зрозуміла, регулярно викочували усю органічну радість."

    "{i}Дивно і трохи моторошно."

    "{i}Але виглядав Генто цілком спокійно і навіть енергійно. Якщо не зважати на блідість і худорлявість."

    генто "А як ти гадаєш? Як можуть виживати такі, як я?"

    menu:
        "Антарес контрабандою провозить вам годіум?":
            show генто невдоволений at right2 with dissolve
            генто "Ну що за дурниці. Звісно ні."

            генто "Ми і є Антарес. В нас є агенти, що живуть на поверхні. Але більшість з нас — тут."

            show генто усміхнений at right2 with dissolve
            генто "У нас немає потреби в годіумі. Як бачиш, він пливе знизу наверх, а не навпаки."

        "Ви вживаєте якийсь інший наркотик?":
            show генто усміхнений at right2 with dissolve
            генто "Сестро, хіба тобі так важко уявити суспільство, що не складається поголовно зі втичерів та самогубців?"

            show генто невдоволений at right2 with dissolve
            генто "Те, що ви називаєте годіумом — лише знаряддя поневолення в руках Оази."

            генто "В ньому немає потреби там, куди не сягає її влада."

        "Ви навчилися обходитися без речовин?":
            show генто усміхнений at right2 with dissolve
            генто "В яблучко! Завжди приємно поговорити з розумною людиною."

            генто 'Ти вже знаєш відповідь. Адже ти сама нещодавно стала однією з тих, кого на поверхні називають "невживанцями".'

    show павка задумлива at left2 with dissolve
    павка "То всі ви — невживанці?"

    show генто невдоволений at right2 with dissolve
    генто "Ми тут не вживаємо це слово. З нашої точки зору, ми просто нормальні люди."

    генто "Те, що коїться у вас там, на поверхні — ось це справді щось ненормальне."

    show павка здивована at left2 with dissolve
    павка "То ви всі в Антаресі? Всі, хто тут живуть?"

    show генто усміхнений at right2 with dissolve
    генто "Сестро, якби це було так, Оаза давно би нас знищила. Ми вимушені приховувати існування організації. І вступити Антарес дуже складно…"

    show павка задумлива at left2 with dissolve
    павка "Ви хочете зупинити видачу годіуму до Купола? Але ж тоді люди помруть від ломки…"

    show генто усміхнений at right2 with dissolve
    генто "Не помруть. Люди можуть жити без годіуму. Це їхній природній стан."

    генто "Хіба ти сама вже це не зрозуміла?"

    show павка задумлива at left2 with dissolve
    павка "Так, але…"

    "{i}Це все нагадує мені ту ніч. Ту ніч, коли я дізналась, що мій батько помирає..."

    stop music
    scene фон
    "..."

    jump scene_twelve
